[
  {
    "questionIdx": 120996,
    "questionWithBrackets": "Were [Meet Marlon Brando] and [Salesman] directed by a male person's spouse and directed by [Albert Maysles] and [David Maysles]",
    "questionPatternModEntities": "Were M2 and M5 directed by a male person 's spouse and directed by M3 and M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0k430 ns:film.film.directed_by ?x0 .\nns:m.0k430 ns:film.film.directed_by ns:m.0252pz5 .\nns:m.0k430 ns:film.film.directed_by ns:m.0252pzf .\nns:m.0w0h40s ns:film.film.directed_by ?x0 .\nns:m.0w0h40s ns:film.film.directed_by ns:m.0252pz5 .\nns:m.0w0h40s ns:film.film.directed_by ns:m.0252pzf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4 .\nM5 P2 ?x0 .\nM5 P2 M3 .\nM5 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 148364,
    "questionWithBrackets": "What did a French film producer that [Jean Epstein] was influenced by edit, produce, and direct",
    "questionPatternModEntities": "What did a French film producer that M1 was influenced by edit , produce , and direct",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:influence.influence_node.influenced ns:m.07g1jy .\n?x1 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\n?x1 P4 M2 .\n?x1 a M0\n}",
    "expectedResponse": "The Wheel; Napol\u00e9on",
    "recursionDepth": 43
  },
  {
    "questionIdx": 170248,
    "questionWithBrackets": "What was directed by [Porto of My Childhood]'s writer and star, directed by [Chen Kaige], and directed by a film producer",
    "questionPatternModEntities": "What was directed by M1 's writer and star , directed by M0 , and directed by a film producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ?x2 .\n?x0 ns:film.film.directed_by ns:m.0253dk .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0bgk8gc .\n?x1 ns:film.writer.film ns:m.0bgk8gc .\n?x2 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x2 a M2\n}",
    "expectedResponse": "To Each His Own Cinema",
    "recursionDepth": 43
  },
  {
    "questionIdx": 58250,
    "questionWithBrackets": "Was [Heinemann] acquired by [Octopus Publishing] and [Thomas Tilling] and acquired by a company that [Random House UK] and [Philip Morris USA] acquired",
    "questionPatternModEntities": "Was M3 acquired by M4 and M5 and acquired by a company that M1 and M2 acquired",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03kjrs .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.05qhtqc .\nns:m.0dt43d ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x0 .\nns:m.0dt43d ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03nww9n .\nns:m.0dt43d ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.05pxdjf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nM3 P0 ?x0 .\nM3 P0 M4 .\nM3 P0 M5\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 224977,
    "questionWithBrackets": "Who was a British art director that [Vincenzo Natali] was influenced by and [Rachel Weisz]'s spouse was influenced by",
    "questionPatternModEntities": "Who was a British art director that M2 was influenced by and M4 's spouse was influenced by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] 's [ROLE_SIMPLE] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ns:m.07kvyt .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.014x77 .\nFILTER ( ?x1 != ns:m.014x77 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M4 .\nFILTER ( ?x1 != M4 )\n}",
    "expectedResponse": "Terry Gilliam",
    "recursionDepth": 43
  },
  {
    "questionIdx": 221644,
    "questionWithBrackets": "Who married a star of [Angela Mooney], was influenced by an art director, and was influenced by [Roger Angell]",
    "questionPatternModEntities": "Who married a star of M3 , was influenced by a art director , and was influenced by M1",
    "questionTemplate": "Who [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] , was [VP_SIMPLE] by a [NP_SIMPLE] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.06l7l .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 a ns:film.film_art_director .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.0bw3xl7 .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M2 .\n?x2 P2 M3 .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "Woody Allen",
    "recursionDepth": 43
  },
  {
    "questionIdx": 151655,
    "questionWithBrackets": "What did an editor of [Suite Ancienne] executive produce, write, produce, direct, and edit",
    "questionPatternModEntities": "What did a editor of M0 executive produce , write , produce , direct , and edit",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.010nr1g9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0\n}",
    "expectedResponse": "Dead People",
    "recursionDepth": 43
  },
  {
    "questionIdx": 72521,
    "questionWithBrackets": "Was [Promises Written in Water] executive produced by, written by, produced by, directed by, and edited by [The Brown Bunny]'s costume designer",
    "questionPatternModEntities": "Was M1 executive produced by , written by , produced by , directed by , and edited by M0 's costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy .\nns:m.0bh9qf1 ns:film.film.directed_by ?x0 .\nns:m.0bh9qf1 ns:film.film.edited_by ?x0 .\nns:m.0bh9qf1 ns:film.film.executive_produced_by ?x0 .\nns:m.0bh9qf1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bh9qf1 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 2091,
    "questionWithBrackets": "Did [Bajarse al moro] and [Blindfolded Eyes] star [Carmen Maura] and star a Spanish screenwriter's female child",
    "questionPatternModEntities": "Did M3 and M5 star M4 and star a Spanish screenwriter 's female child",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.06mkj .\nns:m.03qkkh1 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.03qkkh1 ns:film.film.starring/ns:film.performance.actor ns:m.089m1l .\nns:m.06414kf ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.06414kf ns:film.film.starring/ns:film.performance.actor ns:m.089m1l\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 a M1 .\nM3 P3 ?x0 .\nM3 P3 M4 .\nM5 P3 ?x0 .\nM5 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 180999,
    "questionWithBrackets": "What was produced by [Andy Bausch] and [Klaus Maeck], written by [Micha\u0142 Englert], and produced by a Swedish film producer",
    "questionPatternModEntities": "What was produced by M1 and M2 , written by M0 , and produced by a Swedish film producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.038wxz .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0c0bp4y .\n?x0 ns:film.film.written_by ns:m.093fk9c .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x1 P2 M4 .\n?x1 a M3\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 43
  },
  {
    "questionIdx": 145433,
    "questionWithBrackets": "What did [My Name Is Bruce]'s producer and star found and [The Evil Dead]'s executive producer, director, and writer found",
    "questionPatternModEntities": "What did M0 's producer and star found and M1 's executive producer , director , and writer found",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0bdt9s .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0bdt9s .\n?x2 ns:film.director.film ns:m.02jqk .\n?x2 ns:film.producer.films_executive_produced ns:m.02jqk .\n?x2 ns:film.writer.film ns:m.02jqk\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x2 P3 M1 .\n?x2 P4 M1 .\n?x2 P5 M1\n}",
    "expectedResponse": "Renaissance Pictures",
    "recursionDepth": 43
  },
  {
    "questionIdx": 69339,
    "questionWithBrackets": "Was [Nicole Scherzinger] influenced by [Joe Strummer], influenced by a female actor of [Violet Parr], and influenced by [Jeff Tweedy]",
    "questionPatternModEntities": "Was M2 influenced by M3 , influenced by a female actor of M0 , and influenced by M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.06k0bf .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.0gps0z ns:influence.influence_node.influenced_by ?x0 .\nns:m.0gps0z ns:influence.influence_node.influenced_by ns:m.01w5gg6 .\nns:m.0gps0z ns:influence.influence_node.influenced_by ns:m.03ryzd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 59024,
    "questionWithBrackets": "Was [Human Rights Association] founded by a film director, founded by [Ali Sirmen] and [Murat Belge], and founded by [Enid Bennett]'s spouse",
    "questionPatternModEntities": "Was M2 founded by a film director , founded by M3 and M4 , and founded by M1 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0ks0jf .\nFILTER ( ?x1 != ns:m.0ks0jf ) .\nns:m.02r1shh ns:organization.organization.founders ?x0 .\nns:m.02r1shh ns:organization.organization.founders ?x1 .\nns:m.02r1shh ns:organization.organization.founders ns:m.0819rb .\nns:m.02r1shh ns:organization.organization.founders ns:m.0w37w9g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nFILTER ( ?x1 != M1 ) .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM2 P1 M3 .\nM2 P1 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 25785,
    "questionWithBrackets": "Did [Zoolander] star [Jackie Johnson], star a film producer's Swedish child, and star [Dallas Kane Hewitt]",
    "questionPatternModEntities": "Did M2 star M3 , star a film producer 's Swedish child , and star M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d0vqn .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.producer .\nns:m.01shy7 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.01shy7 ns:film.film.starring/ns:film.performance.actor ns:m.096y28 .\nns:m.01shy7 ns:film.film.starring/ns:film.performance.actor ns:m.0p7lf0q\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 111120,
    "questionWithBrackets": "Were ['Wag Kang Lilingon], [A Very Special Love], [Ikaw pa rin: Bongga ka boy!], [You Changed My Life], [Status: Single], and [Sisterakas] executive produced by a person and edited by [Marya Ignacio]",
    "questionPatternModEntities": "Were M1 , M3 , M4 , M5 , M6 , and M7 executive produced by a person and edited by M2",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\nns:m.02w91vx ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.02w91vx ns:film.film.executive_produced_by ?x0 .\nns:m.047gs0x ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.047gs0x ns:film.film.executive_produced_by ?x0 .\nns:m.04j04p8 ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.04j04p8 ns:film.film.executive_produced_by ?x0 .\nns:m.04zxypl ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.04zxypl ns:film.film.executive_produced_by ?x0 .\nns:m.0crr__p ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.0crr__p ns:film.film.executive_produced_by ?x0 .\nns:m.0k2dvs7 ns:film.film.edited_by ns:m.0hn61l5 .\nns:m.0k2dvs7 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 M2 .\nM3 P0 ?x0 .\nM3 P1 M2 .\nM4 P0 ?x0 .\nM4 P1 M2 .\nM5 P0 ?x0 .\nM5 P1 M2 .\nM6 P0 ?x0 .\nM6 P1 M2 .\nM7 P0 ?x0 .\nM7 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 179036,
    "questionWithBrackets": "What was executive produced, directed, produced, edited, and written by [Samad be madreseh miravad]'s writer and star",
    "questionPatternModEntities": "What was executive produced , directed , produced , edited , and written by M0 's writer and star",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:g.12qhkj517 .\n?x1 ns:film.writer.film ns:g.12qhkj517\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Samad dar rah ejdeha",
    "recursionDepth": 43
  },
  {
    "questionIdx": 220941,
    "questionWithBrackets": "Who married [Surrender, Dorothy]'s star and executive producer, was influenced by [Groucho Marx], and was influenced by [Cole Porter]",
    "questionPatternModEntities": "Who married M3 's star and executive producer , was influenced by M1 , and was influenced by M2",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.01jrvr6 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01wj9y9 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.04j10wf .\n?x1 ns:film.producer.films_executive_produced ns:m.04j10wf .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Woody Allen",
    "recursionDepth": 43
  },
  {
    "questionIdx": 119375,
    "questionWithBrackets": "Were [Johnny Guitar], [Sands of Iwo Jima], [Under Fiesta Stars], [The Maverick Queen], and [Stardust on the Sage] distributed and produced by a film producer's employer's child",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 distributed and produced by a film producer 's employer 's child",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.producer .\nns:m.0147f1 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0147f1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.03jp4yj ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.03jp4yj ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.04w25m ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.04w25m ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.09s283v ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.09s283v ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0crw7z4 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0crw7z4 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM4 P2 ?x0 .\nM4 P3 ?x0 .\nM5 P2 ?x0 .\nM5 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 125589,
    "questionWithBrackets": "Were [Tetsuo: The Iron Man] and [Nightmare Detective] edited, produced, and directed by an executive producer, cinematographer, and art director of [Erasable Cities]",
    "questionPatternModEntities": "Were M1 and M2 edited , produced , and directed by a executive producer , cinematographer , and art director of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0k3qrys .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0k3qrys .\n?x0 ns:film.producer.films_executive_produced ns:m.0k3qrys .\nns:m.02qq666 ns:film.film.directed_by ?x0 .\nns:m.02qq666 ns:film.film.edited_by ?x0 .\nns:m.02qq666 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.05m0x0 ns:film.film.directed_by ?x0 .\nns:m.05m0x0 ns:film.film.edited_by ?x0 .\nns:m.05m0x0 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 179034,
    "questionWithBrackets": "What was executive produced, directed, produced, edited, and written by [Dreams from the Woods]'s Swedish writer",
    "questionPatternModEntities": "What was executive produced , directed , produced , edited , and written by M0 's Swedish writer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.writer.film ns:m.0cj7gny .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M1\n}",
    "expectedResponse": "The Tale of Little Puppetboy",
    "recursionDepth": 43
  },
  {
    "questionIdx": 232207,
    "questionWithBrackets": "Who was a screenwriter that [AQP Collective]'s founder and employee was influenced by and [Giannina Braschi] was influenced by",
    "questionPatternModEntities": "Who was a screenwriter that M3 's founder and employee was influenced by and M2 was influenced by",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ns:m.02pjnlx .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.03wyqg3 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03wyqg3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M3 .\n?x1 P2 M3\n}",
    "expectedResponse": "James Joyce",
    "recursionDepth": 43
  },
  {
    "questionIdx": 114691,
    "questionWithBrackets": "Were [Charlie Callas] and [Marcel Marceau] influenced by a film's producer, editor, and writer and influenced by [Groucho Marx]",
    "questionPatternModEntities": "Were M1 and M3 influenced by a film 's producer , editor , and writer and influenced by M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 a ns:film.film .\nns:m.017_65 ns:influence.influence_node.influenced_by ?x0 .\nns:m.017_65 ns:influence.influence_node.influenced_by ns:m.01wj9y9 .\nns:m.0frqwk ns:influence.influence_node.influenced_by ?x0 .\nns:m.0frqwk ns:influence.influence_node.influenced_by ns:m.01wj9y9\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M0 .\nM1 P3 ?x0 .\nM1 P3 M2 .\nM3 P3 ?x0 .\nM3 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 86684,
    "questionWithBrackets": "Was [White Elephant] directed by, executive produced by, edited by, written by, and produced by [1988: The Remake]'s producer",
    "questionPatternModEntities": "Was M1 directed by , executive produced by , edited by , written by , and produced by M0 's producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0zncdr9 .\nns:m.0jkyb3n ns:film.film.directed_by ?x0 .\nns:m.0jkyb3n ns:film.film.edited_by ?x0 .\nns:m.0jkyb3n ns:film.film.executive_produced_by ?x0 .\nns:m.0jkyb3n ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0jkyb3n ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 119188,
    "questionWithBrackets": "Were [Jersey Girl], [Hail, Caesar!], [A Serious Man], [Burn After Reading], and [O Brother, Where Art Thou?] edited by [Where the Girls Are]'s executive producer and edited by a screenwriter",
    "questionPatternModEntities": "Were M2 , M3 , M4 , M5 , and M6 edited by M1 's executive producer and edited by a screenwriter",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x1 ns:film.producer.films_executive_produced ns:m.04hz17f .\nns:m.02704ff ns:film.film.edited_by ?x0 .\nns:m.02704ff ns:film.film.edited_by ?x1 .\nns:m.02qzh2 ns:film.film.edited_by ?x0 .\nns:m.02qzh2 ns:film.film.edited_by ?x1 .\nns:m.02r1c18 ns:film.film.edited_by ?x0 .\nns:m.02r1c18 ns:film.film.edited_by ?x1 .\nns:m.05kr4 ns:film.film.edited_by ?x0 .\nns:m.05kr4 ns:film.film.edited_by ?x1 .\nns:m.0b_rqq ns:film.film.edited_by ?x0 .\nns:m.0b_rqq ns:film.film.edited_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM3 P1 ?x0 .\nM3 P1 ?x1 .\nM4 P1 ?x0 .\nM4 P1 ?x1 .\nM5 P1 ?x0 .\nM5 P1 ?x1 .\nM6 P1 ?x0 .\nM6 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 179191,
    "questionWithBrackets": "What was executive produced, produced, written, edited, and directed by [Goat Story 2]'s cinematographer and art director",
    "questionPatternModEntities": "What was executive produced , produced , written , edited , and directed by M0 's cinematographer and art director",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0nbtt_1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0nbtt_1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Goat Story",
    "recursionDepth": 43
  },
  {
    "questionIdx": 20413,
    "questionWithBrackets": "Did [Talk Radio] star a Mexican costume designer's spouse, star [Theresa Bell], and star [Carl Kissin]",
    "questionPatternModEntities": "Did M2 star a Mexican costume designer 's spouse , star M3 , and star M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_costumer_designer .\n?x1 ns:people.person.nationality ns:m.0b90_r .\nFILTER ( ?x0 != ?x1 ) .\nns:m.071bj2 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.071bj2 ns:film.film.starring/ns:film.performance.actor ns:m.0tl4rzc .\nns:m.071bj2 ns:film.film.starring/ns:film.performance.actor ns:m.0tl5kyn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  }
]