[
  {
    "questionIdx": 216638,
    "questionWithBrackets": "Who did an executive producer and star of [Rupert and the Frog Song] influence",
    "questionPatternModEntities": "Who did a executive producer and star of M1 influence",
    "questionTemplate": "Who did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0cyllk .\n?x1 ns:film.producer.films_executive_produced ns:m.0cyllk\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "George Michael",
    "recursionDepth": 21
  },
  {
    "questionIdx": 16384,
    "questionWithBrackets": "Did [Pak! Pak! My Dr. Kwak!]'s male executive producer executive produce [Stalked at 17]",
    "questionPatternModEntities": "Did M0 's male executive producer executive produce M1",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.0glrxnq .\n?x0 ns:film.producer.films_executive_produced ns:m.0nb345p .\n?x0 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 31853,
    "questionWithBrackets": "Did a director of [Texas Tom] and [Blood Work] produce [Absolute Power]",
    "questionPatternModEntities": "Did a director of M1 and M2 produce M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.02q722l .\n?x0 ns:film.director.film ns:m.043h5s .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.08sz9r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 207871,
    "questionWithBrackets": "Which person edited and directed [Ram Teri Ganga Maili]",
    "questionPatternModEntities": "Which person edited and directed M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.05k688 .\n?x0 ns:film.editor.film ns:m.05k688\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Raj Kapoor",
    "recursionDepth": 21
  },
  {
    "questionIdx": 157496,
    "questionWithBrackets": "What film producer employed [Benjamin Bronfman]'s sibling's parent",
    "questionPatternModEntities": "What film producer employed M1 's sibling 's parent",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gfgjtf .\nFILTER ( ?x2 != ns:m.0gfgjtf )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\nFILTER ( ?x2 != M1 )\n}",
    "expectedResponse": "Warner Music Group",
    "recursionDepth": 21
  },
  {
    "questionIdx": 230956,
    "questionWithBrackets": "Who was a film producer that was employed by [Folio Corporation]",
    "questionPatternModEntities": "Who was a film producer that was employed by M2",
    "questionTemplate": "Who was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04mx94b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Brad Pelo",
    "recursionDepth": 21
  },
  {
    "questionIdx": 38360,
    "questionWithBrackets": "Did a producer of [Brother Bear 2]'s prequel found [DePatie-Freleng Enterprises]",
    "questionPatternModEntities": "Did a producer of M1 's prequel found M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01x379 .\n?x1 ns:film.film.sequel ns:m.0bk2k2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 221775,
    "questionWithBrackets": "Who married an executive producer and writer of [Summer Eleven]",
    "questionPatternModEntities": "Who married a executive producer and writer of M1",
    "questionTemplate": "Who [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.0gm0zqz .\n?x1 ns:film.writer.film ns:m.0gm0zqz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Valerie Mahaffey",
    "recursionDepth": 21
  },
  {
    "questionIdx": 140628,
    "questionWithBrackets": "What company was founded by a costume designer of [Le baron fant\u00f4me]",
    "questionPatternModEntities": "What company was founded by a costume designer of M1",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0bbbnk_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Christian Dior S.A.",
    "recursionDepth": 21
  },
  {
    "questionIdx": 32023,
    "questionWithBrackets": "Did a distributor of [The Real Blonde] and [A Lady's Profession] acquire [TVX Broadcast Group]",
    "questionPatternModEntities": "Did a distributor of M1 and M2 acquire M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.012wv2g0 .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.06fhrc .\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.0dl0zr\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 203581,
    "questionWithBrackets": "Which film producer did [Pauline Kael] marry and influence",
    "questionPatternModEntities": "Which film producer did M1 marry and influence",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced_by ns:m.01tgbf .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.01tgbf .\nFILTER ( ?x0 != ns:m.01tgbf )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "James Broughton",
    "recursionDepth": 21
  },
  {
    "questionIdx": 31389,
    "questionWithBrackets": "Did a costume designer of [Picasso and Dance] influence [Max Jacob] and [Norman Ollestad]",
    "questionPatternModEntities": "Did a costume designer of M2 influence M0 and M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0qz85rr .\n?x0 ns:influence.influence_node.influenced ns:m.06w9gfk .\n?x0 ns:influence.influence_node.influenced ns:m.0g_00\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 41323,
    "questionWithBrackets": "Did an actor of [Logan] produce [X-Men: First Class]'s sequel",
    "questionPatternModEntities": "Did a actor of M0 produce M1 's sequel",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.01s283 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 ns:film.film.prequel ns:m.0cd2vh9\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 69957,
    "questionWithBrackets": "Was [Ole Sheldon] influenced by a spouse of a film editor",
    "questionPatternModEntities": "Was M1 influenced by a spouse of a film editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.editor .\nFILTER ( ?x0 != ?x1 ) .\nns:m.05q8drq ns:influence.influence_node.influenced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 216633,
    "questionWithBrackets": "Who did an executive producer and art director of [Tetsuo II: Body Hammer] influence",
    "questionPatternModEntities": "Who did a executive producer and art director of M1 influence",
    "questionTemplate": "Who did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x1 ns:film.producer.films_executive_produced ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 21
  },
  {
    "questionIdx": 86157,
    "questionWithBrackets": "Was [Walt Disney Pictures] a company that [Windstruck] was distributed by",
    "questionPatternModEntities": "Was M0 a company that M2 was distributed by",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.01795t a ns:business.employer .\nns:m.01795t ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.09_hyn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 110501,
    "questionWithBrackets": "Was an employer of [Bruce Broughton] founded by an art director",
    "questionPatternModEntities": "Was a employer of M0 founded by a art director",
    "questionTemplate": "Was a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0bxtyq .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 a ns:film.film_art_director\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 221619,
    "questionWithBrackets": "Who married a sibling and parent of [Taylor Hayes]",
    "questionPatternModEntities": "Who married a sibling and parent of M1",
    "questionTemplate": "Who [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.025v2m6 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.025v2m6 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.025v2m6 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Pamela Douglas",
    "recursionDepth": 21
  },
  {
    "questionIdx": 211123,
    "questionWithBrackets": "Which screenwriter wrote and directed [I Accidentally Domed Your Son]",
    "questionPatternModEntities": "Which screenwriter wrote and directed M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.director.film ns:m.0crsg44 .\n?x0 ns:film.writer.film ns:m.0crsg44\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Ryan Combs",
    "recursionDepth": 21
  },
  {
    "questionIdx": 215544,
    "questionWithBrackets": "Who did a Swedish art director of [Drowning Ghost] marry",
    "questionPatternModEntities": "Who did a Swedish art director of M2 marry",
    "questionTemplate": "Who did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.04yg4sm .\n?x1 ns:people.person.nationality ns:m.0d0vqn .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Suzane Crepault",
    "recursionDepth": 21
  },
  {
    "questionIdx": 101919,
    "questionWithBrackets": "Was a male actor of a film [Jason BARNARD]",
    "questionPatternModEntities": "Was a male actor of a film M1",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0121q8ds ns:film.actor.film/ns:film.performance.character ?x0 .\nns:m.0121q8ds ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 150203,
    "questionWithBrackets": "What did a male art director of [Prophets and Lessons] write",
    "questionPatternModEntities": "What did a male art director of M1 write",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0_bqxq6 .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "A Lesson Not Learned",
    "recursionDepth": 21
  },
  {
    "questionIdx": 50980,
    "questionWithBrackets": "Was [Cornell, 1965] directed by [Duo Concertantes]'s cinematographer and producer",
    "questionPatternModEntities": "Was M1 directed by M0 's cinematographer and producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0zvytp_ .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0zvytp_ .\nns:m.0zfc_j4 ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 168217,
    "questionWithBrackets": "What was a film distributor that was founded by [Paul Colichman]",
    "questionPatternModEntities": "What was a film distributor that was founded by M1",
    "questionTemplate": "What was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ns:m.04cs8v8\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "here TV",
    "recursionDepth": 21
  },
  {
    "questionIdx": 195770,
    "questionWithBrackets": "Which cinematographer did [Open Water 2: Adrift]'s prequel's cinematographer marry",
    "questionPatternModEntities": "Which cinematographer did M1 's prequel 's cinematographer marry",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x2 ns:film.film.sequel ns:m.0fb7g_ .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Chris Kentis; Laura Lau",
    "recursionDepth": 21
  },
  {
    "questionIdx": 51717,
    "questionWithBrackets": "Was [Dave Dictor] a Japanese spouse of an actor",
    "questionPatternModEntities": "Was M1 a Japanese spouse of a actor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nFILTER ( ns:m.03j3glj != ?x0 ) .\nns:m.03j3glj ns:people.person.nationality ns:m.03_3d .\nns:m.03j3glj ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 M2 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 57466,
    "questionWithBrackets": "Was [Gun Grut] a spouse of a Swedish art director",
    "questionPatternModEntities": "Was M2 a spouse of a Swedish art director",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:people.person.nationality ns:m.0d0vqn .\nFILTER ( ns:m.02k9djn != ?x0 ) .\nns:m.02k9djn ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 84358,
    "questionWithBrackets": "Was [Tung Chee Ping]'s Chinese sibling employed by [Win's Entertainment]",
    "questionPatternModEntities": "Was M0 's Chinese sibling employed by M1",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02rp3dj .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0v2qxpb .\nFILTER ( ?x0 != ns:m.0v2qxpb )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 74004,
    "questionWithBrackets": "Was [Richard Linklater] a film editor that was influenced by [Martin Scorsese]",
    "questionPatternModEntities": "Was M0 a film editor that was influenced by M2",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03dbds a ns:film.editor .\nns:m.03dbds ns:influence.influence_node.influenced_by ns:m.04sry\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 19014,
    "questionWithBrackets": "Did [Shackled]'s female costume designer executive produce [Amok]",
    "questionPatternModEntities": "Did M1 's female costume designer executive produce M0",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0qps2yl .\n?x0 ns:film.producer.films_executive_produced ns:m.0hnv209 .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 66261,
    "questionWithBrackets": "Was [Marianne Serpico] a Dutch parent of a film editor",
    "questionPatternModEntities": "Was M1 a Dutch parent of a film editor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\nns:m.0j8rxcl ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.0j8rxcl ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M2 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 150473,
    "questionWithBrackets": "What did a producer and costume designer of [Nosferatu] found",
    "questionPatternModEntities": "What did a producer and costume designer of M0 found",
    "questionTemplate": "What did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0l507 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0l507\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Prana Film",
    "recursionDepth": 21
  },
  {
    "questionIdx": 67351,
    "questionWithBrackets": "Was [Micha Haupman] a Chinese sibling of an actor",
    "questionPatternModEntities": "Was M1 a Chinese sibling of a actor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nFILTER ( ns:m.0dnj2cs != ?x0 ) .\nns:m.0dnj2cs ns:people.person.nationality ns:m.0d05w3 .\nns:m.0dnj2cs ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 78184,
    "questionWithBrackets": "Was [Tales of a Street Corner] produced by [Chieko Nakakita]'s Japanese spouse",
    "questionPatternModEntities": "Was M2 produced by M1 's Japanese spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0k1l39 .\nFILTER ( ?x0 != ns:m.0k1l39 ) .\nns:m.0zb0d2x ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 193626,
    "questionWithBrackets": "Which actor wrote and directed [Howling III]",
    "questionPatternModEntities": "Which actor wrote and directed M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.director.film ns:m.07zhf9 .\n?x0 ns:film.writer.film ns:m.07zhf9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Philippe Mora",
    "recursionDepth": 21
  },
  {
    "questionIdx": 109155,
    "questionWithBrackets": "Was an art director and writer of a film [Massimo Ottoni]",
    "questionPatternModEntities": "Was a art director and writer of a film M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] and [ROLE_SIMPLE] of a [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.010r1g5f ns:film.film_art_director.films_art_directed ?x0 .\nns:m.010r1g5f ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 62504,
    "questionWithBrackets": "Was [Kamyra Stanfield] a sibling of [Capitol Records]'s employee's actor",
    "questionPatternModEntities": "Was M1 a sibling of M0 's employee 's actor",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.017l96 .\nFILTER ( ns:m.0z40w67 != ?x0 ) .\nns:m.0z40w67 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 149497,
    "questionWithBrackets": "What did a female art director of [Into Temptation] write",
    "questionPatternModEntities": "What did a female art director of M1 write",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0bh7v56 .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Special Moments By Oksana",
    "recursionDepth": 21
  },
  {
    "questionIdx": 229277,
    "questionWithBrackets": "Who was a costume designer that [Raghubir Singh] was influenced by",
    "questionPatternModEntities": "Who was a costume designer that M2 was influenced by",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.027fdff\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Satyajit Ray",
    "recursionDepth": 21
  },
  {
    "questionIdx": 47591,
    "questionWithBrackets": "Was [Bernadette Landru] a female spouse of a costume designer",
    "questionPatternModEntities": "Was M1 a female spouse of a costume designer",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\nFILTER ( ns:m.0rbbwnm != ?x0 ) .\nns:m.0rbbwnm ns:people.person.gender ns:m.02zsn .\nns:m.0rbbwnm ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 M2 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 21
  },
  {
    "questionIdx": 177317,
    "questionWithBrackets": "What was executive produced by [The Big Alligator River]'s Italian writer",
    "questionPatternModEntities": "What was executive produced by M0 's Italian writer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.writer.film ns:m.0crvdk1 .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "The Battle of El Alamein",
    "recursionDepth": 21
  },
  {
    "questionIdx": 215616,
    "questionWithBrackets": "Who did a cinematographer and star of [Tales Of An Island] marry",
    "questionPatternModEntities": "Who did a cinematographer and star of M1 marry",
    "questionTemplate": "Who did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0gksfp0 .\n?x1 ns:film.cinematographer.film ns:m.0gksfp0 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Marzieh Meshkini; Fatemeh Meshkini",
    "recursionDepth": 21
  }
]