[
  {
    "questionIdx": 124757,
    "questionWithBrackets": "Were [Sol Dominicana Airlines] and [Haig Fund] founded by a British character",
    "questionPatternModEntities": "Were M2 and M3 founded by a British character",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:people.person.nationality ns:m.07ssc .\nns:m.02rmzv4 ns:organization.organization.founders ?x0 .\nns:m.04k278 ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 24
  },
  {
    "questionIdx": 7309,
    "questionWithBrackets": "Did [Fate Fighter] and [Raped by an Angel] star [Golden Chicken]'s Chinese editor",
    "questionPatternModEntities": "Did M2 and M3 star M1 's Chinese editor",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0ft56q .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nns:m.03cp602 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04j2h31 ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 117016,
    "questionWithBrackets": "Were [Gala-Salvador Dal\u00ed Foundation] and [Dal\u00ed Theatre and Museum] founded by a Spanish costume designer",
    "questionPatternModEntities": "Were M2 and M3 founded by a Spanish costume designer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.nationality ns:m.06mkj .\nns:m.04y9w_t ns:organization.organization.founders ?x0 .\nns:m.0pzb8 ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 156502,
    "questionWithBrackets": "What film editor did a Spanish parent of [Milan Piqu\u00e9 Mebarak] marry",
    "questionPatternModEntities": "What film editor did a Spanish parent of M2 marry",
    "questionTemplate": "What [NP_SIMPLE] did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0py54td .\n?x1 ns:people.person.nationality ns:m.06mkj .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Shakira",
    "recursionDepth": 24
  },
  {
    "questionIdx": 24354,
    "questionWithBrackets": "Did [Victoria Rivas]'s actor marry [Roc\u00edo Dur\u00e1n]'s parent and spouse",
    "questionPatternModEntities": "Did M0 's actor marry M1 's parent and spouse",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0rg72q3 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0kb_31y .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0kb_31y .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0kb_31y )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 50755,
    "questionWithBrackets": "Was [Colby Schwartz] an American person's child and sibling",
    "questionPatternModEntities": "Was M2 a American person 's child and sibling",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\nFILTER ( ns:m.0ndnq14 != ?x0 ) .\nns:m.0ndnq14 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0 .\nns:m.0ndnq14 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 24
  },
  {
    "questionIdx": 110405,
    "questionWithBrackets": "Was an employee of [Northern Arizona University] a film editor's employer's employee",
    "questionPatternModEntities": "Was a employee of M0 a film editor 's employer 's employee",
    "questionTemplate": "Was a [ROLE_SIMPLE] of [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02xpy5 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.editor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 140115,
    "questionWithBrackets": "What cinematographer was influenced by [The Prince and the Showgirl]'s female executive producer",
    "questionPatternModEntities": "What cinematographer was influenced by M1 's female executive producer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.06cv63 .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Jayne Mansfield",
    "recursionDepth": 24
  },
  {
    "questionIdx": 227833,
    "questionWithBrackets": "Who was a Mexican film editor that [Mary Astor] married",
    "questionPatternModEntities": "Who was a Mexican film editor that M3 married",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02qhm3 .\nFILTER ( ?x0 != ns:m.02qhm3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Manuel del Campo",
    "recursionDepth": 24
  },
  {
    "questionIdx": 239026,
    "questionWithBrackets": "Who was influenced by and married [Lisa de Kooning]'s parent",
    "questionPatternModEntities": "Who was influenced by and married M1 's parent",
    "questionTemplate": "Who was [VP_SIMPLE] by and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0n3hll0 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Elaine de Kooning",
    "recursionDepth": 24
  },
  {
    "questionIdx": 181847,
    "questionWithBrackets": "What was produced by [Vikramaditya Motwane] and produced by a costume designer",
    "questionPatternModEntities": "What was produced by M0 and produced by a costume designer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0281mhl .\n?x1 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Hasee Toh Phasee",
    "recursionDepth": 25
  },
  {
    "questionIdx": 237159,
    "questionWithBrackets": "Who was influenced by [Sandra Wasserstein Meyer]'s female American sibling",
    "questionPatternModEntities": "Who was influenced by M1 's female American sibling",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.nationality ns:m.09c7w0 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0w3ng36 .\nFILTER ( ?x1 != ns:m.0w3ng36 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\n?x1 P3 M3 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Suzan-Lori Parks",
    "recursionDepth": 25
  },
  {
    "questionIdx": 61976,
    "questionWithBrackets": "Was [Jose Manuel Galvan]'s Spanish sibling's child and sibling [Baldomero Ballesteros]",
    "questionPatternModEntities": "Was M0 's Spanish sibling 's child and sibling M2",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0_n9wll .\nFILTER ( ?x0 != ns:m.0_n9wll ) .\nFILTER ( ns:m.0j17g9g != ?x0 ) .\nns:m.0j17g9g ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0 .\nns:m.0j17g9g ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P0 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 210560,
    "questionWithBrackets": "Which screenwriter married and influenced [Les dites cariatides]'s producer",
    "questionPatternModEntities": "Which screenwriter married and influenced M1 's producer",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0zncfpg .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 25
  },
  {
    "questionIdx": 216906,
    "questionWithBrackets": "Who distributed a film whose star edited [Blind Husbands]",
    "questionPatternModEntities": "Who distributed a film whose star edited M2",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ?x1 .\n?x1 a ns:film.film .\n?x1 ns:film.film.starring/ns:film.performance.actor ?x2 .\n?x2 ns:film.editor.film ns:m.04ydl_z\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 a M1 .\n?x2 P2 M2\n}",
    "expectedResponse": "Republic Pictures",
    "recursionDepth": 25
  },
  {
    "questionIdx": 59509,
    "questionWithBrackets": "Was [In Hanford] executive produced, edited, and written by [Chris Mars]",
    "questionPatternModEntities": "Was M0 executive produced , edited , and written by M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0q2lst6 ns:film.film.edited_by ns:m.01pr7kp .\nns:m.0q2lst6 ns:film.film.executive_produced_by ns:m.01pr7kp .\nns:m.0q2lst6 ns:film.film.written_by ns:m.01pr7kp\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 123750,
    "questionWithBrackets": "Were [Rise of the Guardians] and [Y volver\u00e9...] executive produced by a Mexican cinematographer",
    "questionPatternModEntities": "Were M2 and M3 executive produced by a Mexican cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.nationality ns:m.0b90_r .\nns:m.010bx641 ns:film.film.executive_produced_by ?x0 .\nns:m.06wbm8q ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 208008,
    "questionWithBrackets": "Which person produced and edited [The Basis Of Make-up II]'s sequel",
    "questionPatternModEntities": "Which person produced and edited M1 's sequel",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 ns:film.film.prequel ns:m.0_skn10\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Heinz Emigholz",
    "recursionDepth": 25
  },
  {
    "questionIdx": 146390,
    "questionWithBrackets": "What did [Shout! Factory] distribute and [Amy Moynihan]'s spouse produce",
    "questionPatternModEntities": "What did M0 distribute and M1 's spouse produce",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.08d8xn .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0jb81pc .\nFILTER ( ?x1 != ns:m.0jb81pc )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Our Friend, Martin",
    "recursionDepth": 25
  },
  {
    "questionIdx": 149828,
    "questionWithBrackets": "What did a film editor edit and [Darren Aronofsky] executive produce",
    "questionPatternModEntities": "What did a film editor edit and M0 executive produce",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.017c87 .\n?x1 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "The Fighter",
    "recursionDepth": 25
  },
  {
    "questionIdx": 64385,
    "questionWithBrackets": "Was [Light Plate] executive produced by a film's cinematographer and editor",
    "questionPatternModEntities": "Was M1 executive produced by a film 's cinematographer and editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:film.editor.film ?x1 .\n?x1 a ns:film.film .\nns:m.0rh82jn ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 39642,
    "questionWithBrackets": "Did a sibling of [Ripon Cathedral]'s employee's child influence [Stephen Dedman]",
    "questionPatternModEntities": "Did a sibling of M1 's employee 's child influence M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.088bdn .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01z8nd .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 11403,
    "questionWithBrackets": "Did [Ji dou shou xing] star a Canadian spouse of an art director",
    "questionPatternModEntities": "Did M2 star a Canadian spouse of a art director",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0gkshf9 ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 221761,
    "questionWithBrackets": "Who married an editor, writer, and art director of [The Color of Pomegranates]",
    "questionPatternModEntities": "Who married a editor , writer , and art director of M1",
    "questionTemplate": "Who [VP_SIMPLE] a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.editor.film ns:m.05hmb7 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.05hmb7 .\n?x1 ns:film.writer.film ns:m.05hmb7 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Nigyar Kerimova; Svetlana Paradjanov",
    "recursionDepth": 25
  },
  {
    "questionIdx": 85201,
    "questionWithBrackets": "Was [Vestron Video] a child of a film distributor's child and parent",
    "questionPatternModEntities": "Was M1 a child of a film distributor 's child and parent",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.film_distributor .\nns:m.09btnf ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 66703,
    "questionWithBrackets": "Was [Matthew Avant] an art director, editor, and star of a film",
    "questionPatternModEntities": "Was M1 a art director , editor , and star of a film",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0h4yxvm ns:film.actor.film/ns:film.performance.film ?x0 .\nns:m.0h4yxvm ns:film.editor.film ?x0 .\nns:m.0h4yxvm ns:film.film_art_director.films_art_directed ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 119128,
    "questionWithBrackets": "Were [Janumada Gelathi] and [Idu Saadhya] written by [Kaathil Oru Kinnaram]'s male cinematographer",
    "questionPatternModEntities": "Were M2 and M3 written by M1 's male cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0120yydd .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.051xsqm ns:film.film.written_by ?x0 .\nns:m.0nhk69d ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 237317,
    "questionWithBrackets": "Who was influenced by [Tetsuo II: Body Hammer]'s art director, cinematographer, and executive producer",
    "questionPatternModEntities": "Who was influenced by M1 's art director , cinematographer , and executive producer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0brs6b .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x1 ns:film.producer.films_executive_produced ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 25
  },
  {
    "questionIdx": 62885,
    "questionWithBrackets": "Was [Ke\u014dp\u016bolani]'s female child's spouse and sibling [Kamehameha III]",
    "questionPatternModEntities": "Was M1 's female child 's spouse and sibling M2",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.07w6vz .\nFILTER ( ns:m.03329d != ?x0 ) .\nFILTER ( ns:m.03329d != ?x0 ) .\nns:m.03329d ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0 .\nns:m.03329d ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 145438,
    "questionWithBrackets": "What did [NBCUniversal] acquire and [David T. Cassaro]'s employer acquire",
    "questionPatternModEntities": "What did M0 acquire and M1 's employer acquire",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02_l39 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04h_k3f\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Universal Studios",
    "recursionDepth": 25
  },
  {
    "questionIdx": 228768,
    "questionWithBrackets": "Who was a character that [China Versus Allied Powers] and [A Crazy Composer] were directed by",
    "questionPatternModEntities": "Who was a character that M2 and M3 were directed by",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] and [entity] were [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.012zw2qq .\n?x0 ns:film.director.film ns:m.0_mjnkt\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 25
  },
  {
    "questionIdx": 213716,
    "questionWithBrackets": "Who did [Amnesty International UK] employ and [Steven Farebrother]'s country of nationality employ",
    "questionPatternModEntities": "Who did M1 employ and M2 's country of nationality employ",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0120g5fq .\n?x1 ^ns:people.person.nationality ns:m.027xwvq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2\n}",
    "expectedResponse": "Kate Allen",
    "recursionDepth": 25
  },
  {
    "questionIdx": 137765,
    "questionWithBrackets": "What art director was a screenwriter that [Ex-Mas Eve] was executive produced by",
    "questionPatternModEntities": "What art director was a screenwriter that M2 was executive produced by",
    "questionTemplate": "What [NP_SIMPLE] was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 a ns:film.writer .\n?x0 ns:film.producer.films_executive_produced ns:m.026qj03\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Vsevolod Horodyskyj",
    "recursionDepth": 25
  },
  {
    "questionIdx": 30176,
    "questionWithBrackets": "Did a cinematographer marry a writer and art director of [The Kirov Ballet: Swan Lake]",
    "questionPatternModEntities": "Did a cinematographer marry a writer and art director of M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0crvb5s .\n?x1 ns:film.writer.film ns:m.0crvb5s .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 78900,
    "questionWithBrackets": "Was [The 1001: A Nature Trust]'s German Dutch founder's sibling [Herbert Frank]",
    "questionPatternModEntities": "Was M0 's German Dutch founder 's sibling M3",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.084jm0 .\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.nationality ns:m.059j2 .\nFILTER ( ns:m.073jm1m != ?x0 ) .\nns:m.073jm1m ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2 .\nFILTER ( M3 != ?x0 ) .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 94619,
    "questionWithBrackets": "Was a costume designer whose sibling wrote [Cosmopolis] a person",
    "questionPatternModEntities": "Was a costume designer whose sibling wrote M2 a person",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:people.person .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.writer.film ns:m.0gtvrv3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  }
]