[
  {
    "questionIdx": 104423,
    "questionWithBrackets": "Was a production company that [APriori Capital Partners] acquired, [Orion Pictures] was acquired by, and [TPG Capital] acquired [RadView Software]",
    "questionPatternModEntities": "Was a production company that M2 acquired , M4 was acquired by , and M3 acquired M0",
    "questionTemplate": "Was a [NP_SIMPLE] that [entity] [VP_SIMPLE] , [entity] was [VP_SIMPLE] by , and [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03p311t a ns:film.production_company .\nns:m.03p311t ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02qb2mr .\nns:m.03p311t ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03yqpb .\nns:m.03p311t ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.01f_mw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 P1 M4 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 122900,
    "questionWithBrackets": "Were [Project A Part II] and [Police Story 2] directed by [CZ12]'s producer, art director, and executive producer and executive produced by [Ana Moravi]",
    "questionPatternModEntities": "Were M1 and M3 directed by M0 's producer , art director , and executive producer and executive produced by M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.0hznzl6 .\n?x0 ns:film.producer.films_executive_produced ns:m.0hznzl6 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0hznzl6 .\nns:m.081jcn ns:film.film.directed_by ?x0 .\nns:m.081jcn ns:film.film.executive_produced_by ns:m.011shf4h .\nns:m.0c41bm ns:film.film.directed_by ?x0 .\nns:m.0c41bm ns:film.film.executive_produced_by ns:m.011shf4h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0 .\nM3 P3 M2 .\nM3 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 146966,
    "questionWithBrackets": "What did [The Brown Bunny]'s costume designer executive produce, produce, write, direct, and edit",
    "questionPatternModEntities": "What did M0 's costume designer executive produce , produce , write , direct , and edit",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 41
  },
  {
    "questionIdx": 174550,
    "questionWithBrackets": "What was edited by an actor, edited by [Adri\u00e1n Garc\u00eda Bogliano] and [Takanori Tsujimoto], and directed by an actor",
    "questionPatternModEntities": "What was edited by a actor , edited by M0 and M1 , and directed by a actor",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x0 ns:film.film.edited_by ns:m.0dxfsh0 .\n?x0 ns:film.film.edited_by ns:m.0gblx2c .\n?x1 a ns:film.actor .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x2 .\n?x1 a M2 .\n?x2 a M2\n}",
    "expectedResponse": "The ABCs of Death",
    "recursionDepth": 41
  },
  {
    "questionIdx": 142270,
    "questionWithBrackets": "What did [Beauty and the Beast]'s art director write, a screenwriter executive produce, and a cinematographer write",
    "questionPatternModEntities": "What did M1 's art director write , a screenwriter executive produce , and a cinematographer write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , a [NP_SIMPLE] [VP_SIMPLE] , and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x0 ns:film.film.written_by ?x3 .\n?x1 a ns:film.writer .\n?x2 ns:film.film_art_director.films_art_directed ns:m.0_7w6 .\n?x3 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P1 ?x3 .\n?x1 a M0 .\n?x2 P2 M1 .\n?x3 a M2\n}",
    "expectedResponse": "The Brave Little Toaster",
    "recursionDepth": 41
  },
  {
    "questionIdx": 83505,
    "questionWithBrackets": "Was [Three... Extremes] directed by a director and editor of [O Porto] and edited by a film editor's sibling",
    "questionPatternModEntities": "Was M2 directed by a director and editor of M1 and edited by a film editor 's sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.editor .\n?x2 ns:film.director.film ns:m.0_skr6c .\n?x2 ns:film.editor.film ns:m.0_skr6c .\nFILTER ( ?x0 != ?x1 ) .\nns:m.06cm6h ns:film.film.directed_by ?x2 .\nns:m.06cm6h ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\n?x2 P1 M1 .\n?x2 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM2 P4 ?x2\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 120805,
    "questionWithBrackets": "Were [Manuelle Labor] and [Tony Conrad, DreaMinimalist] written by, edited by, and produced by a female editor of [All My Relations]",
    "questionPatternModEntities": "Were M2 and M3 written by , edited by , and produced by a female editor of M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.09v769j .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.04p5nfr ns:film.film.edited_by ?x0 .\nns:m.04p5nfr ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.04p5nfr ns:film.film.written_by ?x0 .\nns:m.04p5p0h ns:film.film.edited_by ?x0 .\nns:m.04p5p0h ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.04p5p0h ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM3 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 7872,
    "questionWithBrackets": "Did [Friedrich Nietzsche] influence [Karl Marx] and [Ysabeau S. Wilce] and influence an actor's sibling's parent's parent",
    "questionPatternModEntities": "Did M1 influence M2 and M3 and influence a actor 's sibling 's parent 's parent",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x3 a ns:film.actor .\nFILTER ( ?x2 != ?x3 ) .\nns:m.02wh0 ns:influence.influence_node.influenced ?x0 .\nns:m.02wh0 ns:influence.influence_node.influenced ns:m.048cl .\nns:m.02wh0 ns:influence.influence_node.influenced ns:m.064klb6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P0 ?x2 .\n?x2 P1 ?x3 .\n?x3 a M0 .\nFILTER ( ?x2 != ?x3 ) .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 7750,
    "questionWithBrackets": "Did [Franklin D. Roosevelt] found a company, found a company, and found [Federal Reserve System] and [Office of Strategic Services]",
    "questionPatternModEntities": "Did M1 found a company , found a company , and found M2 and M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:business.employer .\n?x1 a ns:business.employer .\nns:m.02yy8 ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.02yy8 ns:organization.organization_founder.organizations_founded ?x1 .\nns:m.02yy8 ns:organization.organization_founder.organizations_founded ns:m.02xmb .\nns:m.02yy8 ns:organization.organization_founder.organizations_founded ns:m.05p50\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M0 .\nM1 P0 ?x0 .\nM1 P0 ?x1 .\nM1 P0 M2 .\nM1 P0 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 221900,
    "questionWithBrackets": "Who married, influenced, and was influenced by a screenwriter whose spouse married [Chantal Darget]",
    "questionPatternModEntities": "Who married , influenced , and was influenced by a screenwriter whose spouse married M2",
    "questionTemplate": "Who [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bvb0l1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.0bvb0l1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x1 a M1 .\n?x2 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 41
  },
  {
    "questionIdx": 234557,
    "questionWithBrackets": "Who was employed by [Johns Hopkins University], founded [Trilateral Commission], and was employed by a cinematographer's employer",
    "questionPatternModEntities": "Who was employed by M1 , founded M2 , and was employed by a cinematographer 's employer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] , [VP_SIMPLE] [entity] , and was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.013bfb .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.09kvv .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Zbigniew Brzezinski",
    "recursionDepth": 41
  },
  {
    "questionIdx": 124875,
    "questionWithBrackets": "Were [Spirited Away] and [On Your Mark] edited by [Takeshi Seyama] and directed by a Japanese employee of a company",
    "questionPatternModEntities": "Were M2 and M4 edited by M3 and directed by a Japanese employee of a company",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x1 a ns:business.employer .\nns:m.02xm38 ns:film.film.directed_by ?x0 .\nns:m.02xm38 ns:film.film.edited_by ns:m.0282qln .\nns:m.0j6b5 ns:film.film.directed_by ?x0 .\nns:m.0j6b5 ns:film.film.edited_by ns:m.0282qln\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 M3 .\nM2 P3 ?x0 .\nM4 P2 M3 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 89719,
    "questionWithBrackets": "Was a French screenwriter influenced by a parent of [Regina Johanna Bach] and influenced by [Giovanni Boccaccio] [Milan Kundera]",
    "questionPatternModEntities": "Was a French screenwriter influenced by a parent of M0 and influenced by M3 M1",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09lmpg5 .\nns:m.0951s a ns:film.writer .\nns:m.0951s ns:influence.influence_node.influenced_by ?x0 .\nns:m.0951s ns:influence.influence_node.influenced_by ns:m.03d66 .\nns:m.0951s ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M3 .\nM1 P2 M4 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 218546,
    "questionWithBrackets": "Who influenced [Ludwig Wittgenstein], was influenced by [Arthur Schopenhauer], and was influenced by a character's child",
    "questionPatternModEntities": "Who influenced M1 , was influenced by M2 , and was influenced by a character 's child",
    "questionTemplate": "Who [VP_SIMPLE] [entity] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.04hcw .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0j3v .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:fictional_universe.fictional_character\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Otto Weininger",
    "recursionDepth": 41
  },
  {
    "questionIdx": 129636,
    "questionWithBrackets": "Were [White Stork Is Coming] and [Animation vs. Animator 1] edited, produced, directed, written, and executive produced by a film editor",
    "questionPatternModEntities": "Were M1 and M2 edited , produced , directed , written , and executive produced by a film editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\nns:m.0108m1yx ns:film.film.directed_by ?x0 .\nns:m.0108m1yx ns:film.film.edited_by ?x0 .\nns:m.0108m1yx ns:film.film.executive_produced_by ?x0 .\nns:m.0108m1yx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0108m1yx ns:film.film.written_by ?x0 .\nns:m.0zxyz5j ns:film.film.directed_by ?x0 .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.executive_produced_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zxyz5j ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 172016,
    "questionWithBrackets": "What was directed, produced, executive produced, and written by [Kinefaktura]'s writer, cinematographer, and art director",
    "questionPatternModEntities": "What was directed , produced , executive produced , and written by M0 's writer , cinematographer , and art director",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0vsh_8l .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0vsh_8l .\n?x1 ns:film.writer.film ns:m.0vsh_8l\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 M0 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "FFF1",
    "recursionDepth": 42
  },
  {
    "questionIdx": 185244,
    "questionWithBrackets": "What was written by a director of [Wholphin: Issue 10], executive produced by [Scream 3]'s producer, and directed by [Brett Ratner]",
    "questionPatternModEntities": "What was written by a director of M2 , executive produced by M1 's producer , and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.0162c8 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02v63m .\n?x2 ns:film.director.film ns:m.0crs094\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P2 M0 .\n?x1 P3 M1 .\n?x2 P4 M2\n}",
    "expectedResponse": "New York, I Love You",
    "recursionDepth": 42
  },
  {
    "questionIdx": 147872,
    "questionWithBrackets": "What did [Warner Home Video] distribute, a Chinese film producer's sibling produce, and [Siren Visual] distribute",
    "questionPatternModEntities": "What did M0 distribute , a Chinese film producer 's sibling produce , and M1 distribute",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.04mkft .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.09gjmbj .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.producer .\n?x2 ns:people.person.nationality ns:m.0d05w3 .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M3 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "The Water Margin",
    "recursionDepth": 42
  },
  {
    "questionIdx": 79570,
    "questionWithBrackets": "Was [The Boat That Rocked] directed by, executive produced by, and written by a male founder of [Make Poverty History] and [Comic Relief]",
    "questionPatternModEntities": "Was M3 directed by , executive produced by , and written by a male founder of M0 and M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.058n6s .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0q055 .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.03ydlnj ns:film.film.directed_by ?x0 .\nns:m.03ydlnj ns:film.film.executive_produced_by ?x0 .\nns:m.03ydlnj ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM3 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 175530,
    "questionWithBrackets": "What was edited, directed, executive produced, written, and produced by a Chinese film producer",
    "questionPatternModEntities": "What was edited , directed , executive produced , written , and produced by a Chinese film producer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M1 .\n?x1 a M0\n}",
    "expectedResponse": "Grave Goods; Double Fikret",
    "recursionDepth": 42
  },
  {
    "questionIdx": 178650,
    "questionWithBrackets": "What was executive produced by, edited by, directed by, produced by, and written by [Nico Rockwell]'s parent",
    "questionPatternModEntities": "What was executive produced by , edited by , directed by , produced by , and written by M0 's parent",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0j2yhwf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0\n}",
    "expectedResponse": "Little Feet",
    "recursionDepth": 42
  },
  {
    "questionIdx": 22634,
    "questionWithBrackets": "Did [The Prize] and [My Favorite Spy] star [Jack Chefe], star [Sayre Dearing], and star a film producer's actor",
    "questionPatternModEntities": "Did M1 and M4 star M2 , star M3 , and star a film producer 's actor",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 a ns:film.producer .\nns:m.026p_bs ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.026p_bs ns:film.film.starring/ns:film.performance.actor ns:m.0k1s_ns .\nns:m.026p_bs ns:film.film.starring/ns:film.performance.actor ns:m.0pyrn08 .\nns:m.02wwdml ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.02wwdml ns:film.film.starring/ns:film.performance.actor ns:m.0k1s_ns .\nns:m.02wwdml ns:film.film.starring/ns:film.performance.actor ns:m.0pyrn08\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM4 P1 ?x0 .\nM4 P1 M2 .\nM4 P1 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 64321,
    "questionWithBrackets": "Was [Life! Camera Action...] produced by, written by, executive produced by, directed by, and edited by a costume designer",
    "questionPatternModEntities": "Was M1 produced by , written by , executive produced by , directed by , and edited by a costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\nns:m.0qft7d6 ns:film.film.directed_by ?x0 .\nns:m.0qft7d6 ns:film.film.edited_by ?x0 .\nns:m.0qft7d6 ns:film.film.executive_produced_by ?x0 .\nns:m.0qft7d6 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0qft7d6 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 143810,
    "questionWithBrackets": "What did [Harve Karbo]'s executive producer's spouse edit, [Yao Meng] write, and [Anthony Minghella] and [Natalie Portman] write",
    "questionPatternModEntities": "What did M3 's executive producer 's spouse edit , M0 write , and M1 and M2 write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ns:m.02hfp_ .\n?x0 ns:film.film.written_by ns:m.08lftln .\n?x0 ns:film.film.written_by ns:m.09l3p .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.producer.films_executive_produced ns:m.0hzbf4k .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M3 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "New York, I Love You",
    "recursionDepth": 42
  },
  {
    "questionIdx": 5614,
    "questionWithBrackets": "Did [Definitely, Maybe] star [Meissa Hampton], star a spouse and child of [Christine Koch], and star [Gerard Bianco Jr.]",
    "questionPatternModEntities": "Did M1 star M2 , star a spouse and child of M0 , and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0pyszpp .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0pyszpp .\nFILTER ( ?x0 != ns:m.0pyszpp ) .\nns:m.02z3rqk ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.02z3rqk ns:film.film.starring/ns:film.performance.actor ns:m.0c1g2s2 .\nns:m.02z3rqk ns:film.film.starring/ns:film.performance.actor ns:m.0vnycbx\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nFILTER ( ?x0 != M0 ) .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 115963,
    "questionWithBrackets": "Were [DreamWorks Animation] and [DreamWorks Records] founded by [David Geffen] and [Jeffrey Katzenberg] and founded by an employee and founder of [Clarium Capital]",
    "questionPatternModEntities": "Were M1 and M4 founded by M2 and M3 and founded by a employee and founder of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0cc5416 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0cc5416 .\nns:m.04gmlt ns:organization.organization.founders ?x0 .\nns:m.04gmlt ns:organization.organization.founders ns:m.01vhrz .\nns:m.04gmlt ns:organization.organization.founders ns:m.02rq9n .\nns:m.056ws9 ns:organization.organization.founders ?x0 .\nns:m.056ws9 ns:organization.organization.founders ns:m.01vhrz .\nns:m.056ws9 ns:organization.organization.founders ns:m.02rq9n\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM4 P2 ?x0 .\nM4 P2 M2 .\nM4 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 171396,
    "questionWithBrackets": "What was directed by, edited by, written by, executive produced by, and produced by [William Radochia]'s sibling",
    "questionPatternModEntities": "What was directed by , edited by , written by , executive produced by , and produced by M0 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.011nw623 .\nFILTER ( ?x1 != ns:m.011nw623 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Little Pen Lost",
    "recursionDepth": 42
  },
  {
    "questionIdx": 47865,
    "questionWithBrackets": "Was [Bill Hicks] a film producer that a star of [The Secret Life of Pets] and [American Hustle] was influenced by and [Sam Kinison] influenced",
    "questionPatternModEntities": "Was M2 a film producer that a star of M0 and M1 was influenced by and M4 influenced",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that a [ROLE_SIMPLE] of [entity] and [entity] was [VP_SIMPLE] by and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0115c2x3 .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0ryt9m1 .\nns:m.01wp_jm a ns:film.producer .\nns:m.01wp_jm ns:influence.influence_node.influenced ?x0 .\nns:m.01wp_jm ns:influence.influence_node.influenced_by ns:m.02gt7m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 M4 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  }
]