[
  {
    "questionIdx": 75451,
    "questionWithBrackets": "Was [Sara Hartmann] a child of an actor's parent",
    "questionPatternModEntities": "Was M1 a child of a actor 's parent",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.actor .\nns:m.0l1znh8 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 72035,
    "questionWithBrackets": "Was [Prizzi's Honor] produced by [Walt Disney Animation Studios]'s founder's employer",
    "questionPatternModEntities": "Was M1 produced by M0 's founder 's employer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.04rcl7 .\nns:m.0sxlb ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 54939,
    "questionWithBrackets": "Was [Fernando Solanas] [Social Genocide]'s director, cinematographer, and executive producer",
    "questionPatternModEntities": "Was M0 M1 's director , cinematographer , and executive producer",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.09_wn2 ns:film.cinematographer.film ns:m.03hn4wc .\nns:m.09_wn2 ns:film.director.film ns:m.03hn4wc .\nns:m.09_wn2 ns:film.producer.films_executive_produced ns:m.03hn4wc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 144637,
    "questionWithBrackets": "What did [Khiladi 786]'s male star executive produce",
    "questionPatternModEntities": "What did M0 's male star executive produce",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0hgrvh8 .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Breakaway",
    "recursionDepth": 20
  },
  {
    "questionIdx": 71220,
    "questionWithBrackets": "Was [Peppino De Filippo]'s Italian sibling's sibling [Albert Gallo]",
    "questionPatternModEntities": "Was M0 's Italian sibling 's sibling M2",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.08392m .\nFILTER ( ?x0 != ns:m.08392m ) .\nFILTER ( ns:m.026n1v6 != ?x0 ) .\nns:m.026n1v6 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 173692,
    "questionWithBrackets": "What was edited by [Park Ranger Janeway]'s American actor",
    "questionPatternModEntities": "What was edited by M1 's American actor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0pz6f7l .\n?x1 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Dead 7",
    "recursionDepth": 20
  },
  {
    "questionIdx": 188433,
    "questionWithBrackets": "Which Canadian screenwriter was employed by [Cloud Ten Pictures]",
    "questionPatternModEntities": "Which Canadian screenwriter was employed by M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.073n97 .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Paul LaLonde",
    "recursionDepth": 20
  },
  {
    "questionIdx": 13154,
    "questionWithBrackets": "Did [Liberals] employ a spouse of a cinematographer",
    "questionPatternModEntities": "Did M1 employ a spouse of a cinematographer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.cinematographer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.03tccl ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 47669,
    "questionWithBrackets": "Was [Bertrand Tavernier] influenced by [Goopy Bagha Phire Elo]'s prequel's costume designer",
    "questionPatternModEntities": "Was M1 influenced by M0 's prequel 's costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ?x1 .\n?x1 ns:film.film.sequel ns:m.0520brh .\nns:m.055ws3 ns:influence.influence_node.influenced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 40105,
    "questionWithBrackets": "Did a star of a film marry [Albert Bartridge Jr.]",
    "questionPatternModEntities": "Did a star of a film marry M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0h3b8x0 .\n?x1 a ns:film.film .\nFILTER ( ?x0 != ns:m.0h3b8x0 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 215742,
    "questionWithBrackets": "Who did a country of nationality of [Jane Campion]'s child employ",
    "questionPatternModEntities": "Who did a country of nationality of M1 's child employ",
    "questionTemplate": "Who did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.02r6c_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1\n}",
    "expectedResponse": "Mahinda Vilathgamuwa; Kumudu Munasinghe",
    "recursionDepth": 20
  },
  {
    "questionIdx": 216598,
    "questionWithBrackets": "Who did an editor of [Professor Pyarelal] and [Anari] influence",
    "questionPatternModEntities": "Who did a editor of M1 and M2 influence",
    "questionTemplate": "Who did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.editor.film ns:m.0bwl4ws .\n?x1 ns:film.editor.film ns:m.0fkp77\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2\n}",
    "expectedResponse": "Tupur Chatterjee; Tapur Chatterjee",
    "recursionDepth": 20
  },
  {
    "questionIdx": 13000,
    "questionWithBrackets": "Did [Leipzig University]'s German founder influence [Frank Gouldsmith Speck]",
    "questionPatternModEntities": "Did M1 's German founder influence M0",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.05xt46b .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01y06y .\n?x0 ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 47446,
    "questionWithBrackets": "Was [Behind the Planet of the Apes] edited by [Siegfried Sternberg]'s sibling's sibling",
    "questionPatternModEntities": "Was M1 edited by M0 's sibling 's sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0ksl2q1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0ksl2q1 ) .\nns:m.0crvtxj ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P0 M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M0 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 106062,
    "questionWithBrackets": "Was a sibling of a cinematographer's sibling [Glauco Onorato]",
    "questionPatternModEntities": "Was a sibling of a cinematographer 's sibling M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.cinematographer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.09v0w6j != ?x0 ) .\nns:m.09v0w6j ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 5823,
    "questionWithBrackets": "Did [Dil Se] star [Kaal]'s star and producer",
    "questionPatternModEntities": "Did M1 star M0 's star and producer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0278325 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0278325 .\nns:m.05xfj0 ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 11290,
    "questionWithBrackets": "Did [Jeffrey Chernov]'s employer's employee executive produce [The Ruins]",
    "questionPatternModEntities": "Did M1 's employer 's employee executive produce M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.03nqpb7 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03d9kqc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 49483,
    "questionWithBrackets": "Was [Carol Hubner] a producer of a film's prequel",
    "questionPatternModEntities": "Was M1 a producer of a film 's prequel",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 a ns:film.film .\nns:m.0vtt3lg ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 181260,
    "questionWithBrackets": "What was produced by [Geek Maggot Bingo]'s costume designer and editor",
    "questionPatternModEntities": "What was produced by M0 's costume designer and editor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.editor.film ns:m.04j1v_x .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.04j1v_x\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Geek Maggot Bingo; Mutable Fire",
    "recursionDepth": 20
  },
  {
    "questionIdx": 146938,
    "questionWithBrackets": "What did [The Brown Bunny]'s costume designer and editor executive produce",
    "questionPatternModEntities": "What did M0 's costume designer and editor executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.editor.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 20
  },
  {
    "questionIdx": 62899,
    "questionWithBrackets": "Was [Khoa Le] [Back To The Temple Of The Sun]'s art director, cinematographer, and editor",
    "questionPatternModEntities": "Was M0 M1 's art director , cinematographer , and editor",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.010psf5k ns:film.cinematographer.film ns:m.0_skmcz .\nns:m.010psf5k ns:film.editor.film ns:m.0_skmcz .\nns:m.010psf5k ns:film.film_art_director.films_art_directed ns:m.0_skmcz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 6288,
    "questionWithBrackets": "Did [Edmond Wong]'s parent executive produce [All's Well, Ends Well 1997]'s sequel",
    "questionPatternModEntities": "Did M0 's parent executive produce M1 's sequel",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0c1nffk .\n?x1 ns:film.film.prequel ns:m.0285yxn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 174082,
    "questionWithBrackets": "What was edited by [Young Aphrodites]'s costume designer and producer",
    "questionPatternModEntities": "What was edited by M0 's costume designer and producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.02q4n7k .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02q4n7k\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Oi paranomoi; O Drakos",
    "recursionDepth": 20
  },
  {
    "questionIdx": 149209,
    "questionWithBrackets": "What did a costume designer of [In the Mood for Love] and [Chungking Express] direct",
    "questionPatternModEntities": "What did a costume designer of M0 and M1 direct",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01f85k .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01f8gz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Shaolin Temple Against Lama; Esprit D'Amour",
    "recursionDepth": 20
  },
  {
    "questionIdx": 184503,
    "questionWithBrackets": "What was written by [Julie & Jack]'s costume designer and cinematographer",
    "questionPatternModEntities": "What was written by M0 's costume designer and cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0crtjmg .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0crtjmg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Birdemic: Shock and Terror; Julie & Jack",
    "recursionDepth": 20
  },
  {
    "questionIdx": 184116,
    "questionWithBrackets": "What was written by [Cazzo Film]'s German founder",
    "questionPatternModEntities": "What was written by M0 's German founder",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.05f83jk .\n?x1 ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Fucking Different XXX",
    "recursionDepth": 20
  },
  {
    "questionIdx": 151750,
    "questionWithBrackets": "What did an employee of [WGAR-FM] and [KJOY] found",
    "questionPatternModEntities": "What did a employee of M0 and M1 found",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02qz0dl .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.092vk3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Imus Ranch",
    "recursionDepth": 20
  },
  {
    "questionIdx": 73871,
    "questionWithBrackets": "Was [Rex Balsom] [Kyle Lewis]'s spouse, sibling, and parent",
    "questionPatternModEntities": "Was M0 M1 's spouse , sibling , and parent",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.0278psy != ns:m.05zvmcm ) .\nFILTER ( ns:m.0278psy != ns:m.05zvmcm ) .\nns:m.0278psy ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.05zvmcm .\nns:m.0278psy ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.05zvmcm .\nns:m.0278psy ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05zvmcm\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 27248,
    "questionWithBrackets": "Did a French art director executive produce [Mister Cok]",
    "questionPatternModEntities": "Did a French art director executive produce M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.producer.films_executive_produced ns:g.1237d7_1 .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 73248,
    "questionWithBrackets": "Was [Rachel van Galen] [S\u00f8ren Lerby]'s Dutch spouse's spouse",
    "questionPatternModEntities": "Was M2 M1 's Dutch spouse 's spouse",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.06_zty .\nFILTER ( ?x0 != ns:m.06_zty ) .\nFILTER ( ns:m.0v_kxp3 != ?x0 ) .\nns:m.0v_kxp3 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 56619,
    "questionWithBrackets": "Was [Gerard Adriaan Heineken] [Brarudi]'s parent's Dutch founder",
    "questionPatternModEntities": "Was M1 M0 's parent 's Dutch founder",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.011v7cw3 .\nns:m.01w4b4 ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.01w4b4 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 67527,
    "questionWithBrackets": "Was [Michiharu Otagiri] a sibling of a character's sibling",
    "questionPatternModEntities": "Was M1 a sibling of a character 's sibling",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:fictional_universe.fictional_character .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.0c02j1q != ?x0 ) .\nns:m.0c02j1q ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 27081,
    "questionWithBrackets": "Did a Dutch film producer executive produce [Sugarhouse]",
    "questionPatternModEntities": "Did a Dutch film producer executive produce M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.producer.films_executive_produced ns:m.02rpdtq .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 184891,
    "questionWithBrackets": "What was written by [Strictly Sexual]'s executive producer and costume designer",
    "questionPatternModEntities": "What was written by M0 's executive producer and costume designer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.080fgs6 .\n?x1 ns:film.producer.films_executive_produced ns:m.080fgs6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Conventioneers; Devil's Pond",
    "recursionDepth": 20
  },
  {
    "questionIdx": 181728,
    "questionWithBrackets": "What was produced by [Summer, Kyoto]'s Japanese cinematographer",
    "questionPatternModEntities": "What was produced by M1 's Japanese cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ns:m.011324gp .\n?x1 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Flame of Mountain; Night of Fish",
    "recursionDepth": 20
  },
  {
    "questionIdx": 18652,
    "questionWithBrackets": "Did [Sad Vacation]'s Japanese writer edit [Lakeside Murder Case]",
    "questionPatternModEntities": "Did M1 's Japanese writer edit M0",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0gksc5_ .\n?x0 ns:film.writer.film ns:m.04n6dkc .\n?x0 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 48715,
    "questionWithBrackets": "Was [Bryan Singer] [Grown Ups 2]'s prequel's star and executive producer",
    "questionPatternModEntities": "Was M1 M0 's prequel 's star and executive producer",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ns:m.0mzt5cs .\nns:m.07nznf ns:film.actor.film/ns:film.performance.film ?x0 .\nns:m.07nznf ns:film.producer.films_executive_produced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 45300,
    "questionWithBrackets": "Was [Amer Sports]'s child's Canadian founder [Charles Revson]",
    "questionPatternModEntities": "Was M0 's child 's Canadian founder M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0g8kf5 .\nns:m.08_n8r ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.08_n8r ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 150127,
    "questionWithBrackets": "What did a founder and employee of [Power Entertainment Media Ltd] produce",
    "questionPatternModEntities": "What did a founder and employee of M0 produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0z9c_jx .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0z9c_jx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Loves Music, Loves to Dance",
    "recursionDepth": 21
  },
  {
    "questionIdx": 62929,
    "questionWithBrackets": "Was [Kids + Money]'s female American writer [Lenore Coffee]",
    "questionPatternModEntities": "Was M1 's female American writer M0",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0kst41 ns:film.writer.film ns:m.06_w263 .\nns:m.0kst41 ns:people.person.gender ns:m.02zsn .\nns:m.0kst41 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M2 .\nM0 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 21
  },
  {
    "questionIdx": 221168,
    "questionWithBrackets": "Who married a French costume designer of [Lovers Like Us]",
    "questionPatternModEntities": "Who married a French costume designer of M1",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0274gp5 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Fran\u00e7ois Leterrier",
    "recursionDepth": 21
  }
]