[
  {
    "questionIdx": 1205,
    "questionWithBrackets": "Did [Amparo Fortuny] produce, direct, and executive produce a film that was edited by and produced by [Aron Gaudet]",
    "questionPatternModEntities": "Did M2 produce , direct , and executive produce a film that was edited by and produced by M1",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [NP_SIMPLE] that was [VP_SIMPLE] by and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ns:m.0bbvkq1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0bbvkq1 .\nns:m.01146zrh ns:film.director.film ?x0 .\nns:m.01146zrh ns:film.producer.films_executive_produced ?x0 .\nns:m.01146zrh ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 235537,
    "questionWithBrackets": "Who was influenced by [Bill Hicks] and [George Carlin], influenced by [Strangled Eggs]'s male star, and influenced by [Tetragrammaton Records]'s founder",
    "questionPatternModEntities": "Who was influenced by M1 and M2 , influenced by M4 's male star , and influenced by M3 's founder",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.014z8v .\n?x0 ns:influence.influence_node.influenced_by ns:m.01wp_jm .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.07d7_m .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.05q8md4 .\n?x2 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x2 P2 M4 .\n?x2 P3 M5\n}",
    "expectedResponse": "Dave Chappelle",
    "recursionDepth": 48
  },
  {
    "questionIdx": 9452,
    "questionWithBrackets": "Did [Harvey Weinstein] and [Bob Weinstein] found a film distributor, found a producer of [The Fighter] and [Django Unchained], and found [Weinstein Books]",
    "questionPatternModEntities": "Did M3 and M5 found a film distributor , found a producer of M0 and M1 , and found M4",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] , [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] and [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.047d21r .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0gwjw0c .\n?x1 a ns:film.film_distributor .\nns:m.05hj_k ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.05hj_k ns:organization.organization_founder.organizations_founded ?x1 .\nns:m.05hj_k ns:organization.organization_founder.organizations_founded ns:m.09tmcn7 .\nns:m.06q8hf ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.06q8hf ns:organization.organization_founder.organizations_founded ?x1 .\nns:m.06q8hf ns:organization.organization_founder.organizations_founded ns:m.09tmcn7\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 a M2 .\nM3 P1 ?x0 .\nM3 P1 ?x1 .\nM3 P1 M4 .\nM5 P1 ?x0 .\nM5 P1 ?x1 .\nM5 P1 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 150907,
    "questionWithBrackets": "What did a star and cinematographer of [Baby, I Love You.] direct, edit, executive produce, produce, and write",
    "questionPatternModEntities": "What did a star and cinematographer of M0 direct , edit , executive produce , produce , and write",
    "questionTemplate": "What did a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.011_z9lq .\n?x1 ns:film.cinematographer.film ns:m.011_z9lq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Baby, I Love You.; Planet Utero",
    "recursionDepth": 48
  },
  {
    "questionIdx": 85274,
    "questionWithBrackets": "Was [Viagem na Chuva] written by, executive produced by, directed by, produced by, and edited by [Kinefaktura]'s art director and director",
    "questionPatternModEntities": "Was M1 written by , executive produced by , directed by , produced by , and edited by M0 's art director and director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0vsh_8l .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0vsh_8l .\nns:m.011p1tds ns:film.film.directed_by ?x0 .\nns:m.011p1tds ns:film.film.edited_by ?x0 .\nns:m.011p1tds ns:film.film.executive_produced_by ?x0 .\nns:m.011p1tds ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.011p1tds ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 120295,
    "questionWithBrackets": "Were [Lituania Tilsit] and [Apple Corps] founded by [Ringo Starr], founded by [John Lennon] and [Paul McCartney], and founded by a British film producer",
    "questionPatternModEntities": "Were M2 and M6 founded by M3 , founded by M4 and M5 , and founded by a British film producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.nationality ns:m.07ssc .\nns:m.02_7z_ ns:organization.organization.founders ?x0 .\nns:m.02_7z_ ns:organization.organization.founders ns:m.01vrnsk .\nns:m.02_7z_ ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.02_7z_ ns:organization.organization.founders ns:m.03j24kf .\nns:m.0h1bnbh ns:organization.organization.founders ?x0 .\nns:m.0h1bnbh ns:organization.organization.founders ns:m.01vrnsk .\nns:m.0h1bnbh ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.0h1bnbh ns:organization.organization.founders ns:m.03j24kf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P1 M3 .\nM2 P1 M4 .\nM2 P1 M5 .\nM6 P1 ?x0 .\nM6 P1 M3 .\nM6 P1 M4 .\nM6 P1 M5\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 118654,
    "questionWithBrackets": "Were [It's Not About the Shawerma] and [Rick's Canoe] directed, executive produced, edited, written, and produced by [Dream a Little Dream]'s editor and producer",
    "questionPatternModEntities": "Were M1 and M2 directed , executive produced , edited , written , and produced by M0 's editor and producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.09bfrf .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09bfrf .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0 .\nns:m.0zztylq ns:film.film.directed_by ?x0 .\nns:m.0zztylq ns:film.film.edited_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zztylq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0 .\nM2 P6 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 103390,
    "questionWithBrackets": "Was a person that a cinematographer's spouse married, [Catherine Deneuve] married, and [Wes Anderson] was influenced by [Martin Scorsese]",
    "questionPatternModEntities": "Was a person that a cinematographer 's spouse married , M4 married , and M3 was influenced by M1",
    "questionTemplate": "Was a [NP_SIMPLE] that a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.cinematographer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.04sry != ?x0 ) .\nFILTER ( ns:m.04sry != ns:m.0cbkc ) .\nns:m.04sry a ns:people.person .\nns:m.04sry ns:influence.influence_node.influenced ns:m.02ld6x .\nns:m.04sry ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.04sry ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0cbkc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != M4 ) .\nM1 P0 ?x0 .\nM1 P0 M4 .\nM1 P1 M3 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 236231,
    "questionWithBrackets": "Who was influenced by [Hubert Selby, Jr.], influenced by [Tetsuo II: Body Hammer]'s executive producer, director, and cinematographer, and influenced by [New Jersey Drive]'s executive producer",
    "questionPatternModEntities": "Who was influenced by M1 , influenced by M3 's executive producer , director , and cinematographer , and influenced by M2 's executive producer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0nk02 .\n?x1 ns:film.producer.films_executive_produced ns:m.03d05ct .\n?x2 ns:film.cinematographer.film ns:m.0brs6b .\n?x2 ns:film.director.film ns:m.0brs6b .\n?x2 ns:film.producer.films_executive_produced ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x2 P1 M3 .\n?x2 P2 M3 .\n?x2 P3 M3\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 48
  },
  {
    "questionIdx": 51478,
    "questionWithBrackets": "Was [Daniel Jewel] employed by [Momentum Pictures], employed by a film distributor's child and parent, and employed by [Spooky Swabs]'s producer",
    "questionPatternModEntities": "Was M2 employed by M3 , employed by a film distributor 's child and parent , and employed by M1 's producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.film_distributor .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.04jl6d7 .\nns:m.03nn1cn ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.03nn1cn ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\nns:m.03nn1cn ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04ggdyk\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\n?x2 P2 M1 .\nM2 P3 ?x0 .\nM2 P3 ?x2 .\nM2 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 64838,
    "questionWithBrackets": "Was [Los Enchiladas!] produced, executive produced, and written by a film director influenced by [Bob Newhart] and influenced by [Jerry Seinfeld]",
    "questionPatternModEntities": "Was M3 produced , executive produced , and written by a film director influenced by M1 and influenced by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ns:m.012gq6 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0q5hw .\nns:m.0bsmhk ns:film.film.executive_produced_by ?x0 .\nns:m.0bsmhk ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bsmhk ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nM3 P1 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 71345,
    "questionWithBrackets": "Was [Peter Thiel] an American person that [National War Labor Board] was founded by, [War Industries Board] was founded by, and [Bryn Mawr College] employed",
    "questionPatternModEntities": "Was M0 a American person that M3 was founded by , M4 was founded by , and M2 employed",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by , [entity] was [VP_SIMPLE] by , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02w8m6 a ns:people.person .\nns:m.02w8m6 ns:organization.organization_founder.organizations_founded ns:m.02s63v .\nns:m.02w8m6 ns:organization.organization_founder.organizations_founded ns:m.051kqv .\nns:m.02w8m6 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01g7_r .\nns:m.02w8m6 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 P1 M4 .\nM0 P2 M5 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 54398,
    "questionWithBrackets": "Was [Everlasting Regret] executive produced by a spouse of [Xiaoman Lu], executive produced by [Zhong-lun Ren] and [Jinjun Hu], and edited by [Lan Yu]'s costume designer",
    "questionPatternModEntities": "Was M2 executive produced by a spouse of M0 , executive produced by M3 and M4 , and edited by M1 's costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0w_5n2r .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.024xxj .\nFILTER ( ?x0 != ns:m.0w_5n2r ) .\nns:m.083zww ns:film.film.edited_by ?x1 .\nns:m.083zww ns:film.film.executive_produced_by ?x0 .\nns:m.083zww ns:film.film.executive_produced_by ns:m.08mm9bj .\nns:m.083zww ns:film.film.executive_produced_by ns:m.0y_hdpp\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4 .\nM2 P3 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 125794,
    "questionWithBrackets": "Were [The Battle of Russia] and [Divide and Conquer] directed by [Salvatore Capra]'s Italian child, directed by a person, and written by [Anthony Veiller]",
    "questionPatternModEntities": "Were M3 and M5 directed by M1 's Italian child , directed by a person , and written by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0j54fcq .\n?x1 a ns:people.person .\nns:m.08z9ks ns:film.film.directed_by ?x0 .\nns:m.08z9ks ns:film.film.directed_by ?x1 .\nns:m.08z9ks ns:film.film.written_by ns:m.0k0vwc .\nns:m.0c7gcz ns:film.film.directed_by ?x0 .\nns:m.0c7gcz ns:film.film.directed_by ?x1 .\nns:m.0c7gcz ns:film.film.written_by ns:m.0k0vwc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 a M2 .\nM3 P2 M4 .\nM3 P3 ?x0 .\nM3 P3 ?x1 .\nM5 P2 M4 .\nM5 P3 ?x0 .\nM5 P3 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 175629,
    "questionWithBrackets": "What was edited, executive produced, produced, directed, and written by a star, writer, and executive producer of [Animator vs Animation 2]",
    "questionPatternModEntities": "What was edited , executive produced , produced , directed , and written by a star , writer , and executive producer of M0",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0108mkjq .\n?x1 ns:film.producer.films_executive_produced ns:m.0108mkjq .\n?x1 ns:film.writer.film ns:m.0108mkjq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0 .\n?x1 P7 M0\n}",
    "expectedResponse": "Animator vs Animation 2; Animation vs. Animator 1",
    "recursionDepth": 49
  },
  {
    "questionIdx": 112635,
    "questionWithBrackets": "Were [Apple Records] and [Apple Corps] founded by [George Harrison] and [Ringo Starr], founded by [Duet for Four]'s executive producer and star, and founded by [John Lennon]",
    "questionPatternModEntities": "Were M1 and M5 founded by M2 and M3 , founded by M0 's executive producer and star , and founded by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0n5wknw .\n?x0 ns:film.producer.films_executive_produced ns:m.0n5wknw .\nns:m.019n_t ns:organization.organization.founders ?x0 .\nns:m.019n_t ns:organization.organization.founders ns:m.01vrnsk .\nns:m.019n_t ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.019n_t ns:organization.organization.founders ns:m.03bnv .\nns:m.02_7z_ ns:organization.organization.founders ?x0 .\nns:m.02_7z_ ns:organization.organization.founders ns:m.01vrnsk .\nns:m.02_7z_ ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.02_7z_ ns:organization.organization.founders ns:m.03bnv\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM1 P2 M4 .\nM5 P2 ?x0 .\nM5 P2 M2 .\nM5 P2 M3 .\nM5 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 49
  },
  {
    "questionIdx": 176876,
    "questionWithBrackets": "What was executive produced by [Mariano Vanhoof], directed by a Swedish film editor that wrote [Here is Your Life], and edited by [Alari Hainla]",
    "questionPatternModEntities": "What was executive produced by M0 , directed by a Swedish film editor that wrote M3 , and edited by M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0w_h3m_ .\n?x0 ns:film.film.executive_produced_by ns:m.0jmw6f0 .\n?x1 a ns:film.editor .\n?x1 ns:film.writer.film ns:m.04svlgc .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x1 P3 M3 .\n?x1 P4 M4 .\n?x1 a M2\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 49
  },
  {
    "questionIdx": 51953,
    "questionWithBrackets": "Was [Dead Man Walking] produced by [Guido de Laurentiis], produced by [V\u00e9ra Belmont] and [Leo Pescarolo], and edited by [Prince Leo]'s actor's male sibling",
    "questionPatternModEntities": "Was M2 produced by M3 , produced by M4 and M5 , and edited by M1 's actor 's male sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0_mt2zh .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0gjk1d ns:film.film.edited_by ?x0 .\nns:m.0gjk1d ns:film.film.produced_by|ns:film.film.production_companies ns:m.0bnnv79 .\nns:m.0gjk1d ns:film.film.produced_by|ns:film.film.production_companies ns:m.0bnnv7d .\nns:m.0gjk1d ns:film.film.produced_by|ns:film.film.production_companies ns:m.0g9tyfw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 M3 .\nM2 P3 M4 .\nM2 P3 M5 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 49
  },
  {
    "questionIdx": 121530,
    "questionWithBrackets": "Were [My Boss' Daughter] and [Music of the Heart] executive produced by [Soul Men]'s executive producer, edited by a film producer, and executive produced by [Miramax]'s employee",
    "questionPatternModEntities": "Were M3 and M4 executive produced by M0 's executive producer , edited by a film producer , and executive produced by M1 's employee",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.03nxfs5 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0jz9f .\n?x2 a ns:film.producer .\nns:m.032zcf ns:film.film.edited_by ?x2 .\nns:m.032zcf ns:film.film.executive_produced_by ?x0 .\nns:m.032zcf ns:film.film.executive_produced_by ?x1 .\nns:m.0d2l2_ ns:film.film.edited_by ?x2 .\nns:m.0d2l2_ ns:film.film.executive_produced_by ?x0 .\nns:m.0d2l2_ ns:film.film.executive_produced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x2 a M2 .\nM3 P2 ?x0 .\nM3 P2 ?x1 .\nM3 P3 ?x2 .\nM4 P2 ?x0 .\nM4 P2 ?x1 .\nM4 P3 ?x2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 184112,
    "questionWithBrackets": "What was written by [Carl Reiner], written by a screenwriter, and produced by a film distributor whose employee edited [The Goonies]",
    "questionPatternModEntities": "What was written by M0 , written by a screenwriter , and produced by a film distributor whose employee edited M3",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x0 ns:film.film.written_by ns:m.0pnf3 .\n?x1 a ns:film.film_distributor .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x3 .\n?x2 a ns:film.writer .\n?x3 ns:film.editor.film ns:m.0mbql\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 a M1 .\n?x2 P2 ?x3 .\n?x2 a M2 .\n?x3 P3 M3\n}",
    "expectedResponse": "The Thrill of It All",
    "recursionDepth": 49
  },
  {
    "questionIdx": 57631,
    "questionWithBrackets": "Was [H. Jon Benjamin] influenced by [Michael Gough], influenced by [Norbit]'s star, producer, and writer, and influenced by [Christopher Lee] and [David Letterman]",
    "questionPatternModEntities": "Was M1 influenced by M2 , influenced by M0 's star , producer , and writer , and influenced by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0kv2hv .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0kv2hv .\n?x0 ns:film.writer.film ns:m.0kv2hv .\nns:m.05rx__ ns:influence.influence_node.influenced_by ?x0 .\nns:m.05rx__ ns:influence.influence_node.influenced_by ns:m.029_3 .\nns:m.05rx__ ns:influence.influence_node.influenced_by ns:m.02_p8v .\nns:m.05rx__ ns:influence.influence_node.influenced_by ns:m.0f0kz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P3 M2 .\nM1 P3 M3 .\nM1 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 49
  },
  {
    "questionIdx": 129750,
    "questionWithBrackets": "Were [White Stork Is Coming] and [Rick's Canoe] directed by, edited by, written by, produced by, and executive produced by an editor of [Someone Like Me]",
    "questionPatternModEntities": "Were M1 and M2 directed by , edited by , written by , produced by , and executive produced by a editor of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0zgtvfg .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0 .\nns:m.0zxyz5j ns:film.film.directed_by ?x0 .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.executive_produced_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zxyz5j ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 175010,
    "questionWithBrackets": "What was edited by, directed by, produced by, executive produced by, and written by a writer and producer of [Night of Fish]",
    "questionPatternModEntities": "What was edited by , directed by , produced by , executive produced by , and written by a writer and producer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0yqxqzm .\n?x1 ns:film.writer.film ns:m.0yqxqzm\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Flame of Mountain",
    "recursionDepth": 49
  },
  {
    "questionIdx": 9143,
    "questionWithBrackets": "Did [Hank Williams], [Roy Orbison], [The Shadows], [The Beatles], and [Jimmy Reed] influence a film director that [CSNY/D\u00e9j\u00e0 Vu] was written by and [Made in Heaven] starred",
    "questionPatternModEntities": "Did M3 , M4 , M5 , M6 , and M7 influence a film director that M1 was written by and M2 starred",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.02q7sv0 .\n?x0 ns:film.writer.film ns:m.03m3zmd .\nns:m.015phm ns:influence.influence_node.influenced ?x0 .\nns:m.015qh4 ns:influence.influence_node.influenced ?x0 .\nns:m.05_ncl ns:influence.influence_node.influenced ?x0 .\nns:m.06m61 ns:influence.influence_node.influenced ?x0 .\nns:m.07c0j ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0 .\nM6 P2 ?x0 .\nM7 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 238794,
    "questionWithBrackets": "Who was influenced by an actor, was influenced by a French film director, and influenced [Patti Smith] and [Peter Lamborn Wilson]",
    "questionPatternModEntities": "Who was influenced by a actor , was influenced by a French film director , and influenced M1 and M2",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] , was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.0188lg .\n?x0 ns:influence.influence_node.influenced ns:m.05qw5 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 a ns:film.actor .\n?x2 a ns:film.director .\n?x2 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M3 .\n?x2 P2 M5 .\n?x2 a M4\n}",
    "expectedResponse": "Allen Ginsberg",
    "recursionDepth": 49
  }
]