[
  {
    "questionIdx": 63657,
    "questionWithBrackets": "Was [Land and Houses] founded by [Roy O. Disney] and founded by a film producer's founder and employee",
    "questionPatternModEntities": "Was M1 founded by M2 and founded by a film producer 's founder and employee",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.producer .\nns:m.0675n6 ns:organization.organization.founders ?x0 .\nns:m.0675n6 ns:organization.organization.founders ns:m.015yg9\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 45705,
    "questionWithBrackets": "Was [Andy Mills] a screenwriter whose parent founded and was employed by a company",
    "questionPatternModEntities": "Was M1 a screenwriter whose parent founded and was employed by a company",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:business.employer .\nns:m.0rz7wsg a ns:film.writer .\nns:m.0rz7wsg ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 145993,
    "questionWithBrackets": "What did [Randy Mermell] produce and a Canadian spouse of an art director edit",
    "questionPatternModEntities": "What did M0 produce and a Canadian spouse of a art director edit",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0pcqpcr .\n?x1 ns:people.person.nationality ns:m.0d060g .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:film.film_art_director .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 ?x2 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Blood Gnome",
    "recursionDepth": 35
  },
  {
    "questionIdx": 220093,
    "questionWithBrackets": "Who married [Darya Greenwood]'s female actor and was influenced by a costume designer",
    "questionPatternModEntities": "Who married M2 's female actor and was influenced by a costume designer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 a ns:film.film_costumer_designer .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0gz5m0j .\n?x2 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 P2 M2 .\n?x2 P3 M3 .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "Martin Scorsese",
    "recursionDepth": 35
  },
  {
    "questionIdx": 205675,
    "questionWithBrackets": "Which film written by [Chris Columbus] was executive produced and edited by [An American Tail]'s executive producer",
    "questionPatternModEntities": "Which film written by M1 was executive produced and edited by M2 's executive producer",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] by [entity] was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ns:m.01r2c7 .\n?x1 ns:film.producer.films_executive_produced ns:m.03vp54\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M2\n}",
    "expectedResponse": "The Goonies",
    "recursionDepth": 35
  },
  {
    "questionIdx": 179129,
    "questionWithBrackets": "What was executive produced, produced, and directed by an Italian actor of [Sergio Ghia]",
    "questionPatternModEntities": "What was executive produced , produced , and directed by a Italian actor of M1",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.04mmxbp .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "Screw Loose",
    "recursionDepth": 35
  },
  {
    "questionIdx": 4426,
    "questionWithBrackets": "Did [Columbia University] and [University of Minnesota] employ a person that [Rose Friedman] married and influenced",
    "questionPatternModEntities": "Did M2 and M3 employ a person that M1 married and influenced",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.06g0rk .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.06g0rk .\nFILTER ( ?x0 != ns:m.06g0rk ) .\nns:m.01w5m ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.025v3k ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 124067,
    "questionWithBrackets": "Were [Samad dar rah ejdeha] and [Ferestadeh] edited by and executive produced by a male spouse of [Parvin Sayyad]",
    "questionPatternModEntities": "Were M2 and M3 edited by and executive produced by a male spouse of M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0n4cykj .\nFILTER ( ?x0 != ns:m.0n4cykj ) .\nns:g.121_c37n ns:film.film.edited_by ?x0 .\nns:g.121_c37n ns:film.film.executive_produced_by ?x0 .\nns:m.0b3rv5d ns:film.film.edited_by ?x0 .\nns:m.0b3rv5d ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 85234,
    "questionWithBrackets": "Was [Viagem na Chuva] executive produced by and produced by a cinematographer, art director, and editor of [Far West: A True Western]",
    "questionPatternModEntities": "Was M1 executive produced by and produced by a cinematographer , art director , and editor of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0107hywx .\n?x0 ns:film.editor.film ns:m.0107hywx .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0107hywx .\nns:m.011p1tds ns:film.film.executive_produced_by ?x0 .\nns:m.011p1tds ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 159423,
    "questionWithBrackets": "What film whose executive producer wrote [Claudine's Return] was directed by [Odysseus' Gambit]'s executive producer and cinematographer",
    "questionPatternModEntities": "What film whose executive producer wrote M1 was directed by M2 's executive producer and cinematographer",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x1 ns:film.cinematographer.film ns:m.0j8f5vp .\n?x1 ns:film.producer.films_executive_produced ns:m.0j8f5vp .\n?x2 ns:film.writer.film ns:m.0b1q_4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x2 P3 M2 .\n?x2 P4 M2\n}",
    "expectedResponse": "Godka Cirka",
    "recursionDepth": 36
  },
  {
    "questionIdx": 201597,
    "questionWithBrackets": "Which film director influenced, was influenced by, and married a film's producer",
    "questionPatternModEntities": "Which film director influenced , was influenced by , and married a film 's producer",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 ?x2 .\n?x2 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy; Agn\u00e8s Varda",
    "recursionDepth": 36
  },
  {
    "questionIdx": 70098,
    "questionWithBrackets": "Was [One Man's Hero] produced, written, and edited by a production company's employee and founder",
    "questionPatternModEntities": "Was M1 produced , written , and edited by a production company 's employee and founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.production_company .\nns:m.07wsr5 ns:film.film.edited_by ?x0 .\nns:m.07wsr5 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.07wsr5 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 114795,
    "questionWithBrackets": "Were [Chicago Joe and the Showgirl] and [Taking Woodstock] produced by and distributed by a film distributor's child and parent",
    "questionPatternModEntities": "Were M1 and M2 produced by and distributed by a film distributor 's child and parent",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.film_distributor .\nns:m.0404hcg ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0404hcg ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.04grkmd ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.04grkmd ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 176322,
    "questionWithBrackets": "What was executive produced by [Clea De Koning] and [Bert Nijdam] and produced by [Jurriaan Oerlemans]'s Dutch sibling",
    "questionPatternModEntities": "What was executive produced by M0 and M1 and produced by M2 's Dutch sibling",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:g.11b6lkrv_z .\n?x0 ns:film.film.executive_produced_by ns:m.0jc8ls1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.nationality ns:m.059j2 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0109_p23 .\nFILTER ( ?x1 != ns:m.0109_p23 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M3 .\nFILTER ( ?x1 != M2 )\n}",
    "expectedResponse": "The Happy Housewife; Duska",
    "recursionDepth": 36
  },
  {
    "questionIdx": 173388,
    "questionWithBrackets": "What was edited by [Guastafeste]'s Italian actor and executive produced by [Pino Gargiulo] and [Massimo Ferrero]",
    "questionPatternModEntities": "What was edited by M3 's Italian actor and executive produced by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0wxt_lq .\n?x0 ns:film.film.executive_produced_by ns:m.0wxt_q1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0yblpzk .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Cheeky!",
    "recursionDepth": 36
  },
  {
    "questionIdx": 52138,
    "questionWithBrackets": "Was [Deepa Mehta] a film director that [Heaven on Earth] was executive produced by, directed by, and written by",
    "questionPatternModEntities": "Was M0 a film director that M1 was executive produced by , directed by , and written by",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.04jw71 ns:film.director.film ns:m.03c84gv .\nns:m.04jw71 ns:film.producer.films_executive_produced ns:m.03c84gv .\nns:m.04jw71 ns:film.writer.film ns:m.03c84gv\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 111228,
    "questionWithBrackets": "Were [21st Century Male] and [Year of the Nail] produced and edited by a child of a film editor's sibling",
    "questionPatternModEntities": "Were M1 and M2 produced and edited by a child of a film editor 's sibling",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.editor .\nFILTER ( ?x1 != ?x2 ) .\nns:m.02x9zks ns:film.film.edited_by ?x0 .\nns:m.02x9zks ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.04mwc27 ns:film.film.edited_by ?x0 .\nns:m.04mwc27 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 ) .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 143582,
    "questionWithBrackets": "What did [Gianni Amico] and [Glauber Rocha] write and a film's cinematographer's sibling edit",
    "questionPatternModEntities": "What did M0 and M1 write and a film 's cinematographer 's sibling edit",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ns:m.02_p09 .\n?x0 ns:film.film.written_by ns:m.0c04nl4 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.cinematographer.film ?x3 .\n?x3 a ns:film.film .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "The Lion Has Seven Heads",
    "recursionDepth": 36
  },
  {
    "questionIdx": 229329,
    "questionWithBrackets": "Who was a costume designer that was employed by [Weta Workshop] and [Wingnut Interactive] and founded [Weta Digital]",
    "questionPatternModEntities": "Who was a costume designer that was employed by M2 and M3 and founded M4",
    "questionTemplate": "Who was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01cm3c .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01cm64 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0kqh8s\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Peter Jackson",
    "recursionDepth": 36
  },
  {
    "questionIdx": 50472,
    "questionWithBrackets": "Was [Cin\u00e9vardaphoto] directed by and edited by a person's male sibling's spouse",
    "questionPatternModEntities": "Was M2 directed by and edited by a person 's male sibling 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nns:m.0bf1dvb ns:film.film.directed_by ?x0 .\nns:m.0bf1dvb ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 M0 .\n?x2 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 43282,
    "questionWithBrackets": "Was [24: The Movie] produced and executive produced by an actor that played [Ejlert Lovborg] and [Curtis Freley]",
    "questionPatternModEntities": "Was M2 produced and executive produced by a actor that played M0 and M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.02gd6jx .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0gyk1p9 .\nns:m.052k0yp ns:film.film.executive_produced_by ?x0 .\nns:m.052k0yp ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 53476,
    "questionWithBrackets": "Was [Ed and His Dead Mother] distributed by and produced by a child of a distributor of [Niagara Fools]'s prequel",
    "questionPatternModEntities": "Was M1 distributed by and produced by a child of a distributor of M0 's prequel",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ?x2 .\n?x2 ns:film.film.sequel ns:m.05229gd .\nns:m.04j2ms9 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.04j2ms9 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 169843,
    "questionWithBrackets": "What was directed by [Favela Rising]'s editor, cinematographer, and producer and executive produced by [Bill Simmons]",
    "questionPatternModEntities": "What was directed by M1 's editor , cinematographer , and producer and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.053sdy .\n?x1 ns:film.cinematographer.film ns:m.0fbdkq .\n?x1 ns:film.editor.film ns:m.0fbdkq .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0fbdkq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 P4 M1\n}",
    "expectedResponse": "The Two Escobars",
    "recursionDepth": 36
  },
  {
    "questionIdx": 147581,
    "questionWithBrackets": "What did [Tiwa Moeithaisong] write and a costume designer and writer of [Oh My Ghosts!]'s prequel produce",
    "questionPatternModEntities": "What did M0 write and a costume designer and writer of M1 's prequel produce",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ns:m.0g7xdbn .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x1 ns:film.writer.film ?x2 .\n?x2 ns:film.film.sequel ns:m.0vx3vtg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 P4 M1\n}",
    "expectedResponse": "Meat Grinder",
    "recursionDepth": 36
  },
  {
    "questionIdx": 168998,
    "questionWithBrackets": "What was acquired by [Quadrangle Group] and [APriori Capital Partners] and acquired by an employer of [John H. Ridall] and [Suzanne L.  Keenan]",
    "questionPatternModEntities": "What was acquired by M0 and M1 and acquired by a employer of M2 and M3",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02qb2mr .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02vmhkn .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04h_htt .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04h_hvv\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P1 M2 .\n?x1 P1 M3\n}",
    "expectedResponse": "Metro-Goldwyn-Mayer",
    "recursionDepth": 36
  },
  {
    "questionIdx": 150338,
    "questionWithBrackets": "What did a parent of [Morgan Creek Productions]'s founder's spouse executive produce and [Eve Newman] edit",
    "questionPatternModEntities": "What did a parent of M1 's founder 's spouse executive produce and M0 edit",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0k1q82 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x3 ns:organization.organization_founder.organizations_founded ns:m.031rp3 .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 P4 M1 .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "The Big T.N.T. Show",
    "recursionDepth": 36
  },
  {
    "questionIdx": 173563,
    "questionWithBrackets": "What was edited by [Lucasfilm]'s founder and employee and executive produced by [Talia Shire]'s sibling",
    "questionPatternModEntities": "What was edited by M1 's founder and employee and executive produced by M0 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0kx4m .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0kx4m .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.01gw4f .\nFILTER ( ?x2 != ns:m.01gw4f )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M0 .\n?x2 P3 M1 .\n?x2 P4 M1 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "THX 1138",
    "recursionDepth": 36
  },
  {
    "questionIdx": 54502,
    "questionWithBrackets": "Was [F for Fake] edited by [Fist Of Jesus]'s producer and costume designer and edited by [Adri\u00e1n Cardona] and [Rafa Dengr\u00e1]",
    "questionPatternModEntities": "Was M1 edited by M0 's producer and costume designer and edited by M2 and M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.010s0v9j .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.010s0v9j .\nns:m.055l31 ns:film.film.edited_by ?x0 .\nns:m.055l31 ns:film.film.edited_by ns:m.0hpfc9j .\nns:m.055l31 ns:film.film.edited_by ns:m.0hpfc9m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 51622,
    "questionWithBrackets": "Was [Darren Aronofsky] influenced by [Spike Lee] and influenced by [Tetsuo: The Iron Man]'s art director, star, and cinematographer",
    "questionPatternModEntities": "Was M1 influenced by M2 and influenced by M0 's art director , star , and cinematographer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.05m0x0 .\n?x0 ns:film.cinematographer.film ns:m.05m0x0 .\n?x0 ns:film.film_art_director.films_art_directed ns:m.05m0x0 .\nns:m.017c87 ns:influence.influence_node.influenced_by ?x0 .\nns:m.017c87 ns:influence.influence_node.influenced_by ns:m.06pjs\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 238173,
    "questionWithBrackets": "Who was influenced by a female director of [Rabbit Test] and was influenced by [Lenny Clarke]",
    "questionPatternModEntities": "Who was influenced by a female director of M3 and was influenced by M1",
    "questionTemplate": "Who was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01l7f1 .\n?x1 ns:film.director.film ns:m.0400ts .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M3\n}",
    "expectedResponse": "Louis C.K.",
    "recursionDepth": 36
  }
]