[
  {
    "questionIdx": 194649,
    "questionWithBrackets": "Which character did [Hangman Books]'s founder influence",
    "questionPatternModEntities": "Which character did M1 's founder influence",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.07qm53\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Kurt Cobain",
    "recursionDepth": 17
  },
  {
    "questionIdx": 161723,
    "questionWithBrackets": "What person founded [Nancy C. Everett]'s employer",
    "questionPatternModEntities": "What person founded M1 's employer",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.047hpc8\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "William C. Durant; Charles Stewart Mott",
    "recursionDepth": 17
  },
  {
    "questionIdx": 61486,
    "questionWithBrackets": "Was [Jim Hanks] a sibling of [Riverside Shakespeare Company]'s founder",
    "questionPatternModEntities": "Was M1 a sibling of M0 's founder",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03cyb77 .\nFILTER ( ns:m.085cw4 != ?x0 ) .\nns:m.085cw4 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 17
  },
  {
    "questionIdx": 156608,
    "questionWithBrackets": "What film editor influenced [Eraserhead]'s art director",
    "questionPatternModEntities": "What film editor influenced M1 's art director",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.027jhb\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Maya Deren; Jack Smith",
    "recursionDepth": 17
  },
  {
    "questionIdx": 61674,
    "questionWithBrackets": "Was [John C Y. Wang]'s employer an employer of [Saul Bellow]",
    "questionPatternModEntities": "Was M0 's employer a employer of M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.073v6 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0fp96fq\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 17
  },
  {
    "questionIdx": 194627,
    "questionWithBrackets": "Which character did [A Trip to the Moon]'s costume designer marry",
    "questionPatternModEntities": "Which character did M1 's costume designer marry",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.02ltdy .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 17
  },
  {
    "questionIdx": 52105,
    "questionWithBrackets": "Was [Debra M. Satz] an employee of [Concordia University] and [Pavillon Foster]",
    "questionPatternModEntities": "Was M0 a employee of M1 and M2",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0dm5wln ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0bsnm .\nns:m.0dm5wln ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0l1634l\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P0 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 17
  },
  {
    "questionIdx": 202668,
    "questionWithBrackets": "Which film editor did [The Heart of Humanity]'s distributor employ",
    "questionPatternModEntities": "Which film editor did M1 's distributor employ",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0dgstx9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Steven Spielberg",
    "recursionDepth": 17
  },
  {
    "questionIdx": 65868,
    "questionWithBrackets": "Was [Male] a gender of [Initiate Systems]'s employee",
    "questionPatternModEntities": "Was M1 a gender of M0 's employee",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.030r0jf .\nns:m.05zppz ^ns:people.person.gender ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 17
  },
  {
    "questionIdx": 137364,
    "questionWithBrackets": "What art director married [Modest Reception]'s cinematographer",
    "questionPatternModEntities": "What art director married M1 's cinematographer",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0j5ychb .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Hedieh Tehr\u0101ni",
    "recursionDepth": 17
  },
  {
    "questionIdx": 201376,
    "questionWithBrackets": "Which film director did [De Tripas, Corazon]'s art director marry",
    "questionPatternModEntities": "Which film director did M1 's art director marry",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0pdv356 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Juan Carlos Rulfo",
    "recursionDepth": 17
  },
  {
    "questionIdx": 31303,
    "questionWithBrackets": "Did a costume designer marry [Alignment]'s employee",
    "questionPatternModEntities": "Did a costume designer marry M1 's employee",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02pjmt2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 90757,
    "questionWithBrackets": "Was a Mexican writer of [Duck Season] [Luis Alcoriza]",
    "questionPatternModEntities": "Was a Mexican writer of M1 M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.09_hzr ns:film.writer.film ns:m.08nv9m .\nns:m.09_hzr ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 18661,
    "questionWithBrackets": "Did [Sahara Hare] star an actor's actor",
    "questionPatternModEntities": "Did M1 star a actor 's actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 a ns:film.actor .\nns:m.0272ctm ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 98560,
    "questionWithBrackets": "Was a film editor's parent's spouse [Andr\u00e9s Carrasco]",
    "questionPatternModEntities": "Was a film editor 's parent 's spouse M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.editor .\nFILTER ( ns:m.010pj4w5 != ?x0 ) .\nns:m.010pj4w5 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 159225,
    "questionWithBrackets": "What film was written by [Pixote]'s costume designer",
    "questionPatternModEntities": "What film was written by M1 's costume designer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.05vb8g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Cafund\u00f3",
    "recursionDepth": 18
  },
  {
    "questionIdx": 47971,
    "questionWithBrackets": "Was [Bj\u00f6rk: Greatest Hits] directed by a costume designer of [Immortals]",
    "questionPatternModEntities": "Was M1 directed by a costume designer of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.076tw54 .\nns:m.0crx046 ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 38950,
    "questionWithBrackets": "Did a screenwriter edit [Oedipus Orca]'s prequel",
    "questionPatternModEntities": "Did a screenwriter edit M1 's prequel",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.editor.film ?x1 .\n?x1 ns:film.film.sequel ns:m.0j3d7jf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 30153,
    "questionWithBrackets": "Did a cinematographer marry [Mike Seeger]'s sibling",
    "questionPatternModEntities": "Did a cinematographer marry M1 's sibling",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.063zcx .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.063zcx )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 29950,
    "questionWithBrackets": "Did a cinematographer edit [Moan and Groan, Inc.] and [Bromo and Juliet]",
    "questionPatternModEntities": "Did a cinematographer edit M1 and M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.editor.film ns:m.02z94pg .\n?x0 ns:film.editor.film ns:m.04mytcc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 103718,
    "questionWithBrackets": "Was a person's sibling [Laurent Cazalon]'s sibling",
    "questionPatternModEntities": "Was a person 's sibling M0 's sibling",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0h1f246 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0h1f246 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 5859,
    "questionWithBrackets": "Did [Divide and Conquer] and [Adventures of Don Juan] star an actor",
    "questionPatternModEntities": "Did M1 and M2 star a actor",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nns:m.0282gtd ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0c7gcz ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM2 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 38131,
    "questionWithBrackets": "Did a person's employer employ [Pierre Capretz]",
    "questionPatternModEntities": "Did a person 's employer employ M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.05vj6z .\n?x1 a ns:people.person\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 73631,
    "questionWithBrackets": "Was [Regine B\u00e4tz] a German costume designer of [Ach du lieber Harry]",
    "questionPatternModEntities": "Was M0 a German costume designer of M1",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0byp8rd ns:film.film_costumer_designer.costume_design_for_film ns:m.0hn9937 .\nns:m.0byp8rd ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 16894,
    "questionWithBrackets": "Did [Photo-Romance]'s director edit a film",
    "questionPatternModEntities": "Did M0 's director edit a film",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0n4qjr1 .\n?x0 ns:film.editor.film ?x1 .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 16266,
    "questionWithBrackets": "Did [Our Stories Films] employ an actor's spouse",
    "questionPatternModEntities": "Did M1 employ a actor 's spouse",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.actor .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02r2ks4 ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 192348,
    "questionWithBrackets": "Which Swedish film director produced [Light Keeps Me Company]",
    "questionPatternModEntities": "Which Swedish film director produced M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.02sdhn7 .\n?x0 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Carl-Gustav Nykvist",
    "recursionDepth": 18
  },
  {
    "questionIdx": 190611,
    "questionWithBrackets": "Which Italian screenwriter edited [3 Supermen Against Godfather]",
    "questionPatternModEntities": "Which Italian screenwriter edited M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.editor.film ns:m.03cpgx1 .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Italo Martinenghi",
    "recursionDepth": 18
  },
  {
    "questionIdx": 141722,
    "questionWithBrackets": "What did [Aamir Khan Productions]'s employee's spouse direct",
    "questionPatternModEntities": "What did M0 's employee 's spouse direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03h4rzr .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Mumbai Diaries",
    "recursionDepth": 18
  },
  {
    "questionIdx": 190831,
    "questionWithBrackets": "Which Japanese cinematographer directed [Shinjuku Outlaw]",
    "questionPatternModEntities": "Which Japanese cinematographer directed M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.director.film ns:m.0285l7x .\n?x0 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Takashi Miike",
    "recursionDepth": 18
  },
  {
    "questionIdx": 189171,
    "questionWithBrackets": "Which Dutch film producer founded [Stage Holding]",
    "questionPatternModEntities": "Which Dutch film producer founded M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0kcpwrh .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Joop van den Ende",
    "recursionDepth": 18
  },
  {
    "questionIdx": 135932,
    "questionWithBrackets": "What Swedish screenwriter founded [Tre Vanner Produktion AB]",
    "questionPatternModEntities": "What Swedish screenwriter founded M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0f12tqy .\n?x0 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Michael Hjorth",
    "recursionDepth": 18
  },
  {
    "questionIdx": 192483,
    "questionWithBrackets": "Which Swedish screenwriter married [Ulla \u00c5berg]",
    "questionPatternModEntities": "Which Swedish screenwriter married M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.nationality ns:m.0d0vqn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0n6673q .\nFILTER ( ?x0 != ns:m.0n6673q )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Erland Josephson",
    "recursionDepth": 18
  },
  {
    "questionIdx": 191747,
    "questionWithBrackets": "Which Spanish actor wrote [Horror Rises from the Tomb]",
    "questionPatternModEntities": "Which Spanish actor wrote M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.writer.film ns:m.04gmms3 .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Paul Naschy",
    "recursionDepth": 18
  },
  {
    "questionIdx": 18653,
    "questionWithBrackets": "Did [Sadat]'s star found a company",
    "questionPatternModEntities": "Did M0 's star found a company",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.05zvmg0 .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 a ns:business.employer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 191941,
    "questionWithBrackets": "Which Spanish film editor edited [Ana and the Wolves]",
    "questionPatternModEntities": "Which Spanish film editor edited M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.editor.film ns:m.02wx4vb .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Pablo Gonz\u00e1lez del Amo",
    "recursionDepth": 18
  },
  {
    "questionIdx": 106957,
    "questionWithBrackets": "Was a writer and cinematographer of [The Fire Island Kids] [Mike Kuchar]",
    "questionPatternModEntities": "Was a writer and cinematographer of M1 M0",
    "questionTemplate": "Was a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.05p4fcd ns:film.cinematographer.film ns:m.0jmqczv .\nns:m.05p4fcd ns:film.writer.film ns:m.0jmqczv\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 219529,
    "questionWithBrackets": "Who influenced an Italian art director",
    "questionPatternModEntities": "Who influenced a Italian art director",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 a ns:film.film_art_director .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 a M1\n}",
    "expectedResponse": "Anthony Burgess",
    "recursionDepth": 18
  },
  {
    "questionIdx": 204298,
    "questionWithBrackets": "Which film producer was acquired by a company",
    "questionPatternModEntities": "Which film producer was acquired by a company",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x1 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 a M1\n}",
    "expectedResponse": "Vivendi; Good Machine",
    "recursionDepth": 18
  },
  {
    "questionIdx": 93155,
    "questionWithBrackets": "Was a cinematographer's parent [Alberto Paderni]'s parent",
    "questionPatternModEntities": "Was a cinematographer 's parent M0 's parent",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.011nwc8m .\n?x1 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 157564,
    "questionWithBrackets": "What film producer executive produced [Fast Five]'s prequel",
    "questionPatternModEntities": "What film producer executive produced M1 's prequel",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x1 ns:film.film.sequel ns:m.0bq6ntw\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Samantha Vincent; Amanda Lewis",
    "recursionDepth": 18
  },
  {
    "questionIdx": 190298,
    "questionWithBrackets": "Which Italian cinematographer did [Story of a Peculiar Night] star",
    "questionPatternModEntities": "Which Italian cinematographer did M2 star",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0_h8n_h .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Michelangelo Antonioni",
    "recursionDepth": 18
  },
  {
    "questionIdx": 42143,
    "questionWithBrackets": "Did an art director's sibling produce [Ghutan]",
    "questionPatternModEntities": "Did a art director 's sibling produce M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.04j0ftm .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 1710,
    "questionWithBrackets": "Did [Arlette Langmann]'s sibling marry a costume designer",
    "questionPatternModEntities": "Did M0 's sibling marry a costume designer",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.02pjs7 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.02pjs7 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 34062,
    "questionWithBrackets": "Did a film editor marry [Nadia Sibirska\u00efa] and [Virginia Lovisone]",
    "questionPatternModEntities": "Did a film editor marry M1 and M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:g.122n5yrq .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j_pzpl .\nFILTER ( ?x0 != ns:g.122n5yrq ) .\nFILTER ( ?x0 != ns:m.0j_pzpl )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  }
]