[
  {
    "questionIdx": 30763,
    "questionWithBrackets": "Did a company employ [Lost Islands]'s cinematographer and employ an actor",
    "questionPatternModEntities": "Did a company employ M1 's cinematographer and employ a actor",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:business.employer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x1 ns:film.cinematographer.film ns:m.07n98j4 .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x2 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 175932,
    "questionWithBrackets": "What was executive produced and produced by [La chair de ma chair]'s male cinematographer's sibling",
    "questionPatternModEntities": "What was executive produced and produced by M1 's male cinematographer 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.cinematographer.film ns:m.0_d1tp2 .\n?x2 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M0 .\n?x2 P4 M1 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "The Summer of Flying Fish",
    "recursionDepth": 32
  },
  {
    "questionIdx": 164260,
    "questionWithBrackets": "What screenwriter married, influenced, and was influenced by a film editor",
    "questionPatternModEntities": "What screenwriter married , influenced , and was influenced by a film editor",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.editor .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 32
  },
  {
    "questionIdx": 90810,
    "questionWithBrackets": "Was a Spanish actor that edited and wrote [The Soul of Flies] [Juan Jos\u00e9 Campanella]",
    "questionPatternModEntities": "Was a Spanish actor that edited and wrote M2 M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] and [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02774r6 a ns:film.actor .\nns:m.02774r6 ns:film.editor.film ns:m.0jsdcyp .\nns:m.02774r6 ns:film.writer.film ns:m.0jsdcyp .\nns:m.02774r6 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M2 .\nM0 P2 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 157045,
    "questionWithBrackets": "What film editor was an Italian male person that [Ultimo metr\u00f2] starred",
    "questionPatternModEntities": "What film editor was a Italian male person that M3 starred",
    "questionTemplate": "What [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0yblpzc .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Tinto Brass",
    "recursionDepth": 32
  },
  {
    "questionIdx": 2512,
    "questionWithBrackets": "Did [Bill Cosby] influence an actor and influence a film editor's parent",
    "questionPatternModEntities": "Did M2 influence a actor and influence a film editor 's parent",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.editor .\nns:m.014zfs ns:influence.influence_node.influenced ?x0 .\nns:m.014zfs ns:influence.influence_node.influenced ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 ?x2 .\n?x2 a M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 176095,
    "questionWithBrackets": "What was executive produced by [Andreas Schmid] and executive produced by a Chinese screenwriter",
    "questionPatternModEntities": "What was executive produced by M0 and executive produced by a Chinese screenwriter",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0k4h2v .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M2 .\n?x1 a M1\n}",
    "expectedResponse": "The White Countess",
    "recursionDepth": 32
  },
  {
    "questionIdx": 206270,
    "questionWithBrackets": "Which male Mexican film producer that edited [Where Are Their Stories?] produced [Interview with the Earth]",
    "questionPatternModEntities": "Which male Mexican film producer that edited M1 produced M3",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.editor.film ns:m.04_8s41 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.07l4_50 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 P3 M4 .\n?x0 a M0\n}",
    "expectedResponse": "Nicol\u00e1s Pereda",
    "recursionDepth": 32
  },
  {
    "questionIdx": 71474,
    "questionWithBrackets": "Was [Phoenix Health Care] founded by [Mary Robinson] and founded by [Wyeth]'s female employee",
    "questionPatternModEntities": "Was M2 founded by M3 and founded by M0 's female employee",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.084v5p .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.0gst303 ns:organization.organization.founders ?x0 .\nns:m.0gst303 ns:organization.organization.founders ns:m.05577\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 180889,
    "questionWithBrackets": "What was produced and executive produced by [Morgause]'s child's French actor",
    "questionPatternModEntities": "What was produced and executive produced by M1 's child 's French actor",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.026n7n\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 ?x2 .\n?x2 P4 M1\n}",
    "expectedResponse": "When the Sea Rises",
    "recursionDepth": 32
  },
  {
    "questionIdx": 93037,
    "questionWithBrackets": "Was a cinematographer whose male German sibling produced [Curse of the Zodiac] [Manuel Lommel]",
    "questionPatternModEntities": "Was a cinematographer whose male German sibling produced M1 M3",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.064kw76 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0345h .\nFILTER ( ns:g.121v241k != ?x0 ) .\nns:g.121v241k a ns:film.cinematographer .\nns:g.121v241k ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\nFILTER ( M3 != ?x0 ) .\nM3 P3 ?x0 .\nM3 a M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 183229,
    "questionWithBrackets": "What was produced by, executive produced by, and written by a costume designer of [Mohabbatein]",
    "questionPatternModEntities": "What was produced by , executive produced by , and written by a costume designer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.03dtt3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "Koochie Koochie Hota Hai",
    "recursionDepth": 32
  },
  {
    "questionIdx": 73051,
    "questionWithBrackets": "Was [Puppet Master II]'s sequel produced and written by [The Other Side]'s producer and executive producer",
    "questionPatternModEntities": "Was M0 's sequel produced and written by M1 's producer and executive producer",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.0h72s_ .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.03cn8vs .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.03cn8vs\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 M0 .\n?x1 P3 M1 .\n?x1 P4 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 201314,
    "questionWithBrackets": "Which film did a star of [The Funeral] and [N\u00e9nette et Boni] edit and executive produce",
    "questionPatternModEntities": "Which film did a star of M1 and M2 edit and executive produce",
    "questionTemplate": "Which [NP_SIMPLE] did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.02rdyyz .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.02wjh2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 32
  },
  {
    "questionIdx": 29702,
    "questionWithBrackets": "Did a child of [Jim Henson Foundation]'s founder play [Jack Pumpkinhead] and play [Talking Sandwich]",
    "questionPatternModEntities": "Did a child of M2 's founder play M0 and play M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.03m57_ .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0sxf90n .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.05y32_\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 55115,
    "questionWithBrackets": "Was [Fixer Dugan] edited by and produced by a film's American star",
    "questionPatternModEntities": "Was M2 edited by and produced by a film 's American star",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x1 a ns:film.film .\nns:m.04649sn ns:film.film.edited_by ?x0 .\nns:m.04649sn ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 204258,
    "questionWithBrackets": "Which film producer was a male Chinese screenwriter that [Jasper Johns] influenced",
    "questionPatternModEntities": "Which film producer was a male Chinese screenwriter that M2 influenced",
    "questionTemplate": "Which [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced_by ns:m.0gcjf .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Ai Weiwei",
    "recursionDepth": 32
  },
  {
    "questionIdx": 237499,
    "questionWithBrackets": "Who was influenced by [The French as Seen By...]'s director and was influenced by a character",
    "questionPatternModEntities": "Who was influenced by M2 's director and was influenced by a character",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 a ns:fictional_universe.fictional_character .\n?x2 ns:film.director.film ns:m.05086x\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 P1 M2\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 32
  },
  {
    "questionIdx": 98005,
    "questionWithBrackets": "Was a film editor a costume designer that [Weta Workshop] employed and was founded by",
    "questionPatternModEntities": "Was a film editor a costume designer that M2 employed and was founded by",
    "questionTemplate": "Was a [NP_SIMPLE] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01cm64 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01cm64\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 148629,
    "questionWithBrackets": "What did a Spanish sibling of [Mar\u00eda del Pilar Saura] direct and [Pierre Lamoureux] direct",
    "questionPatternModEntities": "What did a Spanish sibling of M1 direct and M0 direct",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.0jsqn_ .\n?x1 ns:people.person.nationality ns:m.06mkj .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.011jdm11 .\nFILTER ( ?x1 != ns:m.011jdm11 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Flamenco Hoy",
    "recursionDepth": 32
  },
  {
    "questionIdx": 55369,
    "questionWithBrackets": "Was [Four Bags Full] edited by [Jen\u00f6 Csepreghy] and directed by [L'Homme du large]'s costume designer and art director",
    "questionPatternModEntities": "Was M1 edited by M2 and directed by M0 's costume designer and art director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.02z2c_4 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.02z2c_4 .\nns:m.0ds76_8 ns:film.film.directed_by ?x0 .\nns:m.0ds76_8 ns:film.film.edited_by ns:m.0bnnvvw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 M2 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 175668,
    "questionWithBrackets": "What was edited, produced, and directed by [Mastering Bambi]'s Dutch cinematographer",
    "questionPatternModEntities": "What was edited , produced , and directed by M1 's Dutch cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0ghtdrf .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "Beyond Sunset and Sunrise; Mastering Bambi",
    "recursionDepth": 32
  },
  {
    "questionIdx": 140935,
    "questionWithBrackets": "What costume designer married [Marie Berry]'s sibling and married [Bruno Moynot] and [George Aguilar]",
    "questionPatternModEntities": "What costume designer married M3 's sibling and married M1 and M2",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.03cjgf8 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0byp8q8 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0n3nnsd .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.03cjgf8 ) .\nFILTER ( ?x0 != ns:m.0byp8q8 ) .\nFILTER ( ?x1 != ns:m.0n3nnsd )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 ) .\nFILTER ( ?x1 != M3 )\n}",
    "expectedResponse": "Josiane Balasko",
    "recursionDepth": 32
  },
  {
    "questionIdx": 156706,
    "questionWithBrackets": "What film editor married, influenced, and was influenced by a screenwriter",
    "questionPatternModEntities": "What film editor married , influenced , and was influenced by a screenwriter",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Agn\u00e8s Varda",
    "recursionDepth": 32
  },
  {
    "questionIdx": 178065,
    "questionWithBrackets": "What was executive produced by an actor and edited by an employee of [Arizona State University]",
    "questionPatternModEntities": "What was executive produced by a actor and edited by a employee of M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0trv .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 a M0 .\n?x2 P2 M1\n}",
    "expectedResponse": "Lady Oscar",
    "recursionDepth": 32
  },
  {
    "questionIdx": 144731,
    "questionWithBrackets": "What did [K\u00e1tia Lund] produce and a film editor's parent's child direct",
    "questionPatternModEntities": "What did M0 produce and a film editor 's parent 's child direct",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0ckgy4 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M1\n}",
    "expectedResponse": "All the Invisible Children",
    "recursionDepth": 32
  },
  {
    "questionIdx": 30114,
    "questionWithBrackets": "Did a cinematographer influence a person and influence [Mississippi Mermaid]'s costume designer",
    "questionPatternModEntities": "Did a cinematographer influence a person and influence M2 's costume designer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ?x2 .\n?x1 a ns:people.person .\n?x2 ns:film.film_costumer_designer.costume_design_for_film ns:m.05kfhz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 175507,
    "questionWithBrackets": "What was edited, directed, and written by [Grandmother Mambo]'s female art director",
    "questionPatternModEntities": "What was edited , directed , and written by M1 's female art director",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0rhnj3b .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "\u00a1Dest\u00e1palo!",
    "recursionDepth": 32
  },
  {
    "questionIdx": 91317,
    "questionWithBrackets": "Was a Swedish film director whose female sibling produced [Dr\u00f6mmen Om Maremma] [Jonas Gardell]",
    "questionPatternModEntities": "Was a Swedish film director whose female sibling produced M0 M2",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:g.12nvp6nrv .\n?x0 ns:people.person.gender ns:m.02zsn .\nFILTER ( ns:m.0dhj5_ != ?x0 ) .\nns:m.0dhj5_ a ns:film.director .\nns:m.0dhj5_ ns:people.person.nationality ns:m.0d0vqn .\nns:m.0dhj5_ ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P2 ?x0 .\nM2 P3 M4 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 120846,
    "questionWithBrackets": "Were [Marrying Mr. Perfect] and [Flirting in the Air] produced by a film's star, writer, and executive producer",
    "questionPatternModEntities": "Were M1 and M2 produced by a film 's star , writer , and executive producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 a ns:film.film .\nns:m.010pfc_0 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0j3dcqb ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M0 .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 74832,
    "questionWithBrackets": "Was [Rossana] written by and produced by an Italian film producer's sibling",
    "questionPatternModEntities": "Was M2 written by and produced by a Italian film producer 's sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x0 != ?x1 ) .\nns:m.05c29_p ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.05c29_p ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 33932,
    "questionWithBrackets": "Did a film editor found [Weta Digital] and found a costume designer's employer",
    "questionPatternModEntities": "Did a film editor found M1 and found a costume designer 's employer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01cm3c .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 2877,
    "questionWithBrackets": "Did [Boynton Beach Club]'s female producer's child produce and direct [She-Devil]",
    "questionPatternModEntities": "Did M1 's female producer 's child produce and direct M0",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0275nqh .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0275nqh .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0fzs7k .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M0 .\n?x1 P0 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 193542,
    "questionWithBrackets": "Which actor was influenced by [Sleeping Dogs Lie]'s director and influenced by an actor",
    "questionPatternModEntities": "Which actor was influenced by M1 's director and influenced by a actor",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:film.director.film ns:m.0gfx9j\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 a M0 .\n?x2 P1 M1\n}",
    "expectedResponse": "Mitch Hedberg; Patton Oswalt",
    "recursionDepth": 32
  }
]