[
  {
    "questionIdx": 208737,
    "questionWithBrackets": "Which person was influenced by a person, married [Marjorie Bonner], and was influenced by [Nikolai Dostoyevsky]'s sibling",
    "questionPatternModEntities": "Which person was influenced by a person , married M1 , and was influenced by M2 's sibling",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] [entity] , and was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.09v84d4 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0rbdkgn .\n?x2 a ns:people.person .\nFILTER ( ?x0 != ns:m.09v84d4 ) .\nFILTER ( ?x1 != ns:m.0rbdkgn )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x2 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != M2 )\n}",
    "expectedResponse": "Malcolm Lowry",
    "recursionDepth": 44
  },
  {
    "questionIdx": 119267,
    "questionWithBrackets": "Were [Joe Velikovsky] and [David Foster Wallace] influenced by [Don DeLillo] and [Franz Kafka] and influenced by [Eraserhead]'s editor, director, and art director",
    "questionPatternModEntities": "Were M1 and M4 influenced by M2 and M3 and influenced by M0 's editor , director , and art director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.027jhb .\n?x0 ns:film.editor.film ns:m.027jhb .\n?x0 ns:film.film_art_director.films_art_directed ns:m.027jhb .\nns:m.065zt7y ns:influence.influence_node.influenced_by ?x0 .\nns:m.065zt7y ns:influence.influence_node.influenced_by ns:m.03f0324 .\nns:m.065zt7y ns:influence.influence_node.influenced_by ns:m.0n6kf .\nns:m.0cbgl ns:influence.influence_node.influenced_by ?x0 .\nns:m.0cbgl ns:influence.influence_node.influenced_by ns:m.03f0324 .\nns:m.0cbgl ns:influence.influence_node.influenced_by ns:m.0n6kf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P3 M2 .\nM1 P3 M3 .\nM4 P3 ?x0 .\nM4 P3 M2 .\nM4 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 120331,
    "questionWithBrackets": "Were [Loneliness Is Soul] and [It's Not About the Shawerma] directed by, written by, and executive produced by [Blues for the Avatar]'s executive producer, editor, and director",
    "questionPatternModEntities": "Were M1 and M2 directed by , written by , and executive produced by M0 's executive producer , editor , and director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0znn7j_ .\n?x0 ns:film.editor.film ns:m.0znn7j_ .\n?x0 ns:film.producer.films_executive_produced ns:m.0znn7j_ .\nns:m.0zd5p8f ns:film.film.directed_by ?x0 .\nns:m.0zd5p8f ns:film.film.executive_produced_by ?x0 .\nns:m.0zd5p8f ns:film.film.written_by ?x0 .\nns:m.0zztylq ns:film.film.directed_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 173145,
    "questionWithBrackets": "What was edited by [Beatrice Murch]'s parent, directed by a costume designer of [Chimes at Midnight], and edited by [Virgil W. Vogel] and [Aaron Stell]",
    "questionPatternModEntities": "What was edited by M2 's parent , directed by a costume designer of M3 , and edited by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x0 ns:film.film.edited_by ns:m.0g5s84z .\n?x0 ns:film.film.edited_by ns:m.0k3935 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.07jpg0 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0k3q6b6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x2 .\n?x1 P2 M2 .\n?x2 P3 M3\n}",
    "expectedResponse": "Touch of Evil",
    "recursionDepth": 45
  },
  {
    "questionIdx": 85660,
    "questionWithBrackets": "Was [Visions of Europe] directed by [Jean Genet Is Dead]'s cinematographer and art director, written by [Jean Pierre Magro], and produced by [Donatella Botti] and [Maria Jo\u00e3o Mayer]",
    "questionPatternModEntities": "Was M1 directed by M0 's cinematographer and art director , written by M2 , and produced by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0gybg9q .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0gybg9q .\nns:m.0gkshd_ ns:film.film.directed_by ?x0 .\nns:m.0gkshd_ ns:film.film.produced_by|ns:film.film.production_companies ns:m.04qkwkn .\nns:m.0gkshd_ ns:film.film.produced_by|ns:film.film.production_companies ns:m.07m25ff .\nns:m.0gkshd_ ns:film.film.written_by ns:m.0w_gmwk\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 M2 .\nM1 P3 M3 .\nM1 P3 M4 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 45
  },
  {
    "questionIdx": 14346,
    "questionWithBrackets": "Did [Massimo D'Anolfi] and [Andreas Gr\u00e4fenstein] executive produce, write, produce, direct, and edit a film",
    "questionPatternModEntities": "Did M1 and M2 executive produce , write , produce , direct , and edit a film",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0gblv4f ns:film.director.film ?x0 .\nns:m.0gblv4f ns:film.editor.film ?x0 .\nns:m.0gblv4f ns:film.producer.films_executive_produced ?x0 .\nns:m.0gblv4f ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.0gblv4f ns:film.writer.film ?x0 .\nns:m.0s96mm5 ns:film.director.film ?x0 .\nns:m.0s96mm5 ns:film.editor.film ?x0 .\nns:m.0s96mm5 ns:film.producer.films_executive_produced ?x0 .\nns:m.0s96mm5 ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.0s96mm5 ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 69550,
    "questionWithBrackets": "Was [No Strings Attached] executive produced by [Spyglass Entertainment]'s employee and founder and produced by a Canadian person's spouse",
    "questionPatternModEntities": "Was M3 executive produced by M0 's employee and founder and produced by a Canadian person 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.05rrtf .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.05rrtf .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:people.person .\n?x2 ns:people.person.nationality ns:m.0d060g .\nFILTER ( ?x1 != ?x2 ) .\nns:m.0dlkhvv ns:film.film.executive_produced_by ?x0 .\nns:m.0dlkhvv ns:film.film.produced_by|ns:film.film.production_companies ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 M2 .\n?x2 a M1 .\nFILTER ( ?x1 != ?x2 ) .\nM3 P4 ?x0 .\nM3 P5 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 45
  },
  {
    "questionIdx": 143378,
    "questionWithBrackets": "What did [FilmFlex] and [Lions Gate Entertainment] distribute, an editor and writer of [Earth Days] produce, and [Roadside Attractions] distribute",
    "questionPatternModEntities": "What did M0 and M1 distribute , a editor and writer of M3 produce , and M2 distribute",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] , a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03czrpj .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03xq0f .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03xsby .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.editor.film ns:m.05h2689 .\n?x1 ns:film.writer.film ns:m.05h2689\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x1 P2 M3 .\n?x1 P3 M3\n}",
    "expectedResponse": "The Conspirator",
    "recursionDepth": 45
  },
  {
    "questionIdx": 87391,
    "questionWithBrackets": "Was [Yamakasi] founded by a sibling of an actor, founded by [Alvin Ailey] and [Malik Diouf], and founded by [David Belle]",
    "questionPatternModEntities": "Was M1 founded by a sibling of a actor , founded by M2 and M3 , and founded by M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of a [NP_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.actor .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0dcys4 ns:organization.organization.founders ?x0 .\nns:m.0dcys4 ns:organization.organization.founders ns:m.02hkzh .\nns:m.0dcys4 ns:organization.organization.founders ns:m.05zc13 .\nns:m.0dcys4 ns:organization.organization.founders ns:m.0gdktpw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P1 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 113675,
    "questionWithBrackets": "Were [Blues for the Avatar] and [It's Not About the Shawerma] executive produced by and written by a person that wrote and directed [Star Wars Holiday Special]",
    "questionPatternModEntities": "Were M2 and M3 executive produced by and written by a person that wrote and directed M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.0199wf .\n?x0 ns:film.writer.film ns:m.0199wf .\nns:m.0znn7j_ ns:film.film.executive_produced_by ?x0 .\nns:m.0znn7j_ ns:film.film.written_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 182140,
    "questionWithBrackets": "What was produced by a cinematographer, written by [David Kennard], and written by a founder and employee of [Video Arts]",
    "questionPatternModEntities": "What was produced by a cinematographer , written by M0 , and written by a founder and employee of M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x0 ns:film.film.written_by ns:m.0nftqp0 .\n?x1 a ns:film.cinematographer .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0d30j9 .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0d30j9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x2 a M2\n}",
    "expectedResponse": "Wine for the Confused",
    "recursionDepth": 45
  },
  {
    "questionIdx": 238691,
    "questionWithBrackets": "Who was influenced by a writer of [Getting Acquainted] and [His Favourite Pastime], influenced by [Nipsey Russell], and influenced by [Fun and Fancy Free]'s star",
    "questionPatternModEntities": "Who was influenced by a writer of M2 and M3 , influenced by M1 , and influenced by M4 's star",
    "questionTemplate": "Who was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.04ct6p .\n?x1 ns:film.writer.film ns:m.02rd2jv .\n?x1 ns:film.writer.film ns:m.02rd8fr .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.054rdz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P1 M3 .\n?x2 P2 M4\n}",
    "expectedResponse": "Michael Jackson",
    "recursionDepth": 45
  },
  {
    "questionIdx": 176993,
    "questionWithBrackets": "What was executive produced by [Mother and Child]'s art director and star, executive produced by a person, and written by [Elan Mastai]",
    "questionPatternModEntities": "What was executive produced by M1 's art director and star , executive produced by a person , and written by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x0 ns:film.film.written_by ns:m.0jtbsz .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.064mg8g .\n?x1 ns:film.film_art_director.films_art_directed ns:m.064mg8g .\n?x2 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x2 a M2\n}",
    "expectedResponse": "The Samaritan",
    "recursionDepth": 45
  },
  {
    "questionIdx": 236678,
    "questionWithBrackets": "Who was influenced by [Manhattan Murder Mystery]'s director, was influenced by a film producer, and influenced [Ron Bennington] and [Artie Lange]",
    "questionPatternModEntities": "Who was influenced by M3 's director , was influenced by a film producer , and influenced M1 and M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , was [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.01xwqn .\n?x0 ns:influence.influence_node.influenced ns:m.077vqz .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 ns:film.director.film ns:m.04k9yp .\n?x2 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x2 a M4\n}",
    "expectedResponse": "Bill Hicks",
    "recursionDepth": 45
  },
  {
    "questionIdx": 125572,
    "questionWithBrackets": "Were [Tetsuo: The Iron Man] and [A Snake of June] produced by, edited by, and directed by a star, writer, and art director of [Tetsuo II: Body Hammer]",
    "questionPatternModEntities": "Were M1 and M2 produced by , edited by , and directed by a star , writer , and art director of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0brs6b .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x0 ns:film.writer.film ns:m.0brs6b .\nns:m.03m9g_y ns:film.film.directed_by ?x0 .\nns:m.03m9g_y ns:film.film.edited_by ?x0 .\nns:m.03m9g_y ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.05m0x0 ns:film.film.directed_by ?x0 .\nns:m.05m0x0 ns:film.film.edited_by ?x0 .\nns:m.05m0x0 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 45
  },
  {
    "questionIdx": 118385,
    "questionWithBrackets": "Were [Inglourious Basterds] and [Death Proof] written by [Quentin Tarantino], edited by [Elizabeth Rowin]'s spouse, and executive produced by [Harvey Weinstein] and [Bob Weinstein]",
    "questionPatternModEntities": "Were M1 and M5 written by M4 , edited by M0 's spouse , and executive produced by M2 and M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0gxbq_f .\nFILTER ( ?x0 != ns:m.0gxbq_f ) .\nns:m.02yvct ns:film.film.edited_by ?x0 .\nns:m.02yvct ns:film.film.executive_produced_by ns:m.05hj_k .\nns:m.02yvct ns:film.film.executive_produced_by ns:m.06q8hf .\nns:m.02yvct ns:film.film.written_by ns:m.0693l .\nns:m.03bxrfl ns:film.film.edited_by ?x0 .\nns:m.03bxrfl ns:film.film.executive_produced_by ns:m.05hj_k .\nns:m.03bxrfl ns:film.film.executive_produced_by ns:m.06q8hf .\nns:m.03bxrfl ns:film.film.written_by ns:m.0693l\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P2 M4 .\nM1 P3 ?x0 .\nM5 P1 M2 .\nM5 P1 M3 .\nM5 P2 M4 .\nM5 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 193497,
    "questionWithBrackets": "Which actor was influenced by [Friedrich Nietzsche], influenced by [Walter Benjamin], and influenced by a company's parent's employee",
    "questionPatternModEntities": "Which actor was influenced by M1 , influenced by M2 , and influenced by a company 's parent 's employee",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01h2_6 .\n?x0 ns:influence.influence_node.influenced_by ns:m.02wh0 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 a M3\n}",
    "expectedResponse": "Giorgio Agamben; Avital Ronell",
    "recursionDepth": 45
  },
  {
    "questionIdx": 130551,
    "questionWithBrackets": "Were [yogendrachavda] and [Yogendra Chavda] influenced by [Mark Zuckerberg] and [Bill Gates] and influenced by a founder and employee of a production company",
    "questionPatternModEntities": "Were M1 and M4 influenced by M2 and M3 and influenced by a founder and employee of a production company",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.production_company .\nns:m.0_h979x ns:influence.influence_node.influenced_by ?x0 .\nns:m.0_h979x ns:influence.influence_node.influenced_by ns:m.017nt .\nns:m.0_h979x ns:influence.influence_node.influenced_by ns:m.086dny .\nns:m.0_kvlrg ns:influence.influence_node.influenced_by ?x0 .\nns:m.0_kvlrg ns:influence.influence_node.influenced_by ns:m.017nt .\nns:m.0_kvlrg ns:influence.influence_node.influenced_by ns:m.086dny\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM4 P2 ?x0 .\nM4 P2 M2 .\nM4 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 45
  },
  {
    "questionIdx": 236851,
    "questionWithBrackets": "Who was influenced by [Orson Welles], influenced by an editor and producer of [Killer's Kiss], and influenced by a costume designer",
    "questionPatternModEntities": "Who was influenced by M1 , influenced by a editor and producer of M3 , and influenced by a costume designer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.05kh_ .\n?x1 a ns:film.film_costumer_designer .\n?x2 ns:film.editor.film ns:m.046639 .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.046639\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2 .\n?x2 P1 M3 .\n?x2 P2 M3\n}",
    "expectedResponse": "Wes Anderson",
    "recursionDepth": 45
  },
  {
    "questionIdx": 125038,
    "questionWithBrackets": "Were [Steve Bartman: Catching Hell] and [Babe, I Love You] executive produced by [Charo Santos-Concio], executive produced by [Vicente del Rosario Jr.] and [Malou N. Santos], and edited by a cinematographer",
    "questionPatternModEntities": "Were M1 and M5 executive produced by M2 , executive produced by M3 and M4 , and edited by a cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\nns:m.0bbyl25 ns:film.film.edited_by ?x0 .\nns:m.0bbyl25 ns:film.film.executive_produced_by ns:m.02vq8xn .\nns:m.0bbyl25 ns:film.film.executive_produced_by ns:m.08627jx .\nns:m.0bbyl25 ns:film.film.executive_produced_by ns:m.0bffb2d .\nns:m.0gfqwp3 ns:film.film.edited_by ?x0 .\nns:m.0gfqwp3 ns:film.film.executive_produced_by ns:m.02vq8xn .\nns:m.0gfqwp3 ns:film.film.executive_produced_by ns:m.08627jx .\nns:m.0gfqwp3 ns:film.film.executive_produced_by ns:m.0bffb2d\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M2 .\nM1 P0 M3 .\nM1 P0 M4 .\nM1 P1 ?x0 .\nM5 P0 M2 .\nM5 P0 M3 .\nM5 P0 M4 .\nM5 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 68574,
    "questionWithBrackets": "Was [Myglaren] written by a Mexican screenwriter's sibling, written by [Paul Mayeda Berges], and executive produced by [Maria K\u00f6pf]",
    "questionPatternModEntities": "Was M2 written by a Mexican screenwriter 's sibling , written by M4 , and executive produced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.0b90_r .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0b6m6g_ ns:film.film.executive_produced_by ns:m.0j_vyd .\nns:m.0b6m6g_ ns:film.film.written_by ?x0 .\nns:m.0b6m6g_ ns:film.film.written_by ns:m.06j997\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 M3 .\nM2 P3 ?x0 .\nM2 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 125648,
    "questionWithBrackets": "Were [Thalaimurai], [9mm Sunrise], [Vampire Blvd.], [The Roller Blade Seven], [Super Hero Central], and [Undercover X] edited by and produced by [Cyberdyne Tech #2]'s Japanese actor",
    "questionPatternModEntities": "Were M2 , M3 , M4 , M5 , M6 , and M7 edited by and produced by M1 's Japanese actor",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0z4stdc .\n?x0 ns:people.person.nationality ns:m.03_3d .\nns:m.0125_fzs ns:film.film.edited_by ?x0 .\nns:m.0125_fzs ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.074s65 ns:film.film.edited_by ?x0 .\nns:m.074s65 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.07grly ns:film.film.edited_by ?x0 .\nns:m.07grly ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.08c8nm ns:film.film.edited_by ?x0 .\nns:m.08c8nm ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.08c8xx ns:film.film.edited_by ?x0 .\nns:m.08c8xx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0f2fxg ns:film.film.edited_by ?x0 .\nns:m.0f2fxg ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM4 P2 ?x0 .\nM4 P3 ?x0 .\nM5 P2 ?x0 .\nM5 P3 ?x0 .\nM6 P2 ?x0 .\nM6 P3 ?x0 .\nM7 P2 ?x0 .\nM7 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 45
  },
  {
    "questionIdx": 120346,
    "questionWithBrackets": "Were [Loneliness Is Soul] and [Welcome to Serendipity] directed, written, produced, and executive produced by an executive producer and cinematographer of [White Stork Is Coming]",
    "questionPatternModEntities": "Were M1 and M2 directed , written , produced , and executive produced by a executive producer and cinematographer of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0zxyz5j .\n?x0 ns:film.producer.films_executive_produced ns:m.0zxyz5j .\nns:m.0zd5p8f ns:film.film.directed_by ?x0 .\nns:m.0zd5p8f ns:film.film.executive_produced_by ?x0 .\nns:m.0zd5p8f ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zd5p8f ns:film.film.written_by ?x0 .\nns:m.0zkdj6y ns:film.film.directed_by ?x0 .\nns:m.0zkdj6y ns:film.film.executive_produced_by ?x0 .\nns:m.0zkdj6y ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zkdj6y ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 45
  },
  {
    "questionIdx": 213780,
    "questionWithBrackets": "Who did [B. Traven] and [Kurt Vonnegut] influence and a film's editor, star, cinematographer, and writer influence",
    "questionPatternModEntities": "Who did M1 and M2 influence and a film 's editor , star , cinematographer , and writer influence",
    "questionTemplate": "Who did [entity] and [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.03r50z .\n?x0 ns:influence.influence_node.influenced_by ns:m.049gc .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x1 ns:film.editor.film ?x2 .\n?x1 ns:film.writer.film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x1 P4 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 45
  },
  {
    "questionIdx": 129777,
    "questionWithBrackets": "Were [White Stork Is Coming] and [Rick's Canoe] executive produced by, directed by, written by, produced by, and edited by a screenwriter",
    "questionPatternModEntities": "Were M1 and M2 executive produced by , directed by , written by , produced by , and edited by a screenwriter",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0 .\nns:m.0zxyz5j ns:film.film.directed_by ?x0 .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.executive_produced_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zxyz5j ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 46
  }
]