[
  {
    "questionIdx": 84739,
    "questionWithBrackets": "Was [United Kingdom] [The Godfather Part III]'s Italian writer's American sibling's country of nationality",
    "questionPatternModEntities": "Was M3 M1 's Italian writer 's American sibling 's country of nationality",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.writer.film ns:m.0y_yw .\n?x1 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x0 != ?x1 ) .\nns:m.07ssc ^ns:people.person.nationality ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P1 M2 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 32459,
    "questionWithBrackets": "Did a female person that executive produced [Madonna: The MDNA Tour] influence [Lenny Henry]",
    "questionPatternModEntities": "Did a female person that executive produced M2 influence M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ns:m.0w444w1 .\n?x0 ns:influence.influence_node.influenced ns:m.013qy3 .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 21976,
    "questionWithBrackets": "Did [The Departed] star a film editor and star [Ramon Estevez]'s parent",
    "questionPatternModEntities": "Did M2 star a film editor and star M1 's parent",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.08s1w8 .\nns:m.04vr_f ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04vr_f ns:film.film.starring/ns:film.performance.actor ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 144607,
    "questionWithBrackets": "What did [Kazuko Kurosawa]'s parent executive produce, write, and produce",
    "questionPatternModEntities": "What did M0 's parent executive produce , write , and produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.03w9kln\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "Kagemusha",
    "recursionDepth": 29
  },
  {
    "questionIdx": 151364,
    "questionWithBrackets": "What did an actor's actor executive produce and [Nicol\u00e1s L\u00f3pez] write",
    "questionPatternModEntities": "What did a actor 's actor executive produce and M0 write",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0gfrmlj .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Average Red",
    "recursionDepth": 29
  },
  {
    "questionIdx": 131042,
    "questionWithBrackets": "What British cinematographer that was employed by [Syncopy Inc.] influenced [Robert Santos]",
    "questionPatternModEntities": "What British cinematographer that was employed by M2 influenced M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] that was [VP_SIMPLE] by [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced ns:m.04vxxd8 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04yhgyb .\n?x0 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Christopher Nolan",
    "recursionDepth": 29
  },
  {
    "questionIdx": 222057,
    "questionWithBrackets": "Who produced, executive produced, and directed [The Magician's Hat]'s prequel",
    "questionPatternModEntities": "Who produced , executive produced , and directed M1 's prequel",
    "questionTemplate": "Who [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 ns:film.film.sequel ns:m.05p77qr\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Doro Vlado Hreljanovic",
    "recursionDepth": 29
  },
  {
    "questionIdx": 219709,
    "questionWithBrackets": "Who influenced and was influenced by [Ydessa, the Bears and etc.]'s director and producer",
    "questionPatternModEntities": "Who influenced and was influenced by M1 's director and producer",
    "questionTemplate": "Who [VP_SIMPLE] and was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.director.film ns:m.0z6mj21 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0z6mj21\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 29
  },
  {
    "questionIdx": 44111,
    "questionWithBrackets": "Was [Abigail Joshi] a screenwriter's Chinese Canadian male sibling",
    "questionPatternModEntities": "Was M1 a screenwriter 's Chinese Canadian male sibling",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\nFILTER ( ns:m.0_g7d1_ != ?x0 ) .\nns:m.0_g7d1_ ns:people.person.gender ns:m.05zppz .\nns:m.0_g7d1_ ns:people.person.nationality ns:m.0d05w3 .\nns:m.0_g7d1_ ns:people.person.nationality ns:m.0d060g .\nns:m.0_g7d1_ ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 158199,
    "questionWithBrackets": "What film producer was founded by [Roy O. Disney] and employed a film director",
    "questionPatternModEntities": "What film producer was founded by M1 and employed a film director",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ns:m.015yg9 .\n?x1 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Walt Disney Animation Studios",
    "recursionDepth": 29
  },
  {
    "questionIdx": 164363,
    "questionWithBrackets": "What screenwriter that married [Bijoya Ray] did a screenwriter's parent influence",
    "questionPatternModEntities": "What screenwriter that married M1 did a screenwriter 's parent influence",
    "questionTemplate": "What [NP_SIMPLE] that [VP_SIMPLE] [entity] did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0fndm2 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ns:m.0fndm2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M0 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Satyajit Ray",
    "recursionDepth": 29
  },
  {
    "questionIdx": 138215,
    "questionWithBrackets": "What character married [Mandy Pepperidge] and was influenced by a character",
    "questionPatternModEntities": "What character married M1 and was influenced by a character",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04zrtj7 .\n?x1 a ns:fictional_universe.fictional_character .\nFILTER ( ?x0 != ns:m.04zrtj7 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 a M0 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "John \"Bluto\" Blutarsky",
    "recursionDepth": 29
  },
  {
    "questionIdx": 42164,
    "questionWithBrackets": "Did an art director's spouse play [Saraswathi Teacher] and play [Mrs. Ganga Kumar]",
    "questionPatternModEntities": "Did a art director 's spouse play M0 and play M1",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.011r7n2v .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h6yqz5 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 148651,
    "questionWithBrackets": "What did a Swedish cinematographer direct and [Emil Larsson] edit",
    "questionPatternModEntities": "What did a Swedish cinematographer direct and M0 edit",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0ct2c6 .\n?x1 a ns:film.cinematographer .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "Du & jag; Fjorton suger",
    "recursionDepth": 29
  },
  {
    "questionIdx": 114329,
    "questionWithBrackets": "Were [Building a Building] and [The Whoopee Party] produced by [Z-Entertainment]'s parent's employee and founder",
    "questionPatternModEntities": "Were M1 and M2 produced by M0 's parent 's employee and founder",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0y9vmzf .\nns:m.07k55vt ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0g3svd ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 13062,
    "questionWithBrackets": "Did [Leon Youngblood SR]'s country of nationality employ an actor and employ [G\u00e9rard Barbonnet]",
    "questionPatternModEntities": "Did M1 's country of nationality employ a actor and employ M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ns:m.012qgrjw .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0vntbp0 .\n?x1 a ns:film.actor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 148282,
    "questionWithBrackets": "What did a Dutch editor of [The bridge] direct and produce",
    "questionPatternModEntities": "What did a Dutch editor of M1 direct and produce",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.editor.film ns:m.080955b .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Die Windrose",
    "recursionDepth": 29
  },
  {
    "questionIdx": 86732,
    "questionWithBrackets": "Was [White Stork Is Coming] edited by and produced by [Exquisit Corpses]'s executive producer and producer",
    "questionPatternModEntities": "Was M1 edited by and produced by M0 's executive producer and producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.0zntmwq .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0zntmwq .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 20224,
    "questionWithBrackets": "Did [Symantec Corporation] acquire a company and acquire [NetDistributor] and [IMlogic]",
    "questionPatternModEntities": "Did M1 acquire a company and acquire M2 and M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:business.employer .\nns:m.01zpmq ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ?x0 .\nns:m.01zpmq ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.03brq21 .\nns:m.01zpmq ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.05nm1gr\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P0 M2 .\nM1 P0 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 31884,
    "questionWithBrackets": "Did a director of a film's sequel and prequel direct [Art House]",
    "questionPatternModEntities": "Did a director of a film 's sequel and prequel direct M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.director.film ns:m.05nmszz .\n?x1 ns:film.film.prequel ?x2 .\n?x1 ns:film.film.sequel ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 9492,
    "questionWithBrackets": "Did [Hayao Miyazaki] write [Scream 3] and write a film's prequel",
    "questionPatternModEntities": "Did M1 write M2 and write a film 's prequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 a ns:film.film .\nns:m.0534v ns:film.writer.film ?x0 .\nns:m.0534v ns:film.writer.film ns:m.02v63m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 237996,
    "questionWithBrackets": "Who was influenced by a cinematographer and influenced an art director",
    "questionPatternModEntities": "Who was influenced by a cinematographer and influenced a art director",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 a ns:film.film_art_director .\n?x2 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 a M2\n}",
    "expectedResponse": "Maya Deren; Gilles Deleuze",
    "recursionDepth": 29
  },
  {
    "questionIdx": 35309,
    "questionWithBrackets": "Did a film star [Curtis Garcia] and star [Raging Bull]'s cinematographer",
    "questionPatternModEntities": "Did a film star M1 and star M2 's cinematographer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x1 .\n?x0 ns:film.film.starring/ns:film.performance.actor ns:m.0gc9b4h .\n?x1 ns:film.cinematographer.film ns:m.06cm5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 18560,
    "questionWithBrackets": "Did [Rudi Feld]'s German American sibling's spouse play [Prof. Ludwig Rosenberg]",
    "questionPatternModEntities": "Did M1 's German American sibling 's spouse play M0",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0pd1gtm .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.nationality ns:m.09c7w0 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0hqt46g .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0hqt46g )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M2 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 229806,
    "questionWithBrackets": "Who was a female French film producer that [Honor\u00e9 de Balzac] influenced",
    "questionPatternModEntities": "Who was a female French film producer that M2 influenced",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.0bmjw .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Ann Scott",
    "recursionDepth": 29
  },
  {
    "questionIdx": 124387,
    "questionWithBrackets": "Were [Seven Swords] and [Shaolin Girl] executive produced by a film's Chinese writer",
    "questionPatternModEntities": "Were M2 and M3 executive produced by a film 's Chinese writer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ?x1 .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x1 a ns:film.film .\nns:m.03cttnf ns:film.film.executive_produced_by ?x0 .\nns:m.079tvk ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 11796,
    "questionWithBrackets": "Did [Johnny Dorelli] marry a character's actor and marry [Richard Emmolo]",
    "questionPatternModEntities": "Did M1 marry a character 's actor and marry M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 a ns:fictional_universe.fictional_character .\nFILTER ( ns:m.026jwcr != ?x0 ) .\nFILTER ( ns:m.026jwcr != ns:m.0h29dkz ) .\nns:m.026jwcr ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.026jwcr ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0h29dkz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != M2 ) .\nM1 P1 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 205489,
    "questionWithBrackets": "Which film was written by an actor and starred [Rishi Banerjee]",
    "questionPatternModEntities": "Which film was written by a actor and starred M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.starring/ns:film.performance.actor ns:m.0sgbwr9 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Sagar Sangamey",
    "recursionDepth": 29
  },
  {
    "questionIdx": 102191,
    "questionWithBrackets": "Was a male parent of an executive producer and costume designer of [Fudgy Wudgy Fudge Face] [John Reesor Williams]",
    "questionPatternModEntities": "Was a male parent of a executive producer and costume designer of M0 M1",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0h1pp81 .\n?x0 ns:film.producer.films_executive_produced ns:m.0h1pp81 .\nns:m.08bb7p ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.08bb7p ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 M2 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 38388,
    "questionWithBrackets": "Did a producer of [Killer McCoy] distribute and produce [Amityville Dollhouse]'s sequel",
    "questionPatternModEntities": "Did a producer of M0 distribute and produce M1 's sequel",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09pgj_r .\n?x1 ns:film.film.prequel ns:m.0gbrn0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 218424,
    "questionWithBrackets": "Who influenced [John Caparulo] and [Dane Cook] and was influenced by a film director",
    "questionPatternModEntities": "Who influenced M1 and M2 and was influenced by a film director",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [entity] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.03g5_y .\n?x0 ns:influence.influence_node.influenced ns:m.047g91w .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Richard Pryor",
    "recursionDepth": 30
  },
  {
    "questionIdx": 125016,
    "questionWithBrackets": "Were [State of Play] and [United 93] executive produced by [Stop! Or My Mom Will Shoot]'s writer's female spouse",
    "questionPatternModEntities": "Were M2 and M3 executive produced by M1 's writer 's female spouse",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.writer.film ns:m.069q4f .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02x2jl_ ns:film.film.executive_produced_by ?x0 .\nns:m.09r94m ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 178071,
    "questionWithBrackets": "What was executive produced by an actor of [Otto Mann] and executive produced by [Glen Pitre]",
    "questionPatternModEntities": "What was executive produced by a actor of M1 and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.06zqj6g .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0h8f4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Flood Streets",
    "recursionDepth": 30
  },
  {
    "questionIdx": 81524,
    "questionWithBrackets": "Was [The Lost Nomads: Get Lost!] directed by, edited by, and executive produced by an actor",
    "questionPatternModEntities": "Was M1 directed by , edited by , and executive produced by a actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nns:m.0h2xxyq ns:film.film.directed_by ?x0 .\nns:m.0h2xxyq ns:film.film.edited_by ?x0 .\nns:m.0h2xxyq ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 151291,
    "questionWithBrackets": "What did an actor of [Pimentel] write, direct, and produce",
    "questionPatternModEntities": "What did a actor of M0 write , direct , and produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.011f80d3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "Cazadores; Anything You Want",
    "recursionDepth": 30
  },
  {
    "questionIdx": 18940,
    "questionWithBrackets": "Did [Secret Service Member #2]'s actor executive produce a film and edit [Getting Any?]",
    "questionPatternModEntities": "Did M1 's actor executive produce a film and edit M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0yf1hwr .\n?x0 ns:film.editor.film ns:m.0381wy .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 83004,
    "questionWithBrackets": "Was [The White Countess]'s British Japanese male writer's parent [Shizuko Ishiguro]",
    "questionPatternModEntities": "Was M0 's British Japanese male writer 's parent M4",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0bq8pl .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x0 ns:people.person.nationality ns:m.07ssc .\nns:m.0zbhcqv ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  }
]