[
  {
    "questionIdx": 191468,
    "questionWithBrackets": "Which Mexican film editor was a cinematographer that directed [Perseguido] and wrote [Un secreto de Esperanza]",
    "questionPatternModEntities": "Which Mexican film editor was a cinematographer that directed M4 and wrote M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] was a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:film.editor .\n?x0 ns:film.director.film ns:m.0crrwq8 .\n?x0 ns:film.writer.film ns:m.07fc39 .\n?x0 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Leopoldo Laborde",
    "recursionDepth": 38
  },
  {
    "questionIdx": 9401,
    "questionWithBrackets": "Did [Harvard University] employ a Dutch screenwriter's spouse and employ [Max Theiler] and [Elaine Scarry]",
    "questionPatternModEntities": "Did M2 employ a Dutch screenwriter 's spouse and employ M3 and M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.059j2 .\nFILTER ( ?x0 != ?x1 ) .\nns:m.03ksy ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.03ksy ns:business.employer.employees/ns:business.employment_tenure.person ns:m.058rln .\nns:m.03ksy ns:business.employer.employees/ns:business.employment_tenure.person ns:m.08q768\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 149595,
    "questionWithBrackets": "What did a female person that [The Maldonado Miracle] was executive produced by and directed by found",
    "questionPatternModEntities": "What did a female person that M1 was executive produced by and directed by found",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE] by [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 a ns:people.person .\n?x1 ns:film.director.film ns:m.04j2bpw .\n?x1 ns:film.producer.films_executive_produced ns:m.04j2bpw .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 P2 M2 .\n?x1 P3 M1 .\n?x1 a M0\n}",
    "expectedResponse": "Ventanarosa",
    "recursionDepth": 38
  },
  {
    "questionIdx": 13540,
    "questionWithBrackets": "Did [Luc Besson] marry [Edie Brickell], influence [Douglas Adams], and marry a cinematographer's sibling",
    "questionPatternModEntities": "Did M1 marry M3 , influence M2 , and marry a cinematographer 's sibling",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.cinematographer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.0b478 != ?x0 ) .\nFILTER ( ns:m.0b478 != ns:m.03r7kj ) .\nns:m.0b478 ns:influence.influence_node.influenced ns:m.0282x .\nns:m.0b478 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0b478 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.03r7kj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != M3 ) .\nM1 P1 M2 .\nM1 P2 ?x0 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 68805,
    "questionWithBrackets": "Was [Natalie Palmer] influenced by a film director's parent and child and influenced by a person",
    "questionPatternModEntities": "Was M2 influenced by a film director 's parent and child and influenced by a person",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.director .\nns:m.0krp7lv ns:influence.influence_node.influenced_by ?x0 .\nns:m.0krp7lv ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 ?x2 .\n?x1 P1 ?x2 .\n?x2 a M1 .\nM2 P2 ?x0 .\nM2 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 174188,
    "questionWithBrackets": "What was edited by a Swedish film editor's spouse and edited by [Asa Mossberg] and [Erik B\u00e4fving]",
    "questionPatternModEntities": "What was edited by a Swedish film editor 's spouse and edited by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0bgk4ws .\n?x0 ns:film.film.edited_by ns:m.0cr6sdy .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:film.editor .\n?x2 ns:people.person.nationality ns:m.0d0vqn .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P1 ?x2 .\n?x2 P2 M3 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Everyone Is Older Than I Am",
    "recursionDepth": 38
  },
  {
    "questionIdx": 214510,
    "questionWithBrackets": "Who did [Litton Industries] employ, [Litton Medical Products] and [University of Paris] employ, and [Har Gobind Khorana]'s employer employ",
    "questionPatternModEntities": "Who did M1 employ , M2 and M3 employ , and M4 's employer employ",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] , [entity] and [entity] [VP_SIMPLE] , and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02v3pg .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0g7n2wm .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0lk0l .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.026mh5\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 M4\n}",
    "expectedResponse": "Alain Enthoven",
    "recursionDepth": 38
  },
  {
    "questionIdx": 8275,
    "questionWithBrackets": "Did [George Folsey, Jr.] produce [\u00a1Three Amigos!], executive produce [Clue], and edit a prequel of [Hostel 3]",
    "questionPatternModEntities": "Did M1 produce M3 , executive produce M2 , and edit a prequel of M0",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ns:m.0j8k_lc .\nns:m.05c00qy ns:film.editor.film ?x0 .\nns:m.05c00qy ns:film.producer.films_executive_produced ns:m.0hqdd .\nns:m.05c00qy ns:film.producer.film|ns:film.production_company.films ns:m.03nnzk\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 M2 .\nM1 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 175516,
    "questionWithBrackets": "What was edited, directed, and written by a star, costume designer, and art director of [Animato]",
    "questionPatternModEntities": "What was edited , directed , and written by a star , costume designer , and art director of M0",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.07fm59 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.07fm59 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.07fm59\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M0 .\n?x1 P5 M0\n}",
    "expectedResponse": "The Wizard of Speed and Time; Animato",
    "recursionDepth": 38
  },
  {
    "questionIdx": 170955,
    "questionWithBrackets": "What was directed by an Italian writer of [Luisa Sanfelice] and executive produced by [Luggi  Waldleitner] and [Jean-Claude Cecile]",
    "questionPatternModEntities": "What was directed by a Italian writer of M2 and executive produced by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.07q91y7 .\n?x0 ns:film.film.executive_produced_by ns:m.0w_6vj_ .\n?x1 ns:film.writer.film ns:m.0n_bq9c .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Fiorile",
    "recursionDepth": 38
  },
  {
    "questionIdx": 37702,
    "questionWithBrackets": "Did a person employed by [Robert Edwards]'s employer and employed by [Macquarie University] edit [Lady Oscar]",
    "questionPatternModEntities": "Did a person employed by M3 's employer and employed by M2 edit M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.02qdhzf .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04zwc .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.05mk24\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 81700,
    "questionWithBrackets": "Was [The Medusa Touch] distributed by [Warner Bros. Pictures] and produced by a parent of [Wolvesbayne]'s star and editor",
    "questionPatternModEntities": "Was M1 distributed by M2 and produced by a parent of M0 's star and editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.05p3q7f .\n?x1 ns:film.editor.film ns:m.05p3q7f .\nns:m.0b9r5k ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0k9pn .\nns:m.0b9r5k ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 97318,
    "questionWithBrackets": "Was a film distributor founded by [Jules Brulatour], founded by [Marcie Bloom], and founded by a person",
    "questionPatternModEntities": "Was a film distributor founded by M1 , founded by M2 , and founded by a person",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.09nlrw .\n?x0 ns:organization.organization.founders ns:m.0lywcw1 .\n?x1 a ns:people.person\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 77286,
    "questionWithBrackets": "Was [Star of Midnight] executive produced, edited, directed, produced, and written by a costume designer",
    "questionPatternModEntities": "Was M1 executive produced , edited , directed , produced , and written by a costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\nns:m.06w8lt0 ns:film.film.directed_by ?x0 .\nns:m.06w8lt0 ns:film.film.edited_by ?x0 .\nns:m.06w8lt0 ns:film.film.executive_produced_by ?x0 .\nns:m.06w8lt0 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.06w8lt0 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 72592,
    "questionWithBrackets": "Was [Promises Written in Water] produced by a costume designer, writer, and editor of [The Brown Bunny] and distributed by [Gray Daisy Films]",
    "questionPatternModEntities": "Was M1 produced by a costume designer , writer , and editor of M0 and distributed by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.01n9cy .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy .\n?x0 ns:film.writer.film ns:m.01n9cy .\nns:m.0bh9qf1 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0f136rz .\nns:m.0bh9qf1 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 24682,
    "questionWithBrackets": "Did [Walt Disney] found [Detective Montalbano: Vol. 4]'s producer, found a film distributor, and found [Disney Interactive]",
    "questionPatternModEntities": "Did M2 found M0 's producer , found a film distributor , and found M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0gyy20_ .\n?x1 a ns:film.film_distributor .\nns:m.081nh ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ?x1 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ns:m.047cb57\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 a M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM2 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 21111,
    "questionWithBrackets": "Did [The Auteur] star [Sawdust City]'s costume designer, star a film editor, and star [Tamar Bryner]",
    "questionPatternModEntities": "Did M2 star M1 's costume designer , star a film editor , and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0gyy7ng .\nns:m.04mwcfs ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04mwcfs ns:film.film.starring/ns:film.performance.actor ?x1 .\nns:m.04mwcfs ns:film.film.starring/ns:film.performance.actor ns:m.0vzkzqc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM2 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 215023,
    "questionWithBrackets": "Who did [Tetsuo II: Body Hammer]'s art director, writer, and cinematographer influence and [Brandi Milbradt] and [Rachel Weisz] marry",
    "questionPatternModEntities": "Who did M3 's art director , writer , and cinematographer influence and M1 and M2 marry",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.014x77 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04nm39j .\n?x1 ns:film.cinematographer.film ns:m.0brs6b .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x1 ns:film.writer.film ns:m.0brs6b .\nFILTER ( ?x0 != ns:m.014x77 ) .\nFILTER ( ?x0 != ns:m.04nm39j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 38
  },
  {
    "questionIdx": 11361,
    "questionWithBrackets": "Did [Jerry Primm] marry [Frances Blog] and influence a film's star, editor, and art director",
    "questionPatternModEntities": "Did M1 marry M2 and influence a film 's star , editor , and art director",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.film_art_director.films_art_directed ?x1 .\n?x1 a ns:film.film .\nFILTER ( ns:m.0zv3wjc != ns:m.0hnznxy ) .\nns:m.0zv3wjc ns:influence.influence_node.influenced ?x0 .\nns:m.0zv3wjc ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hnznxy\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M0 .\nFILTER ( M1 != M2 ) .\nM1 P3 ?x0 .\nM1 P4 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 183622,
    "questionWithBrackets": "What was produced, edited, executive produced, written, and directed by [Elena Andrade]'s sibling",
    "questionPatternModEntities": "What was produced , edited , executive produced , written , and directed by M0 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0wq3zpf .\nFILTER ( ?x1 != ns:m.0wq3zpf )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Undertow Eyes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 185214,
    "questionWithBrackets": "What was written by a company, executive produced by an actor, and edited by [Hemal Kothari]",
    "questionPatternModEntities": "What was written by a company , executive produced by a actor , and edited by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0b3t_8z .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.actor .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P2 M0 .\n?x1 a M1 .\n?x2 a M2\n}",
    "expectedResponse": "Guzaarish",
    "recursionDepth": 38
  },
  {
    "questionIdx": 108575,
    "questionWithBrackets": "Was an actor that was employed by [KIRO-TV] and [Cumulus Media Networks] and was employed by [SportsChannel] [Arthur Blank]",
    "questionPatternModEntities": "Was a actor that was employed by M2 and M3 and was employed by M4 M0",
    "questionTemplate": "Was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and [entity] and was [VP_SIMPLE] by [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03kk81 a ns:film.actor .\nns:m.03kk81 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0335jv .\nns:m.03kk81 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.05s34b .\nns:m.03kk81 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.08wn7x\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 P0 M4 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 25529,
    "questionWithBrackets": "Did [Woody Allen], [Sam Kinison], [Richard Pryor], [Rodney Dangerfield], and [Eddie Murphy] influence a character and influence [Artie Lange]",
    "questionPatternModEntities": "Did M1 , M3 , M4 , M5 , and M6 influence a character and influence M2",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\nns:m.015b67 ns:influence.influence_node.influenced ?x0 .\nns:m.015b67 ns:influence.influence_node.influenced ns:m.01xwqn .\nns:m.01hmk9 ns:influence.influence_node.influenced ?x0 .\nns:m.01hmk9 ns:influence.influence_node.influenced ns:m.01xwqn .\nns:m.02gt7m ns:influence.influence_node.influenced ?x0 .\nns:m.02gt7m ns:influence.influence_node.influenced ns:m.01xwqn .\nns:m.081lh ns:influence.influence_node.influenced ?x0 .\nns:m.081lh ns:influence.influence_node.influenced ns:m.01xwqn .\nns:m.0f7hc ns:influence.influence_node.influenced ?x0 .\nns:m.0f7hc ns:influence.influence_node.influenced ns:m.01xwqn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P0 M2 .\nM3 P0 ?x0 .\nM3 P0 M2 .\nM4 P0 ?x0 .\nM4 P0 M2 .\nM5 P0 ?x0 .\nM5 P0 M2 .\nM6 P0 ?x0 .\nM6 P0 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 203800,
    "questionWithBrackets": "Which film producer influenced [Jeff Dye] and [Redd Foxx] and was influenced by a female actor",
    "questionPatternModEntities": "Which film producer influenced M1 and M2 and was influenced by a female actor",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity] and was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ns:m.01b9db .\n?x0 ns:influence.influence_node.influenced ns:m.04g0785 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 a ns:film.actor .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M4 .\n?x1 a M3\n}",
    "expectedResponse": "Bill Cosby",
    "recursionDepth": 38
  },
  {
    "questionIdx": 120070,
    "questionWithBrackets": "Were [Le lion volatil] and [Elsa la rose] directed by a cinematographer that was influenced by and married [Maksim Shishkin]",
    "questionPatternModEntities": "Were M2 and M3 directed by a cinematographer that was influenced by and married M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that was [VP_SIMPLE] by and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced_by ns:m.0w8j569 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0w8j569 .\nFILTER ( ?x0 != ns:m.0w8j569 ) .\nns:m.0gxb6vt ns:film.film.directed_by ?x0 .\nns:m.0zgmyvc ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 149162,
    "questionWithBrackets": "What did a costume designer direct, [Chad Oman] and [Ned Dowd] executive produce, and [Jerry Bruckheimer Films] produce",
    "questionPatternModEntities": "What did a costume designer direct , M0 and M1 executive produce , and M2 produce",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] , [entity] and [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.04grr41 .\n?x0 ns:film.film.executive_produced_by ns:m.0jwqrl .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.05pw3jg .\n?x1 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 ?x1 .\n?x1 a M3\n}",
    "expectedResponse": "Veronica Guerin",
    "recursionDepth": 38
  },
  {
    "questionIdx": 205426,
    "questionWithBrackets": "Which film was written by [Augustin Daly]'s employer's French employee and written by [Margaret Drabble]",
    "questionPatternModEntities": "Which film was written by M3 's employer 's French employee and written by M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ns:m.01666h .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x2 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.01gyhl\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 M2 .\n?x2 P3 M3\n}",
    "expectedResponse": "Isadora",
    "recursionDepth": 38
  },
  {
    "questionIdx": 58975,
    "questionWithBrackets": "Was [Hum Tere Aashiq Hain] edited by [Lachhmandass], written by a parent of [J\u00falia Camps], and written by [Kamleshwar]",
    "questionPatternModEntities": "Was M1 edited by M3 , written by a parent of M0 , and written by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0j12yzw .\nns:m.05b1lp5 ns:film.film.edited_by ns:m.0jj290q .\nns:m.05b1lp5 ns:film.film.written_by ?x0 .\nns:m.05b1lp5 ns:film.film.written_by ns:m.08v3xp\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 177304,
    "questionWithBrackets": "What was executive produced by [Terry Dougas] and produced by a film producer that a film director influenced",
    "questionPatternModEntities": "What was executive produced by M0 and produced by a film producer that a film director influenced",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] that a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.07zpk77 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:influence.influence_node.influenced_by ?x2 .\n?x2 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 a M1 .\n?x2 a M2\n}",
    "expectedResponse": "The Invention of Lying",
    "recursionDepth": 38
  },
  {
    "questionIdx": 13167,
    "questionWithBrackets": "Did [Life of Brian] star [House of Blues]'s founder and employee and star a film editor's parent",
    "questionPatternModEntities": "Did M2 star M0 's founder and employee and star a film editor 's parent",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0525fd .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0525fd .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.editor .\nns:m.04k2p ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04k2p ns:film.film.starring/ns:film.performance.actor ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1 .\nM2 P3 ?x0 .\nM2 P3 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  }
]