[
  {
    "questionIdx": 214063,
    "questionWithBrackets": "Who did [Evelina E I Suoi Figli] star",
    "questionPatternModEntities": "Who did M1 star",
    "questionTemplate": "Who did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:g.1yxkhhbn3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Pamela Villoresi; Stefania Sandrelli",
    "recursionDepth": 10
  },
  {
    "questionIdx": 84652,
    "questionWithBrackets": "Was [Unfaithful]'s costume designer [Mrs. Meera M. Gehani]",
    "questionPatternModEntities": "Was M1 's costume designer M0",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0hhkf7k ns:film.film_costumer_designer.costume_design_for_film ns:m.048htn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 11
  },
  {
    "questionIdx": 210348,
    "questionWithBrackets": "Which screenwriter did [United Artists] employ",
    "questionPatternModEntities": "Which screenwriter did M1 employ",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.017jv5\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Tom Cruise; Paula Wagner",
    "recursionDepth": 13
  },
  {
    "questionIdx": 157628,
    "questionWithBrackets": "What film producer influenced [Yusuke Nakano]",
    "questionPatternModEntities": "What film producer influenced M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ns:m.04z_lcl\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Frank Frazetta",
    "recursionDepth": 13
  },
  {
    "questionIdx": 195718,
    "questionWithBrackets": "Which cinematographer did [Aardman Animations] employ",
    "questionPatternModEntities": "Which cinematographer did M1 employ",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0fk_w\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "David Sproxton; Nick Park",
    "recursionDepth": 13
  },
  {
    "questionIdx": 136192,
    "questionWithBrackets": "What actor influenced [Ann Scott]",
    "questionPatternModEntities": "What actor influenced M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ns:m.0c8rrt\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Truman Capote",
    "recursionDepth": 13
  },
  {
    "questionIdx": 192645,
    "questionWithBrackets": "Which actor directed [Tharavattamma]",
    "questionPatternModEntities": "Which actor directed M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.director.film ns:m.0gh8wlw\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "P. Bhaskaran",
    "recursionDepth": 13
  },
  {
    "questionIdx": 163713,
    "questionWithBrackets": "What production company did [Columbia Pictures Television] acquire",
    "questionPatternModEntities": "What production company did M1 acquire",
    "questionTemplate": "What [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03shp0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "TriStar Television Inc.",
    "recursionDepth": 13
  },
  {
    "questionIdx": 201514,
    "questionWithBrackets": "Which film director executive produced [Street Fight]",
    "questionPatternModEntities": "Which film director executive produced M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.producer.films_executive_produced ns:m.09dm9y\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Rory Kennedy; Liz Garbus",
    "recursionDepth": 14
  },
  {
    "questionIdx": 215010,
    "questionWithBrackets": "Who did [Ten Days' Wonder]'s costume designer influence",
    "questionPatternModEntities": "Who did M1 's costume designer influence",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0bbwhtz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Nahar The Mask",
    "recursionDepth": 14
  },
  {
    "questionIdx": 216962,
    "questionWithBrackets": "Who edited [I Love Hong Kong 2012]'s sequel",
    "questionPatternModEntities": "Who edited M1 's sequel",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ?x1 .\n?x1 ns:film.film.prequel ns:m.0hr9zl2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Wenders Li; Man-Ho Mok",
    "recursionDepth": 14
  },
  {
    "questionIdx": 217504,
    "questionWithBrackets": "Who founded [Jeremy Aaron Johnson]'s employer",
    "questionPatternModEntities": "Who founded M1 's employer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0br2hmn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Earl Bakken; Palmer Hermundslie",
    "recursionDepth": 14
  },
  {
    "questionIdx": 11393,
    "questionWithBrackets": "Did [Jesus Christ] influence [Eastern Orthodox Church]'s founder",
    "questionPatternModEntities": "Did M1 influence M0 's founder",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02rxj .\nns:m.045m1_ ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 15
  },
  {
    "questionIdx": 4760,
    "questionWithBrackets": "Did [ConnectU]'s founder found [Facebook, Inc.]",
    "questionPatternModEntities": "Did M0 's founder found M1",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02q9bp7 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0hmyfsv\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 15
  },
  {
    "questionIdx": 78397,
    "questionWithBrackets": "Was [Teinosuke Kinugasa] a Japanese screenwriter",
    "questionPatternModEntities": "Was M0 a Japanese screenwriter",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02dfsd a ns:film.writer .\nns:m.02dfsd ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 15
  },
  {
    "questionIdx": 49607,
    "questionWithBrackets": "Was [Catherine Frazier Joy] an Italian film editor",
    "questionPatternModEntities": "Was M0 a Italian film editor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03wrx57 a ns:film.editor .\nns:m.03wrx57 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 15
  },
  {
    "questionIdx": 45439,
    "questionWithBrackets": "Was [Ampawan]'s sibling's sibling [Avi Taga]",
    "questionPatternModEntities": "Was M0 's sibling 's sibling M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0v_m41k .\nFILTER ( ?x0 != ns:m.0v_m41k ) .\nFILTER ( ns:m.0w03f7v != ?x0 ) .\nns:m.0w03f7v ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 15
  },
  {
    "questionIdx": 184069,
    "questionWithBrackets": "What was written by [Beijing Film Academy]'s employee",
    "questionPatternModEntities": "What was written by M0 's employee",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.07c8z8\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0\n}",
    "expectedResponse": "Woman Sesame Oil Maker; Bodyguards and Assassins",
    "recursionDepth": 15
  },
  {
    "questionIdx": 19764,
    "questionWithBrackets": "Did [Steno] direct [Hostel: Part II]'s sequel",
    "questionPatternModEntities": "Did M1 direct M0 's sequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.0c9jj9 .\nns:m.03ccxs0 ns:film.director.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 15
  },
  {
    "questionIdx": 56744,
    "questionWithBrackets": "Was [Gigi]'s costume designer's sibling [Barbara Beaton]",
    "questionPatternModEntities": "Was M0 's costume designer 's sibling M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.05sbv3 .\nFILTER ( ns:m.0wkrj68 != ?x0 ) .\nns:m.0wkrj68 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 15
  },
  {
    "questionIdx": 1272,
    "questionWithBrackets": "Did [Andrew Joseph Clooney]'s child marry [Jos\u00e9 Ferrer]",
    "questionPatternModEntities": "Did M0 's child marry M1",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0j_v487 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0sxqg .\nFILTER ( ?x0 != ns:m.0sxqg )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 15
  },
  {
    "questionIdx": 10038,
    "questionWithBrackets": "Did [I Found Stella Parish]'s director direct [Visions of Eight]",
    "questionPatternModEntities": "Did M0 's director direct M1",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.04mzw_n .\n?x0 ns:film.director.film ns:m.05zrl2k\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 15
  },
  {
    "questionIdx": 77455,
    "questionWithBrackets": "Was [Steve Donia]'s spouse's sibling [Guillermo Santos]",
    "questionPatternModEntities": "Was M0 's spouse 's sibling M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0v1sxkt .\nFILTER ( ?x0 != ns:m.0v1sxkt ) .\nFILTER ( ns:m.0njc7z4 != ?x0 ) .\nns:m.0njc7z4 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 15
  },
  {
    "questionIdx": 81621,
    "questionWithBrackets": "Was [The Man Who Wasn't There]'s writer and editor [Ethan Coen]",
    "questionPatternModEntities": "Was M1 's writer and editor M0",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02kxbwx ns:film.editor.film ns:m.01jzyf .\nns:m.02kxbwx ns:film.writer.film ns:m.01jzyf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 16
  },
  {
    "questionIdx": 68472,
    "questionWithBrackets": "Was [My Blueberry Nights] edited by [Gone with the Bullets]'s art director",
    "questionPatternModEntities": "Was M1 edited by M0 's art director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.0_gzdg9 .\nns:m.0clsl7 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 16
  },
  {
    "questionIdx": 52505,
    "questionWithBrackets": "Was [Diary of a Nymphomaniac]'s Spanish editor [Luis de la Madrid]",
    "questionPatternModEntities": "Was M2 's Spanish editor M0",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0c09t9k ns:film.editor.film ns:m.09rvc6v .\nns:m.0c09t9k ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 16
  },
  {
    "questionIdx": 59076,
    "questionWithBrackets": "Was [Huss-Ashmore] an actor of a screenwriter",
    "questionPatternModEntities": "Was M1 a actor of a screenwriter",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\nns:m.05w5r5j ns:film.actor.film/ns:film.performance.character ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 16
  },
  {
    "questionIdx": 76499,
    "questionWithBrackets": "Was [Simeon Frazier Jr.]'s American sibling [Cherry Boone]",
    "questionPatternModEntities": "Was M1 's American sibling M0",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.0280ttg != ns:m.011cms5h ) .\nns:m.0280ttg ns:people.person.nationality ns:m.09c7w0 .\nns:m.0280ttg ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.011cms5h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 16
  },
  {
    "questionIdx": 195845,
    "questionWithBrackets": "Which cinematographer distributed a film",
    "questionPatternModEntities": "Which cinematographer distributed a film",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ?x1 .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 a M1\n}",
    "expectedResponse": "Lenfilm; Screen Gems",
    "recursionDepth": 16
  },
  {
    "questionIdx": 123763,
    "questionWithBrackets": "Were [Ro.Go.Pa.G.] and [Naya Zamana] edited by [Dharamvir]",
    "questionPatternModEntities": "Were M0 and M2 edited by M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02qkz_v ns:film.film.edited_by ns:m.0jvtcmw .\nns:m.03gwgp0 ns:film.film.edited_by ns:m.0jvtcmw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM2 P0 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 16
  },
  {
    "questionIdx": 55732,
    "questionWithBrackets": "Was [Frontier(s)] distributed by [Fox Animation Studios]'s parent",
    "questionPatternModEntities": "Was M1 distributed by M0 's parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.05ws8z .\nns:m.03c5vfj ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 16
  },
  {
    "questionIdx": 66629,
    "questionWithBrackets": "Was [Massimo Boldi] [Make-up man]'s Italian actor",
    "questionPatternModEntities": "Was M0 M2 's Italian actor",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nns:m.05zvrwt ns:film.actor.film/ns:film.performance.character ns:m.010qzgt5 .\nns:m.05zvrwt ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 16
  },
  {
    "questionIdx": 209958,
    "questionWithBrackets": "Which production company did [Cheer Squad Sleepover]'s director found",
    "questionPatternModEntities": "Which production company did M1 's director found",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.director.film ns:m.0r4yb3w\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Girlfriends Films",
    "recursionDepth": 17
  },
  {
    "questionIdx": 202871,
    "questionWithBrackets": "Which film editor married [Ariel Capital Management]'s employee",
    "questionPatternModEntities": "Which film editor married M1 's employee",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04gbx6v .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "George Lucas",
    "recursionDepth": 17
  },
  {
    "questionIdx": 157362,
    "questionWithBrackets": "What film producer did [Melinda and Melinda]'s director marry",
    "questionPatternModEntities": "What film producer did M1 's director marry",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.02lwyw .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Diane Keaton",
    "recursionDepth": 17
  },
  {
    "questionIdx": 136027,
    "questionWithBrackets": "What actor did [Hum Dil De Chuke Sanam]'s writer employ",
    "questionPatternModEntities": "What actor did M1 's writer employ",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.writer.film ns:m.05v5_z\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Sonam Kapoor",
    "recursionDepth": 17
  },
  {
    "questionIdx": 164221,
    "questionWithBrackets": "What screenwriter married [Irma Vep]'s cinematographer",
    "questionPatternModEntities": "What screenwriter married M1 's cinematographer",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.01w4s2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Nathalie Boutefeu",
    "recursionDepth": 17
  },
  {
    "questionIdx": 156437,
    "questionWithBrackets": "What film editor did [Boxcar Bertha]'s director influence",
    "questionPatternModEntities": "What film editor did M1 's director influence",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.director.film ns:m.062rrj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Richard Linklater; Peter Sollett",
    "recursionDepth": 17
  },
  {
    "questionIdx": 197242,
    "questionWithBrackets": "Which costume designer did [A Hard Day for Archie]'s director marry",
    "questionPatternModEntities": "Which costume designer did M1 's director marry",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.010sjp68 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Tracy Tynan",
    "recursionDepth": 17
  },
  {
    "questionIdx": 161632,
    "questionWithBrackets": "What person did [Shivanaga] and [Trimurtulu] star",
    "questionPatternModEntities": "What person did M1 and M2 star",
    "questionTemplate": "What [NP_SIMPLE] did [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.012hrbr_ .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0hznpv8\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Arjun Sarja",
    "recursionDepth": 17
  },
  {
    "questionIdx": 148979,
    "questionWithBrackets": "What did a cinematographer's child found",
    "questionPatternModEntities": "What did a cinematographer 's child found",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0\n}",
    "expectedResponse": "Simex-Iwerks; Jaye Bird Productions",
    "recursionDepth": 17
  },
  {
    "questionIdx": 155272,
    "questionWithBrackets": "What film director did [Janet Park]'s sibling influence",
    "questionPatternModEntities": "What film director did M1 's sibling influence",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0j4846m .\nFILTER ( ?x1 != ns:m.0j4846m )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Hayao Miyazaki",
    "recursionDepth": 17
  },
  {
    "questionIdx": 57586,
    "questionWithBrackets": "Was [Gyandev Agnihotri] a writer of [Creepshow 2]'s sequel",
    "questionPatternModEntities": "Was M1 a writer of M0 's sequel",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.06h9zj .\nns:m.0jjb1f6 ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 17
  },
  {
    "questionIdx": 157607,
    "questionWithBrackets": "What film producer influenced [Heal the World Foundation]'s founder",
    "questionPatternModEntities": "What film producer influenced M1 's founder",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.05477_q\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Charlie Chaplin; Walt Disney",
    "recursionDepth": 17
  },
  {
    "questionIdx": 137204,
    "questionWithBrackets": "What art director did [Otilie Volbracht]'s child influence",
    "questionPatternModEntities": "What art director did M1 's child influence",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0ksq6w0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Alfred Hitchcock",
    "recursionDepth": 17
  },
  {
    "questionIdx": 155354,
    "questionWithBrackets": "What film director edited [Nombarathi Poovu] and [Dhanam]",
    "questionPatternModEntities": "What film director edited M1 and M2",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.editor.film ns:m.0fpgl7c .\n?x0 ns:film.editor.film ns:m.0k2h4lw\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "B. Lenin",
    "recursionDepth": 17
  },
  {
    "questionIdx": 156602,
    "questionWithBrackets": "What film editor influenced [Casper Lee]'s parent",
    "questionPatternModEntities": "What film editor influenced M1 's parent",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0lndh2c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Bill Murray",
    "recursionDepth": 17
  },
  {
    "questionIdx": 161691,
    "questionWithBrackets": "What person edited [The Endless Summer II]'s prequel",
    "questionPatternModEntities": "What person edited M1 's prequel",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ?x1 .\n?x1 ns:film.film.sequel ns:m.02vklgp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Bruce Brown",
    "recursionDepth": 17
  },
  {
    "questionIdx": 203520,
    "questionWithBrackets": "Which film producer did [Belmont Industries]'s employee marry",
    "questionPatternModEntities": "Which film producer did M1 's employee marry",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04c_h7d .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Ellen Barkin; Claudia Cohen",
    "recursionDepth": 17
  }
]