[
  {
    "questionIdx": 190330,
    "questionWithBrackets": "Which Italian costume designer edited [Melissa P.]",
    "questionPatternModEntities": "Which Italian costume designer edited M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:film.editor.film ns:m.0h3w5rl .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Walter Fasano",
    "recursionDepth": 18
  },
  {
    "questionIdx": 98508,
    "questionWithBrackets": "Was a film editor's employer's employee [Michael Wildman]",
    "questionPatternModEntities": "Was a film editor 's employer 's employee M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 a ns:film.editor .\nns:m.0b7bbn ns:people.person.employment_history/ns:business.employment_tenure.company ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 92536,
    "questionWithBrackets": "Was a cinematographer and producer of [Vacationland] [Todd Verow]",
    "questionPatternModEntities": "Was a cinematographer and producer of M1 M0",
    "questionTemplate": "Was a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0kss7z ns:film.cinematographer.film ns:m.0fy7l8 .\nns:m.0kss7z ns:film.producer.film|ns:film.production_company.films ns:m.0fy7l8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 18
  },
  {
    "questionIdx": 61767,
    "questionWithBrackets": "Was [John M. Nickolaus] an art director's parent's parent",
    "questionPatternModEntities": "Was M1 a art director 's parent 's parent",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.film_art_director .\nns:m.0jvc50h ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 18
  },
  {
    "questionIdx": 132643,
    "questionWithBrackets": "What French actor did [Jorge Luis Borges] influence",
    "questionPatternModEntities": "What French actor did M1 influence",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ns:m.040db .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Julio Cort\u00e1zar",
    "recursionDepth": 18
  },
  {
    "questionIdx": 214871,
    "questionWithBrackets": "Who did [Rush Communications]'s founder's sibling marry",
    "questionPatternModEntities": "Who did M1 's founder 's sibling marry",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0dq18c .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Justine Simmons; Valerie Vaughn",
    "recursionDepth": 18
  },
  {
    "questionIdx": 131598,
    "questionWithBrackets": "What Canadian film director produced [Voyage Of Terror]",
    "questionPatternModEntities": "What Canadian film director produced M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.04_62lw .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "James Shavick",
    "recursionDepth": 18
  },
  {
    "questionIdx": 189432,
    "questionWithBrackets": "Which French cinematographer did [Poup\u00e9e Andriot] marry",
    "questionPatternModEntities": "Which French cinematographer did M2 marry",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hp86gd .\nFILTER ( ?x0 != ns:m.0hp86gd )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Lucien N. Andriot",
    "recursionDepth": 18
  },
  {
    "questionIdx": 190341,
    "questionWithBrackets": "Which Italian costume designer played [Vincenzo Brown]",
    "questionPatternModEntities": "Which Italian costume designer played M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h2y6wy .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Vincent Gallo",
    "recursionDepth": 18
  },
  {
    "questionIdx": 197784,
    "questionWithBrackets": "Which costume designer was a Spanish cinematographer",
    "questionPatternModEntities": "Which costume designer was a Spanish cinematographer",
    "questionTemplate": "Which [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "David Mu\u00f1oz",
    "recursionDepth": 18
  },
  {
    "questionIdx": 135138,
    "questionWithBrackets": "What Spanish art director played [Zaldu]",
    "questionPatternModEntities": "What Spanish art director played M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0x1qz30 .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Gonzalo Gonzalo",
    "recursionDepth": 18
  },
  {
    "questionIdx": 188743,
    "questionWithBrackets": "Which Chinese film director married [Wen-chi Po]",
    "questionPatternModEntities": "Which Chinese film director married M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0yjjx52 .\nFILTER ( ?x0 != ns:m.0yjjx52 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Pao-Shu Kao",
    "recursionDepth": 18
  },
  {
    "questionIdx": 188762,
    "questionWithBrackets": "Which Chinese film editor did [Esther Kwan] marry",
    "questionPatternModEntities": "Which Chinese film editor did M2 marry",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.03hpbx_ .\nFILTER ( ?x0 != ns:m.03hpbx_ )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Nick Cheung",
    "recursionDepth": 18
  },
  {
    "questionIdx": 219149,
    "questionWithBrackets": "Who influenced a Mexican cinematographer",
    "questionPatternModEntities": "Who influenced a Mexican cinematographer",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 a ns:film.cinematographer .\n?x1 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 a M1\n}",
    "expectedResponse": "Fernand Braudel; Gilles Deleuze",
    "recursionDepth": 18
  },
  {
    "questionIdx": 191396,
    "questionWithBrackets": "Which Mexican film director did [El Chanfle] star",
    "questionPatternModEntities": "Which Mexican film director did M2 star",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.04cwg6d .\n?x0 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Chespirito",
    "recursionDepth": 18
  },
  {
    "questionIdx": 196627,
    "questionWithBrackets": "Which cinematographer was influenced by [Hans Feldman] and [Fritz Lang]",
    "questionPatternModEntities": "Which cinematographer was influenced by M1 and M2",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced_by ns:m.032md .\n?x0 ns:influence.influence_node.influenced_by ns:m.0bx726k\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Brad Mays",
    "recursionDepth": 18
  },
  {
    "questionIdx": 142959,
    "questionWithBrackets": "What did [Dial \"P\" for Pink]'s prequel's producer found",
    "questionPatternModEntities": "What did M0 's prequel 's producer found",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 ns:film.film.sequel ns:m.03nsdgn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0\n}",
    "expectedResponse": "DePatie-Freleng Enterprises; Marvel Productions",
    "recursionDepth": 18
  },
  {
    "questionIdx": 142725,
    "questionWithBrackets": "What did [Comedy's Dirtiest Dozen]'s writer's employer acquire",
    "questionPatternModEntities": "What did M0 's writer 's employer acquire",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 ns:film.writer.film ns:m.0dszfz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0\n}",
    "expectedResponse": "World Championship Wrestling",
    "recursionDepth": 18
  },
  {
    "questionIdx": 214169,
    "questionWithBrackets": "Who did [Gingko Bed]'s prequel's executive producer marry",
    "questionPatternModEntities": "Who did M1 's prequel 's executive producer marry",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.films_executive_produced ?x2 .\n?x2 ns:film.film.sequel ns:g.1q2xhkksh .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Park Seong-mi",
    "recursionDepth": 18
  },
  {
    "questionIdx": 133945,
    "questionWithBrackets": "What Italian film producer wrote [Auguri e figli maschi!]",
    "questionPatternModEntities": "What Italian film producer wrote M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.writer.film ns:m.06znb1x .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Furio Scarpelli",
    "recursionDepth": 18
  },
  {
    "questionIdx": 142800,
    "questionWithBrackets": "What did [Cyclops]'s spouse's actor produce",
    "questionPatternModEntities": "What did M0 's spouse 's actor produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0kl3p .\nFILTER ( ?x2 != ns:m.0kl3p )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nFILTER ( ?x2 != M0 )\n}",
    "expectedResponse": "Bringing Up Bobby",
    "recursionDepth": 18
  },
  {
    "questionIdx": 12837,
    "questionWithBrackets": "Did [Lark Song]'s sibling marry [Taxi 2]'s writer",
    "questionPatternModEntities": "Did M0 's sibling marry M1 's writer",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0hc97_m .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.writer.film ns:m.0489v9 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0hc97_m )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 179841,
    "questionWithBrackets": "What was founded by [Making Mr. Right]'s costume designer's spouse",
    "questionPatternModEntities": "What was founded by M0 's costume designer 's spouse",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.film_costumer_designer.costume_design_for_film ns:m.043k3f .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Luaka Bop; Todo Mundo",
    "recursionDepth": 19
  },
  {
    "questionIdx": 84230,
    "questionWithBrackets": "Was [Trish Reeves] a Dutch film director's spouse",
    "questionPatternModEntities": "Was M2 a Dutch film director 's spouse",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.nationality ns:m.059j2 .\nFILTER ( ns:m.0j69bw3 != ?x0 ) .\nns:m.0j69bw3 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 214250,
    "questionWithBrackets": "Who did [His Ward's Love]'s American director influence",
    "questionPatternModEntities": "Who did M2 's American director influence",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.director.film ns:m.012nwt3k .\n?x1 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Alfred Hitchcock; Ingmar Bergman",
    "recursionDepth": 19
  },
  {
    "questionIdx": 214158,
    "questionWithBrackets": "Who did [George Rogers Clark]'s child and sibling marry",
    "questionPatternModEntities": "Who did M1 's child and sibling marry",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.031k56 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.031k56 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.031k56 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Harriet Radford; Julia Hancock",
    "recursionDepth": 19
  },
  {
    "questionIdx": 86494,
    "questionWithBrackets": "Was [Wes Craven] [Jason X]'s sequel's prequel's executive producer",
    "questionPatternModEntities": "Was M1 M0 's sequel 's prequel 's executive producer",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 ns:film.film.prequel ns:m.06_nv6 .\nns:m.013zyw ns:film.producer.films_executive_produced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 49004,
    "questionWithBrackets": "Was [Byron Stripling] a male person's actor",
    "questionPatternModEntities": "Was M2 a male person 's actor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.03xny1w ns:film.actor.film/ns:film.performance.character ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 35078,
    "questionWithBrackets": "Did a film producer's employee executive produce [Ratatouille]",
    "questionPatternModEntities": "Did a film producer 's employee executive produce M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.03x7hd .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 55417,
    "questionWithBrackets": "Was [Fox Searchlight Pictures] a film producer that distributed [Raavan]",
    "questionPatternModEntities": "Was M0 a film producer that distributed M2",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.025jfl a ns:film.producer .\nns:m.025jfl ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04y5pk6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 220599,
    "questionWithBrackets": "Who married [Malcolm]'s male writer",
    "questionPatternModEntities": "Who married M1 's male writer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.writer.film ns:m.07kg4l .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Nadia Tass",
    "recursionDepth": 19
  },
  {
    "questionIdx": 142775,
    "questionWithBrackets": "What did [Crank Balls]'s cinematographer and director direct",
    "questionPatternModEntities": "What did M0 's cinematographer and director direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.04p76n2 .\n?x1 ns:film.director.film ns:m.04p76n2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Crank Balls; Fatal Vittles",
    "recursionDepth": 19
  },
  {
    "questionIdx": 99023,
    "questionWithBrackets": "Was a film producer acquired by [Boogie Town]'s producer",
    "questionPatternModEntities": "Was a film producer acquired by M1 's producer",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.05b2wxl\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 74189,
    "questionWithBrackets": "Was [Ricki Rasmussen] [Mrs. Miniver]'s sequel's costume designer's child",
    "questionPatternModEntities": "Was M1 M0 's sequel 's costume designer 's child",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ?x1 .\n?x1 ns:film.film.prequel ns:m.0cq8nx .\nns:m.0_y_5p8 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 48406,
    "questionWithBrackets": "Was [Boundaries: The End] directed by a company's founder",
    "questionPatternModEntities": "Was M1 directed by a company 's founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 a ns:business.employer .\nns:m.0_qsy31 ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 7643,
    "questionWithBrackets": "Did [Franchise Pictures]'s founder's spouse play [Christina D'Amelio]",
    "questionPatternModEntities": "Did M1 's founder 's spouse play M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0gzq6sv .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.03h5pth .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 147355,
    "questionWithBrackets": "What did [The House Under the Water]'s female editor edit",
    "questionPatternModEntities": "What did M1 's female editor edit",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.editor.film ns:m.0jmzjwb .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "The House Under the Water; Tehran Without Permission",
    "recursionDepth": 19
  },
  {
    "questionIdx": 100263,
    "questionWithBrackets": "Was a film's art director and costume designer [Robert Holleyman]",
    "questionPatternModEntities": "Was a film 's art director and costume designer M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.07fyvk ns:film.film_art_director.films_art_directed ?x0 .\nns:m.07fyvk ns:film.film_costumer_designer.costume_design_for_film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 20490,
    "questionWithBrackets": "Did [Teddy Winters] marry [Two a Penny]'s sequel's editor",
    "questionPatternModEntities": "Did M1 marry M0 's sequel 's editor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x1 ns:film.film.prequel ns:m.05c0yx5 .\nFILTER ( ns:m.0hn5sxd != ?x0 ) .\nns:m.0hn5sxd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 103777,
    "questionWithBrackets": "Was a person's spouse and parent [Roger Tatley]",
    "questionPatternModEntities": "Was a person 's spouse and parent M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\nFILTER ( ns:m.02x18nb != ?x0 ) .\nns:m.02x18nb ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.02x18nb ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 147996,
    "questionWithBrackets": "What did [Ya'akov Gross]'s sibling and parent write",
    "questionPatternModEntities": "What did M0 's sibling and parent write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0r4hs34 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0r4hs34 .\nFILTER ( ?x1 != ns:m.0r4hs34 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Joseph the Dreamer",
    "recursionDepth": 19
  },
  {
    "questionIdx": 203326,
    "questionWithBrackets": "Which film editor was employed by [Yung Henry Yu]'s country of nationality",
    "questionPatternModEntities": "Which film editor was employed by M1 's country of nationality",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ns:g.1203n4l67\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Mark Aitchison Young",
    "recursionDepth": 19
  }
]