[
  {
    "questionIdx": 229759,
    "questionWithBrackets": "Who was a female Chinese cinematographer that [Grave Goods] was executive produced by and produced by",
    "questionPatternModEntities": "Who was a female Chinese cinematographer that M2 was executive produced by and produced by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ns:m.0w1tctl .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0w1tctl .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M2 .\n?x0 P3 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Leslie Tai",
    "recursionDepth": 40
  },
  {
    "questionIdx": 235548,
    "questionWithBrackets": "Who was influenced by [Black Book]'s Dutch writer, influenced by [David Cronenberg], and influenced by [David Lynch]",
    "questionPatternModEntities": "Who was influenced by M3 's Dutch writer , influenced by M1 , and influenced by M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.026dx .\n?x0 ns:influence.influence_node.influenced_by ns:m.026fd .\n?x1 ns:film.writer.film ns:m.0b40y4 .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M4\n}",
    "expectedResponse": "Takashi Miike",
    "recursionDepth": 40
  },
  {
    "questionIdx": 119702,
    "questionWithBrackets": "Were [Knocked Up] and [The 40-Year-Old Virgin] produced, directed, and written by an actor that influenced [Rip Taylor]",
    "questionPatternModEntities": "Were M2 and M3 produced , directed , and written by a actor that influenced M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ns:m.06tgh0 .\nns:m.06fpsx ns:film.film.directed_by ?x0 .\nns:m.06fpsx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.06fpsx ns:film.film.written_by ?x0 .\nns:m.0bvn25 ns:film.film.directed_by ?x0 .\nns:m.0bvn25 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bvn25 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P1 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 155337,
    "questionWithBrackets": "What film director did an art director marry, [Anthony Burgess] and [H. P. Lovecraft] influence, and [Christiane Kubrick] marry",
    "questionPatternModEntities": "What film director did a art director marry , M1 and M2 influence , and M3 marry",
    "questionTemplate": "What [NP_SIMPLE] did a [NP_SIMPLE] [VP_SIMPLE] , [entity] and [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ns:m.03j0d .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d4jl .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.09385j .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.09385j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x1 a M4 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Stanley Kubrick",
    "recursionDepth": 40
  },
  {
    "questionIdx": 158988,
    "questionWithBrackets": "What film was executive produced by [Marcy Garriott] and [Mark Duplass] and executive produced by [The Capsule]'s costume designer and director",
    "questionPatternModEntities": "What film was executive produced by M1 and M2 and executive produced by M3 's costume designer and director",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.06zmyx8 .\n?x0 ns:film.film.executive_produced_by ns:m.0gblspx .\n?x1 ns:film.director.film ns:m.0pxbqrn .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0pxbqrn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M3\n}",
    "expectedResponse": "Lovers of Hate",
    "recursionDepth": 40
  },
  {
    "questionIdx": 69076,
    "questionWithBrackets": "Was [New York, I Love You] directed by [Jos\u00e9 Padilha], directed by [Salaam Baalak Trust]'s female founder, and produced by [\u00c1lex de la Iglesia]",
    "questionPatternModEntities": "Was M2 directed by M4 , directed by M0 's female founder , and produced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.04lf_5q .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.02z3r8t ns:film.film.directed_by ?x0 .\nns:m.02z3r8t ns:film.film.directed_by ns:m.0jvz9g .\nns:m.02z3r8t ns:film.film.produced_by|ns:film.film.production_companies ns:m.097kqh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 M3 .\nM2 P3 ?x0 .\nM2 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 19640,
    "questionWithBrackets": "Did [Stanford University] employ a female person and employ a founder and employee of [Infinera]",
    "questionPatternModEntities": "Did M3 employ a female person and employ a founder and employee of M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.02h5bdm .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02h5bdm .\nns:m.06pwq ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.06pwq ns:business.employer.employees/ns:business.employment_tenure.person ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M2 .\nM3 P3 ?x0 .\nM3 P3 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 1732,
    "questionWithBrackets": "Did [Arnon Milchan] produce [Halloween H20: 20 Years Later], executive produce [The Butler], and executive produce [Scary Movie 4]'s prequel's prequel",
    "questionPatternModEntities": "Did M1 produce M3 , executive produce M2 , and executive produce M0 's prequel 's prequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 ns:film.film.sequel ns:m.07h9gp .\nns:m.04pqqb ns:film.producer.films_executive_produced ?x0 .\nns:m.04pqqb ns:film.producer.films_executive_produced ns:m.0lkvn87 .\nns:m.04pqqb ns:film.producer.film|ns:film.production_company.films ns:m.03tb_8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 72785,
    "questionWithBrackets": "Was [Promises Written in Water] written by, produced by, and executive produced by a cinematographer and costume designer of a film",
    "questionPatternModEntities": "Was M1 written by , produced by , and executive produced by a cinematographer and costume designer of a film",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ?x1 .\n?x1 a ns:film.film .\nns:m.0bh9qf1 ns:film.film.executive_produced_by ?x0 .\nns:m.0bh9qf1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bh9qf1 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 37285,
    "questionWithBrackets": "Did a male person's parent found a film producer and found [Works Progress Administration]'s child",
    "questionPatternModEntities": "Did a male person 's parent found a film producer and found M0 's child",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ?x2 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0fh58 .\n?x2 a ns:film.producer .\n?x3 a ns:people.person .\n?x3 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 ?x3 .\n?x1 P2 M0 .\n?x2 a M1 .\n?x3 P3 M3 .\n?x3 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 177374,
    "questionWithBrackets": "What was executive produced by [The Capsule]'s costume designer, director, and writer and executive produced by [Jay Duplass] and [Marcy Garriott]",
    "questionPatternModEntities": "What was executive produced by M2 's costume designer , director , and writer and executive produced by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.047q6x6 .\n?x0 ns:film.film.executive_produced_by ns:m.0gblspx .\n?x1 ns:film.director.film ns:m.0pxbqrn .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0pxbqrn .\n?x1 ns:film.writer.film ns:m.0pxbqrn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P1 M2 .\n?x1 P2 M2 .\n?x1 P3 M2\n}",
    "expectedResponse": "Lovers of Hate",
    "recursionDepth": 41
  },
  {
    "questionIdx": 187752,
    "questionWithBrackets": "Which British female film director was employed by [MTV] and was employed by a production company",
    "questionPatternModEntities": "Which British female film director was employed by M1 and was employed by a production company",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04rqd .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x1 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0 .\n?x1 a M4\n}",
    "expectedResponse": "Alexandra Billington",
    "recursionDepth": 41
  },
  {
    "questionIdx": 55716,
    "questionWithBrackets": "Was [From Vegas to Macau] executive produced by [Mr. & Mrs. Gambler]'s writer, executive producer, and producer and produced by [Liu Jian De]'s parent",
    "questionPatternModEntities": "Was M2 executive produced by M0 's writer , executive producer , and producer and produced by M1 's parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.0jsn8d3 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0jsn8d3 .\n?x0 ns:film.writer.film ns:m.0jsn8d3 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0ws8m5v .\nns:m.0wfrfnv ns:film.film.executive_produced_by ?x0 .\nns:m.0wfrfnv ns:film.film.produced_by|ns:film.film.production_companies ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\n?x1 P3 M1 .\nM2 P4 ?x0 .\nM2 P5 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 184965,
    "questionWithBrackets": "What was written by [Tommy Karlsson], directed by [Robert P. Olsson], and executive produced by [Kammaren]'s Swedish cinematographer",
    "questionPatternModEntities": "What was written by M0 , directed by M1 , and executive produced by M3 's Swedish cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.026476g .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ns:m.027d53w .\n?x1 ns:film.cinematographer.film ns:m.0kv9g1 .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 M1 .\n?x1 P3 M2 .\n?x1 P4 M3\n}",
    "expectedResponse": "Fyren",
    "recursionDepth": 41
  },
  {
    "questionIdx": 179275,
    "questionWithBrackets": "What was executive produced, written, produced, and edited by a screenwriter that [Gita Pullapilly] married",
    "questionPatternModEntities": "What was executive produced , written , produced , and edited by a screenwriter that M1 married",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bbyq2b .\nFILTER ( ?x1 != ns:m.0bbyq2b )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 M1 .\n?x1 a M0 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Beneath the Harvest Sky",
    "recursionDepth": 41
  },
  {
    "questionIdx": 150902,
    "questionWithBrackets": "What did a spouse of an executive producer of [Harve Karbo] and [Romance & Cigarettes] edit and [Mira Nair] and [Jiang Wen] direct",
    "questionPatternModEntities": "What did a spouse of a executive producer of M2 and M3 edit and M0 and M1 direct",
    "questionTemplate": "What did a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.042rnl .\n?x0 ns:film.film.directed_by ns:m.0kvsb .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.producer.films_executive_produced ns:m.06xqr4 .\n?x2 ns:film.producer.films_executive_produced ns:m.0hzbf4k .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 P2 ?x2 .\n?x2 P3 M2 .\n?x2 P3 M3 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "New York, I Love You",
    "recursionDepth": 41
  },
  {
    "questionIdx": 145131,
    "questionWithBrackets": "What did [Martina Gusman]'s spouse edit, direct, produce, write, and executive produce",
    "questionPatternModEntities": "What did M0 's spouse edit , direct , produce , write , and executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04lz8hk .\nFILTER ( ?x1 != ns:m.04lz8hk )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "White Elephant",
    "recursionDepth": 41
  },
  {
    "questionIdx": 56137,
    "questionWithBrackets": "Was [Garret Schuelke] influenced by [Carl Sandburg], influenced by [Contempt]'s German star, and influenced by [Vincent van Gogh]",
    "questionPatternModEntities": "Was M2 influenced by M3 , influenced by M1 's German star , and influenced by M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.046t_0 .\n?x0 ns:people.person.nationality ns:m.0345h .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x0 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ns:m.07_m2 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ns:m.0b281\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 85265,
    "questionWithBrackets": "Was [Viagem na Chuva] produced, executive produced, edited, written, and directed by an art director of [Goat Story 2]",
    "questionPatternModEntities": "Was M1 produced , executive produced , edited , written , and directed by a art director of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.0nbtt_1 .\nns:m.011p1tds ns:film.film.directed_by ?x0 .\nns:m.011p1tds ns:film.film.edited_by ?x0 .\nns:m.011p1tds ns:film.film.executive_produced_by ?x0 .\nns:m.011p1tds ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.011p1tds ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 67578,
    "questionWithBrackets": "Was [Miffy the Movie] written by [Fine Trossel], edited by a Dutch film director, and executive produced by [Moez Kamoun]",
    "questionPatternModEntities": "Was M2 written by M4 , edited by a Dutch film director , and executive produced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.nationality ns:m.059j2 .\nns:m.01012b1c ns:film.film.edited_by ?x0 .\nns:m.01012b1c ns:film.film.executive_produced_by ns:m.0fpq3jz .\nns:m.01012b1c ns:film.film.written_by ns:m.010q1jjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 M3 .\nM2 P2 M4 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 163964,
    "questionWithBrackets": "What production company whose employee married [Nicole Kidman] was founded by [Mary Pickford] and founded by [Sydney Chaplin]'s sibling",
    "questionPatternModEntities": "What production company whose employee married M3 was founded by M1 and founded by M2 's sibling",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x0 ns:organization.organization.founders ns:m.04rfq .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05dbf .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.04_lr8 .\nFILTER ( ?x1 != ns:m.05dbf ) .\nFILTER ( ?x2 != ns:m.04_lr8 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x2 P3 M3 .\nFILTER ( ?x1 != M2 ) .\nFILTER ( ?x2 != M3 )\n}",
    "expectedResponse": "United Artists",
    "recursionDepth": 41
  },
  {
    "questionIdx": 214576,
    "questionWithBrackets": "Who did [Mark Ames] influence and a film's director, star, cinematographer, and writer influence",
    "questionPatternModEntities": "Who did M1 influence and a film 's director , star , cinematographer , and writer influence",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.06r7jt .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x1 ns:film.director.film ?x2 .\n?x1 ns:film.writer.film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x1 P4 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 41
  },
  {
    "questionIdx": 118586,
    "questionWithBrackets": "Were [It's Not About the Shawerma] and [A Man, A Woman, And A Killer] produced by a cinematographer that [Lockout] was written by and was executive produced by",
    "questionPatternModEntities": "Were M2 and M3 produced by a cinematographer that M1 was written by and was executive produced by",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.producer.films_executive_produced ns:m.0gjd79j .\n?x0 ns:film.writer.film ns:m.0gjd79j .\nns:m.0gkscq5 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zztylq ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 117974,
    "questionWithBrackets": "Were [Hollywood Movie], [The Letter], [Bride of the Regiment], [When Were You Born], and [Dark Shadows] produced by a person's employer's child and parent",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 produced by a person 's employer 's child and parent",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:people.person .\nns:m.0173wl ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.02pzpbr ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.09g7vfw ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0cmd1vx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0rh7r4v ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M0 .\nM1 P3 ?x0 .\nM2 P3 ?x0 .\nM3 P3 ?x0 .\nM4 P3 ?x0 .\nM5 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 87310,
    "questionWithBrackets": "Was [Xiaoxi Xu] a Chinese person that [Grave Goods] was written by, executive produced by, and edited by",
    "questionPatternModEntities": "Was M0 a Chinese person that M2 was written by , executive produced by , and edited by",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.011c3pm0 a ns:people.person .\nns:m.011c3pm0 ns:film.editor.film ns:m.0w1tctl .\nns:m.011c3pm0 ns:film.producer.films_executive_produced ns:m.0w1tctl .\nns:m.011c3pm0 ns:film.writer.film ns:m.0w1tctl .\nns:m.011c3pm0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M2 .\nM0 P2 M2 .\nM0 P3 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 121216,
    "questionWithBrackets": "Were [Mimic 2] and [Roadflower] executive produced by [Harvey Weinstein] and produced by [Marvel Television]'s parent's employee and founder",
    "questionPatternModEntities": "Were M1 and M3 executive produced by M2 and produced by M0 's parent 's employee and founder",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0jwx5s8 .\nns:m.026gfr1 ns:film.film.executive_produced_by ns:m.05hj_k .\nns:m.026gfr1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.03gvy8n ns:film.film.executive_produced_by ns:m.05hj_k .\nns:m.03gvy8n ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0 .\nM3 P3 M2 .\nM3 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 41
  },
  {
    "questionIdx": 142850,
    "questionWithBrackets": "What did [Daniele Mazzocca] executive produce, [Jacopo Quadri] edit, and [The Smile of the Leader]'s editor and writer executive produce",
    "questionPatternModEntities": "What did M0 executive produce , M1 edit , and M2 's editor and writer executive produce",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0k7ch2 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0ndbwd8 .\n?x1 ns:film.editor.film ns:m.010sk2q2 .\n?x1 ns:film.writer.film ns:m.010sk2q2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 P2 M2 .\n?x1 P3 M2\n}",
    "expectedResponse": "BirdWatchers",
    "recursionDepth": 41
  },
  {
    "questionIdx": 48686,
    "questionWithBrackets": "Was [Brutal Relax] directed by a film producer and directed by a costume designer, art director, and editor of [Fist Of Jesus]",
    "questionPatternModEntities": "Was M2 directed by a film producer and directed by a costume designer , art director , and editor of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.010s0v9j .\n?x0 ns:film.film_art_director.films_art_directed ns:m.010s0v9j .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.010s0v9j .\n?x1 a ns:film.producer .\nns:m.0hpfc9c ns:film.film.directed_by ?x0 .\nns:m.0hpfc9c ns:film.film.directed_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\n?x1 a M1 .\nM2 P3 ?x0 .\nM2 P3 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 41
  },
  {
    "questionIdx": 175597,
    "questionWithBrackets": "What was edited, executive produced, and written by a Chinese art director that produced [Hot Summer Days]",
    "questionPatternModEntities": "What was edited , executive produced , and written by a Chinese art director that produced M2",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.film_art_director .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0c00qsf .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\n?x1 P4 M2 .\n?x1 a M0\n}",
    "expectedResponse": "The Midnight After",
    "recursionDepth": 41
  }
]