[
  {
    "questionIdx": 157431,
    "questionWithBrackets": "What film producer did a male employee of [The Walt Disney Company] found",
    "questionPatternModEntities": "What film producer did a male employee of M1 found",
    "questionTemplate": "What [NP_SIMPLE] did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.09b3v .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Walt Disney Animation Studios",
    "recursionDepth": 24
  },
  {
    "questionIdx": 22668,
    "questionWithBrackets": "Did [The Return of Casanova]'s executive producer's French spouse marry [Pierre Barret]",
    "questionPatternModEntities": "Did M2 's executive producer 's French spouse marry M1",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0f8l9c .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hhpx_4 .\n?x1 ns:film.producer.films_executive_produced ns:m.07kdsz2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0hhpx_4 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 217696,
    "questionWithBrackets": "Who founded [Walt Disney Animation Studios] and founded a production company",
    "questionPatternModEntities": "Who founded M1 and founded a production company",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.04rcl7 .\n?x1 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Roy O. Disney; Walt Disney",
    "recursionDepth": 24
  },
  {
    "questionIdx": 88855,
    "questionWithBrackets": "Was a Chinese film editor that produced [Shadow Life] [Cao Fei]",
    "questionPatternModEntities": "Was a Chinese film editor that produced M3 M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0jqzdn3 a ns:film.editor .\nns:m.0jqzdn3 ns:film.producer.film|ns:film.production_company.films ns:m.0jqzdmv .\nns:m.0jqzdn3 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 173430,
    "questionWithBrackets": "What was edited by [It's Such a Beautiful Day]'s prequel's star and cinematographer",
    "questionPatternModEntities": "What was edited by M0 's prequel 's star and cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x2 ns:film.film.sequel ns:m.0j8f48q\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 P3 M0\n}",
    "expectedResponse": "It's Such a Beautiful Day; Ah, L'Amour",
    "recursionDepth": 24
  },
  {
    "questionIdx": 22793,
    "questionWithBrackets": "Did [The Terrorist]'s art director's male sibling produce [Thambi]",
    "questionPatternModEntities": "Did M2 's art director 's male sibling produce M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0b8kc0 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.07k1k .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 M1 .\n?x1 P3 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 74204,
    "questionWithBrackets": "Was [Ridge Forrester] [Adriana Cramer]'s spouse's sibling, child, and spouse",
    "questionPatternModEntities": "Was M1 M0 's spouse 's sibling , child , and spouse",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0277_gn .\nFILTER ( ?x0 != ns:m.0277_gn ) .\nFILTER ( ns:m.0g53gd7 != ?x0 ) .\nFILTER ( ns:m.0g53gd7 != ?x0 ) .\nns:m.0g53gd7 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0 .\nns:m.0g53gd7 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0 .\nns:m.0g53gd7 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 24
  },
  {
    "questionIdx": 131275,
    "questionWithBrackets": "What British screenwriter married an actor of [Miss Kenton]",
    "questionPatternModEntities": "What British screenwriter married a actor of M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.02nwq8l .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Kenneth Branagh",
    "recursionDepth": 24
  },
  {
    "questionIdx": 144925,
    "questionWithBrackets": "What did [Lorne Morris] edit and a film producer direct",
    "questionPatternModEntities": "What did M0 edit and a film producer direct",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0n9fmp7 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Burial of the Rats",
    "recursionDepth": 24
  },
  {
    "questionIdx": 172861,
    "questionWithBrackets": "What was edited and directed by a spouse of [Anna Sten]",
    "questionPatternModEntities": "What was edited and directed by a spouse of M0",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.027h5l1 .\nFILTER ( ?x1 != ns:m.027h5l1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Der M\u00f6rder Dimitri Karamasoff",
    "recursionDepth": 24
  },
  {
    "questionIdx": 32058,
    "questionWithBrackets": "Did a female Canadian costume designer write [Soif]",
    "questionPatternModEntities": "Did a female Canadian costume designer write M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:film.writer.film ns:m.010r196b .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 237427,
    "questionWithBrackets": "Who was influenced by [Tetsuo: The Bullet Man]'s star, editor, and cinematographer",
    "questionPatternModEntities": "Who was influenced by M1 's star , editor , and cinematographer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.06zq889 .\n?x1 ns:film.cinematographer.film ns:m.06zq889 .\n?x1 ns:film.editor.film ns:m.06zq889\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 24
  },
  {
    "questionIdx": 203742,
    "questionWithBrackets": "Which film producer employed a male producer of [I Hate Luv Storys]",
    "questionPatternModEntities": "Which film producer employed a male producer of M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.076whzw .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Dharma Productions",
    "recursionDepth": 24
  },
  {
    "questionIdx": 30482,
    "questionWithBrackets": "Did a cinematographer's female parent executive produce [Mean Creek]",
    "questionPatternModEntities": "Did a cinematographer 's female parent executive produce M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.048lh4 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 7391,
    "questionWithBrackets": "Did [Fidelity Investments]'s child employ [The Maldonado Miracle]'s Mexican director",
    "questionPatternModEntities": "Did M0 's child employ M2 's Mexican director",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.028q26 .\n?x1 ns:film.director.film ns:m.04j2bpw .\n?x1 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 220562,
    "questionWithBrackets": "Who married [Looking for Eric]'s Spanish French executive producer",
    "questionPatternModEntities": "Who married M1 's Spanish French executive producer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.05f8jnc .\n?x1 ns:people.person.nationality ns:m.06mkj .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Rachida Brakni; Isabelle Ferrer",
    "recursionDepth": 24
  },
  {
    "questionIdx": 143091,
    "questionWithBrackets": "What did [Edmond Was a Donkey]'s editor, cinematographer, and art director executive produce",
    "questionPatternModEntities": "What did M0 's editor , cinematographer , and art director executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0k3d95c .\n?x1 ns:film.editor.film ns:m.0k3d95c .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0k3d95c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Mister Cok",
    "recursionDepth": 24
  },
  {
    "questionIdx": 44074,
    "questionWithBrackets": "Was [Abashiri Bangaichi] distributed by a Japanese film producer's employer",
    "questionPatternModEntities": "Was M2 distributed by a Japanese film producer 's employer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.03_3d .\nns:m.076vzd8 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 14790,
    "questionWithBrackets": "Did [Micki Dickoff] and [Tony Pagano] executive produce and edit [Neshoba]",
    "questionPatternModEntities": "Did M0 and M2 executive produce and edit M1",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03d5c9p ns:film.editor.film ns:m.05fbhht .\nns:m.03d5c9p ns:film.producer.films_executive_produced ns:m.05fbhht .\nns:m.0j8jvhn ns:film.editor.film ns:m.05fbhht .\nns:m.0j8jvhn ns:film.producer.films_executive_produced ns:m.05fbhht\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM2 P0 M1 .\nM2 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 56370,
    "questionWithBrackets": "Was [Gen Fukunaga] a film distributor's Japanese American founder",
    "questionPatternModEntities": "Was M1 a film distributor 's Japanese American founder",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\nns:m.04cm16 ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.04cm16 ns:people.person.nationality ns:m.03_3d .\nns:m.04cm16 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 M2 .\nM1 P1 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 225534,
    "questionWithBrackets": "Who was a Canadian film editor that produced [30-love]",
    "questionPatternModEntities": "Who was a Canadian film editor that produced M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.010bwhv7 .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Richard E. Stark",
    "recursionDepth": 24
  },
  {
    "questionIdx": 90492,
    "questionWithBrackets": "Was a Mexican actor's spouse and child [Roc\u00edo Dur\u00e1n]",
    "questionPatternModEntities": "Was a Mexican actor 's spouse and child M2",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.0b90_r .\nFILTER ( ns:m.0kb_31y != ?x0 ) .\nns:m.0kb_31y ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0 .\nns:m.0kb_31y ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 142699,
    "questionWithBrackets": "What did [Clifton Ko] produce, edit, and write",
    "questionPatternModEntities": "What did M0 produce , edit , and write",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0270vhl .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0270vhl .\n?x0 ns:film.film.written_by ns:m.0270vhl\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0\n}",
    "expectedResponse": "Happy Ghost V",
    "recursionDepth": 24
  },
  {
    "questionIdx": 226530,
    "questionWithBrackets": "Who was a French character that produced [The Kingdom of the Fairies]",
    "questionPatternModEntities": "Who was a French character that produced M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 a ns:people.person .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.04f3q28 .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 24
  },
  {
    "questionIdx": 50671,
    "questionWithBrackets": "Was [Club Alpbach Croatia] founded by a screenwriter's child and parent",
    "questionPatternModEntities": "Was M1 founded by a screenwriter 's child and parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.writer .\nns:m.0r3v1_y ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 24
  },
  {
    "questionIdx": 41298,
    "questionWithBrackets": "Did an actor marry an executive producer of [The Brave Little Toaster] and [Knocking On Death's Door]",
    "questionPatternModEntities": "Did a actor marry a executive producer of M1 and M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.04j3579 .\n?x1 ns:film.producer.films_executive_produced ns:m.052g0w .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 24
  },
  {
    "questionIdx": 192813,
    "questionWithBrackets": "Which actor married and influenced a film editor",
    "questionPatternModEntities": "Which actor married and influenced a film editor",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.editor .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 24
  },
  {
    "questionIdx": 218588,
    "questionWithBrackets": "Who influenced [Michael Douglas] and influenced a film producer",
    "questionPatternModEntities": "Who influenced M1 and influenced a film producer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ns:m.0kjgl .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Redd Foxx",
    "recursionDepth": 24
  },
  {
    "questionIdx": 137336,
    "questionWithBrackets": "What art director influenced an employee and founder of [DreamWorks Studios]",
    "questionPatternModEntities": "What art director influenced a employee and founder of M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.01gb54 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01gb54\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Alfred Hitchcock",
    "recursionDepth": 24
  },
  {
    "questionIdx": 233406,
    "questionWithBrackets": "Who was an Italian film director that married [Maria Teresa Bellucci]",
    "questionPatternModEntities": "Who was a Italian film director that married M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0z9z85j .\nFILTER ( ?x0 != ns:m.0z9z85j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Marco Spagnoli",
    "recursionDepth": 24
  },
  {
    "questionIdx": 195960,
    "questionWithBrackets": "Which cinematographer influenced and married a screenwriter",
    "questionPatternModEntities": "Which cinematographer influenced and married a screenwriter",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Agn\u00e8s Varda",
    "recursionDepth": 24
  },
  {
    "questionIdx": 228511,
    "questionWithBrackets": "Who was a Swedish cinematographer that [Claudia Galli] married",
    "questionPatternModEntities": "Who was a Swedish cinematographer that M3 married",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.0d0vqn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0sgrydn .\nFILTER ( ?x0 != ns:m.0sgrydn )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Manuel Concha",
    "recursionDepth": 24
  },
  {
    "questionIdx": 226221,
    "questionWithBrackets": "Who was a Dutch film director that [The Last Days of Emma Blank] starred",
    "questionPatternModEntities": "Who was a Dutch film director that M3 starred",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.07l4_ds .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Alex van Warmerdam",
    "recursionDepth": 24
  },
  {
    "questionIdx": 86664,
    "questionWithBrackets": "Was [Whip It] directed by a film producer's female founder",
    "questionPatternModEntities": "Was M2 directed by a film producer 's female founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 a ns:film.producer .\nns:m.047p798 ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 76556,
    "questionWithBrackets": "Was [Sin Nombre] produced by a production company's child and parent",
    "questionPatternModEntities": "Was M1 produced by a production company 's child and parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.production_company .\nns:m.05q4ky1 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 146424,
    "questionWithBrackets": "What did [Sinclair Lewis] write and an art director write",
    "questionPatternModEntities": "What did M0 write and a art director write",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0ddcb .\n?x1 a ns:film.film_art_director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Fun and Fancy Free",
    "recursionDepth": 24
  },
  {
    "questionIdx": 229357,
    "questionWithBrackets": "Who was a costume designer whose sibling was influenced by [Johnny Carson]",
    "questionPatternModEntities": "Who was a costume designer whose sibling was influenced by M2",
    "questionTemplate": "Who was a [NP_SIMPLE] whose [ROLE_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:people.person .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:influence.influence_node.influenced_by ns:m.0ph2w .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Lynn Hicks",
    "recursionDepth": 24
  },
  {
    "questionIdx": 149577,
    "questionWithBrackets": "What did a female founder of a film producer direct",
    "questionPatternModEntities": "What did a female founder of a film producer direct",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x2 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 M0 .\n?x2 a M1\n}",
    "expectedResponse": "Whip It",
    "recursionDepth": 24
  }
]