[
  {
    "questionIdx": 26160,
    "questionWithBrackets": "Did a Canadian art director edit and produce [Juan Machuca Contreras]",
    "questionPatternModEntities": "Did a Canadian art director edit and produce M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.editor.film ns:m.0pxb0d_ .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0pxb0d_ .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M1 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 190241,
    "questionWithBrackets": "Which Italian actor that wrote [La vacanza] edited [Salon Kitty]",
    "questionPatternModEntities": "Which Italian actor that wrote M2 edited M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.editor.film ns:m.0crt7qf .\n?x0 ns:film.writer.film ns:m.0cz9pql .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Tinto Brass",
    "recursionDepth": 27
  },
  {
    "questionIdx": 154645,
    "questionWithBrackets": "What female person that [Live Today, Die Tomorrow!] starred did [Toei Company] employ",
    "questionPatternModEntities": "What female person that M2 starred did M1 employ",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0kv85dv .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0674hk .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Kiwako Taichi",
    "recursionDepth": 27
  },
  {
    "questionIdx": 203451,
    "questionWithBrackets": "Which film editor whose sibling was employed by [Stanford University] did [We Have a Pope] star",
    "questionPatternModEntities": "Which film editor whose sibling was employed by M2 did M1 star",
    "questionTemplate": "Which [NP_SIMPLE] whose [ROLE_SIMPLE] was [VP_SIMPLE] by [entity] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0gh6j94 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.06pwq .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Nanni Moretti",
    "recursionDepth": 27
  },
  {
    "questionIdx": 34185,
    "questionWithBrackets": "Did a film editor whose sibling edited [Window on Your Present] executive produce [Bad Milo!]",
    "questionPatternModEntities": "Did a film editor whose sibling edited M2 executive produce M1",
    "questionTemplate": "Did a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.producer.films_executive_produced ns:m.0w1f7zz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.editor.film ns:m.0zkbv3p .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 87122,
    "questionWithBrackets": "Was [Wong Jing] a film's sequel's director, star, and writer",
    "questionPatternModEntities": "Was M1 a film 's sequel 's director , star , and writer",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ?x1 .\n?x1 a ns:film.film .\nns:m.06101p ns:film.actor.film/ns:film.performance.film ?x0 .\nns:m.06101p ns:film.director.film ?x0 .\nns:m.06101p ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 65040,
    "questionWithBrackets": "Was [Love in the Afternoon] directed and edited by a Swedish costume designer",
    "questionPatternModEntities": "Was M2 directed and edited by a Swedish costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.nationality ns:m.0d0vqn .\nns:m.0b2f87 ns:film.film.directed_by ?x0 .\nns:m.0b2f87 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 13523,
    "questionWithBrackets": "Did [Love at Large] and [The American Nightmare] star a film's Canadian cinematographer",
    "questionPatternModEntities": "Did M2 and M3 star a film 's Canadian cinematographer",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x1 a ns:film.film .\nns:m.04jb638 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0crt7nv ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 178174,
    "questionWithBrackets": "What was executive produced by and directed by [The Terrorist]'s art director's sibling",
    "questionPatternModEntities": "What was executive produced by and directed by M0 's art director 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.film_art_director.films_art_directed ns:m.07k1k .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Dil Se",
    "recursionDepth": 28
  },
  {
    "questionIdx": 120316,
    "questionWithBrackets": "Were [Lo sguardo digitale] and [The Sexual Story of O] edited by a character's Spanish actor",
    "questionPatternModEntities": "Were M2 and M3 edited by a character 's Spanish actor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x1 a ns:fictional_universe.fictional_character .\nns:m.0crsn8h ns:film.film.edited_by ?x0 .\nns:m.0gx9_sz ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 147369,
    "questionWithBrackets": "What did [The Klansman]'s star edit and a film editor direct",
    "questionPatternModEntities": "What did M0 's star edit and a film editor direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x1 a ns:film.editor .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.063vys\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M0 .\n?x2 a M1\n}",
    "expectedResponse": "Dentally Disturbed",
    "recursionDepth": 28
  },
  {
    "questionIdx": 90960,
    "questionWithBrackets": "Was a Spanish film director's male child's country of nationality [Argentina]",
    "questionPatternModEntities": "Was a Spanish film director 's male child 's country of nationality M3",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.director .\n?x1 ns:people.person.nationality ns:m.06mkj .\nns:m.0jgd ^ns:people.person.nationality ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 a M1 .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 129111,
    "questionWithBrackets": "Were [Virgin Megastores], [Walt Disney Studios], [Disney Interactive], [Disneyland Resort], and [Walt Disney Animation Studios] founded by a film producer",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 founded by a film producer",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\nns:m.013r16 ns:organization.organization.founders ?x0 .\nns:m.01zx_x ns:organization.organization.founders ?x0 .\nns:m.024sz8 ns:organization.organization.founders ?x0 .\nns:m.047cb57 ns:organization.organization.founders ?x0 .\nns:m.04rcl7 ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM2 P0 ?x0 .\nM3 P0 ?x0 .\nM4 P0 ?x0 .\nM5 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 120074,
    "questionWithBrackets": "Were [Leaving Normal] and [Blues for the Avatar] executive produced by and produced by a cinematographer",
    "questionPatternModEntities": "Were M1 and M2 executive produced by and produced by a cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\nns:m.07k5hy6 ns:film.film.executive_produced_by ?x0 .\nns:m.07k5hy6 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0znn7j_ ns:film.film.executive_produced_by ?x0 .\nns:m.0znn7j_ ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 62636,
    "questionWithBrackets": "Was [Katharina Kubrick] [Death Row II]'s executive producer's sibling's German spouse's child",
    "questionPatternModEntities": "Was M2 M1 's executive producer 's sibling 's German spouse 's child",
    "questionTemplate": "Was [entity] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.producer.films_executive_produced ns:m.0_zb00y .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nns:m.02g6wv_ ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 24457,
    "questionWithBrackets": "Did [Virginie Silla] and [Sylvia Nicholson] marry [The Beast with a Million Eyes]'s distributor's employee and founder",
    "questionPatternModEntities": "Did M1 and M2 marry M0 's distributor 's employee and founder",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04y7ksr .\nFILTER ( ns:m.0hns5bw != ?x0 ) .\nFILTER ( ns:m.0jsy9c != ?x0 ) .\nns:m.0hns5bw ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0jsy9c ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M2 != ?x0 ) .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 217428,
    "questionWithBrackets": "Who founded [Disney Channel] and founded a production company's child",
    "questionPatternModEntities": "Who founded M1 and founded a production company 's child",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0kc9f .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Walt Disney",
    "recursionDepth": 28
  },
  {
    "questionIdx": 73465,
    "questionWithBrackets": "Was [Rauno Ronkainen] a spouse of a costume designer, cinematographer, and art director of [A Hole in My Heart]",
    "questionPatternModEntities": "Was M1 a spouse of a costume designer , cinematographer , and art director of M0",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.03xkr6 .\n?x0 ns:film.film_art_director.films_art_directed ns:m.03xkr6 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.03xkr6 .\nFILTER ( ns:m.02pwby6 != ?x0 ) .\nns:m.02pwby6 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 66303,
    "questionWithBrackets": "Was [Marika Green] a female Swedish French sibling of [Walter Green]",
    "questionPatternModEntities": "Was M0 a female Swedish French sibling of M1",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.095jxq != ns:m.0gx903m ) .\nns:m.095jxq ns:people.person.gender ns:m.02zsn .\nns:m.095jxq ns:people.person.nationality ns:m.0d0vqn .\nns:m.095jxq ns:people.person.nationality ns:m.0f8l9c .\nns:m.095jxq ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gx903m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M2 .\nM0 P1 M3 .\nM0 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 157504,
    "questionWithBrackets": "What film producer employed [Duplicate]'s costume designer and employed [Yash Johar]",
    "questionPatternModEntities": "What film producer employed M2 's costume designer and employed M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0391gb .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0bwgst\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2\n}",
    "expectedResponse": "Dharma Productions",
    "recursionDepth": 28
  },
  {
    "questionIdx": 221711,
    "questionWithBrackets": "Who married an art director and married [Joseph A. McCarthy] and [Robert Carleton-Munro]",
    "questionPatternModEntities": "Who married a art director and married M1 and M2",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0h2qr4q .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0h2qr53 .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0h2qr4q ) .\nFILTER ( ?x0 != ns:m.0h2qr53 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 a M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Veronica Lake",
    "recursionDepth": 28
  },
  {
    "questionIdx": 180953,
    "questionWithBrackets": "What was produced and written by a costume designer of [Field of Dreams 2: Lockout] and [Peep World]",
    "questionPatternModEntities": "What was produced and written by a costume designer of M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0crs_32 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0g_w5hs\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Gregory Go Boom",
    "recursionDepth": 28
  },
  {
    "questionIdx": 32087,
    "questionWithBrackets": "Did a female French costume designer influence [Jos\u00e9 Mar\u00eda de Lacunza] and [Karl Lagerfeld]",
    "questionPatternModEntities": "Did a female French costume designer influence M1 and M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:influence.influence_node.influenced ns:m.017tl9 .\n?x0 ns:influence.influence_node.influenced ns:m.0c598t5 .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 79523,
    "questionWithBrackets": "Was [The Big Sink] edited, written, and produced by [I First Saw the Light]'s producer",
    "questionPatternModEntities": "Was M1 edited , written , and produced by M0 's producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0pxbqhy .\nns:m.01144wdy ns:film.film.edited_by ?x0 .\nns:m.01144wdy ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.01144wdy ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 197102,
    "questionWithBrackets": "Which company was acquired by a company and acquired by [Forte Group]",
    "questionPatternModEntities": "Which company was acquired by a company and acquired by M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02rjcjp .\n?x1 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M0\n}",
    "expectedResponse": "Le M\u00e9ridien",
    "recursionDepth": 28
  },
  {
    "questionIdx": 22300,
    "questionWithBrackets": "Did [The House of the Spirits] and [The Legend of Kaspar Hauser] star [Dungeon Play 4]'s costume designer, cinematographer, and art director",
    "questionPatternModEntities": "Did M1 and M2 star M0 's costume designer , cinematographer , and art director",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.07ylzcl .\n?x0 ns:film.film_art_director.films_art_directed ns:m.07ylzcl .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.07ylzcl .\nns:m.03zyv4 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0h2y6xv ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 3080,
    "questionWithBrackets": "Did [Buddimantudu] star [Allu Rama Lingaiah] and star a founder of [Negro Ensemble Company]",
    "questionPatternModEntities": "Did M1 star M2 and star a founder of M0",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02pn54p .\nns:m.0hz5_kh ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0hz5_kh ns:film.film.starring/ns:film.performance.actor ns:m.0krs4m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 32460,
    "questionWithBrackets": "Did a female person that founded [Hellenic College of London] marry [Constantine II of Greece]",
    "questionPatternModEntities": "Did a female person that founded M1 marry M3",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0g2nh_ .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.01550k .\nFILTER ( ?x0 != ns:m.01550k )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 149808,
    "questionWithBrackets": "What did a film distributor's founder direct and [C\u00e9dric Klapisch] direct",
    "questionPatternModEntities": "What did a film distributor 's founder direct and M0 direct",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.07378r .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Lumi\u00e8re and Company",
    "recursionDepth": 28
  },
  {
    "questionIdx": 174651,
    "questionWithBrackets": "What was edited by and directed by [Promises Written in Water]'s art director and star",
    "questionPatternModEntities": "What was edited by and directed by M0 's art director and star",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0bh9qf1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0bh9qf1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Promises Written in Water; The Brown Bunny",
    "recursionDepth": 28
  },
  {
    "questionIdx": 221605,
    "questionWithBrackets": "Who married a screenwriter's child and married [Lori Sammartino]",
    "questionPatternModEntities": "Who married a screenwriter 's child and married M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0n28nc6 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0n28nc6 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Maurizio Costanzo",
    "recursionDepth": 28
  },
  {
    "questionIdx": 84410,
    "questionWithBrackets": "Was [Twixt] distributed by a film distributor that [Jack L. Warner] and [Th\u00e9ophile Path\u00e9] founded",
    "questionPatternModEntities": "Was M3 distributed by a film distributor that M1 and M2 founded",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ns:m.011x277w .\n?x0 ns:organization.organization.founders ns:m.0m593 .\nns:m.0drytd1 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 185615,
    "questionWithBrackets": "What was written by and edited by [Lonely Bones]'s Dutch art director",
    "questionPatternModEntities": "What was written by and edited by M1 's Dutch art director",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0rh82mj .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "The Monster of Nix",
    "recursionDepth": 28
  },
  {
    "questionIdx": 159142,
    "questionWithBrackets": "What film was produced by a film editor and directed by [Palacio Rojo]",
    "questionPatternModEntities": "What film was produced by a film editor and directed by M1",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ns:m.0lg2ppv .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Salas SAL",
    "recursionDepth": 28
  },
  {
    "questionIdx": 103667,
    "questionWithBrackets": "Was a person's male actor influenced by [Vance Bedford] and [Paul Whitehouse]",
    "questionPatternModEntities": "Was a person 's male actor influenced by M0 and M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.03hhwyr .\n?x0 ns:influence.influence_node.influenced_by ns:m.061wm .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 a ns:people.person\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P2 M2 .\n?x1 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  }
]