[
  {
    "questionIdx": 79524,
    "questionWithBrackets": "Was [The Big Sleep] executive produced by [Eve Chilton Weinstein]'s male spouse's sibling",
    "questionPatternModEntities": "Was M2 executive produced by M1 's male spouse 's sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bb_kpq .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0bb_kpq ) .\nns:m.05k7xj ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 ) .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 202378,
    "questionWithBrackets": "Which film distributor employed [Above All Else in the World]'s executive producer, writer, and director",
    "questionPatternModEntities": "Which film distributor employed M1 's executive producer , writer , and director",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:film.director.film ns:m.010s98f4 .\n?x1 ns:film.producer.films_executive_produced ns:m.010s98f4 .\n?x1 ns:film.writer.film ns:m.010s98f4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Universum Film AG",
    "recursionDepth": 26
  },
  {
    "questionIdx": 74515,
    "questionWithBrackets": "Was [Robert Shaye] an actor that a film's producer employed",
    "questionPatternModEntities": "Was M1 a actor that a film 's producer employed",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 a ns:film.film .\nns:m.027ndl1 a ns:film.actor .\nns:m.027ndl1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 184826,
    "questionWithBrackets": "What was written by [Satyajit Ray] and written by [Mahananda Bandyopadhyay]'s child",
    "questionPatternModEntities": "What was written by M0 and written by M1 's child",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ns:m.071xj .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0w_lfqj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Distant Thunder",
    "recursionDepth": 26
  },
  {
    "questionIdx": 179858,
    "questionWithBrackets": "What was founded by [Mary Pickford] and founded by [The Valet's Wife]'s writer",
    "questionPatternModEntities": "What was founded by M0 and founded by M1 's writer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.04rfq .\n?x1 ns:film.writer.film ns:m.0zwjg3f\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "United Artists",
    "recursionDepth": 26
  },
  {
    "questionIdx": 171174,
    "questionWithBrackets": "What was directed by and executive produced by a sibling of [Talia Shire]",
    "questionPatternModEntities": "What was directed by and executive produced by a sibling of M0",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.01gw4f .\nFILTER ( ?x1 != ns:m.01gw4f )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Rumble Fish",
    "recursionDepth": 26
  },
  {
    "questionIdx": 202346,
    "questionWithBrackets": "Which film distributor did [The Idle Class]'s producer, editor, and writer found",
    "questionPatternModEntities": "Which film distributor did M1 's producer , editor , and writer found",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.editor.film ns:m.07n76l .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.07n76l .\n?x1 ns:film.writer.film ns:m.07n76l\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "United Artists",
    "recursionDepth": 26
  },
  {
    "questionIdx": 184151,
    "questionWithBrackets": "What was written by [Corrado Pallenberg]'s child and written by [William Goodhart]",
    "questionPatternModEntities": "What was written by M1 's child and written by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0jx_1b .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0c48r8_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Exorcist II: The Heretic",
    "recursionDepth": 26
  },
  {
    "questionIdx": 20162,
    "questionWithBrackets": "Did [Suzanne Belperron] influence an Italian costume designer of [Shades of Romona] and [Every Day's a Holiday]",
    "questionPatternModEntities": "Did M3 influence a Italian costume designer of M0 and M1",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.03h23z5 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.05nc_d1 .\n?x0 ns:people.person.nationality ns:m.03rjj .\nns:m.0j9p7g9 ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 203431,
    "questionWithBrackets": "Which film editor was influenced by and married a film producer",
    "questionPatternModEntities": "Which film editor was influenced by and married a film producer",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.producer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Agn\u00e8s Varda",
    "recursionDepth": 26
  },
  {
    "questionIdx": 226509,
    "questionWithBrackets": "Who was a French character that [A Nightmare] was produced by",
    "questionPatternModEntities": "Who was a French character that M3 was produced by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 a ns:people.person .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0j9ljbs .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 26
  },
  {
    "questionIdx": 170707,
    "questionWithBrackets": "What was directed by a costume designer and executive produced by [Lalji Mehrotra]",
    "questionPatternModEntities": "What was directed by a costume designer and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0zc1_7y .\n?x1 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Joi Baba Felunath",
    "recursionDepth": 26
  },
  {
    "questionIdx": 24587,
    "questionWithBrackets": "Did [WWF: King of the Ring 2001] star a Canadian employee of [WWE] and [New Japan Pro Wrestling]",
    "questionPatternModEntities": "Did M3 star a Canadian employee of M0 and M1",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02z3y1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0gy1_ .\n?x0 ns:people.person.nationality ns:m.0d060g .\nns:m.0crrqqw ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 107538,
    "questionWithBrackets": "Was an American sibling of [Robert Todd Williams] influenced by an actor",
    "questionPatternModEntities": "Was a American sibling of M0 influenced by a actor",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.02_9fxj .\n?x1 a ns:film.actor .\nFILTER ( ?x0 != ns:m.02_9fxj )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 a M2 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 42645,
    "questionWithBrackets": "Did an employee of [The Gilded Lily]'s distributor and producer direct [Don Juan Quilligan]",
    "questionPatternModEntities": "Did a employee of M1 's distributor and producer direct M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.09rr2y4 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.02pt1r_ .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02pt1r_\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 101981,
    "questionWithBrackets": "Was a male child of a female person [Bob Metzger]",
    "questionPatternModEntities": "Was a male child of a female person M2",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.0vc5rrz ns:people.person.gender ns:m.05zppz .\nns:m.0vc5rrz ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P0 M3 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 63955,
    "questionWithBrackets": "Was [Lawrence Durrell] a screenwriter whose sibling founded [Mauritian Wildlife Foundation] and [Amblin Entertainment]",
    "questionPatternModEntities": "Was M2 a screenwriter whose sibling founded M0 and M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.030_1_ .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.08pg85 .\nFILTER ( ns:m.0hb1b != ?x0 ) .\nns:m.0hb1b a ns:film.writer .\nns:m.0hb1b ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 74720,
    "questionWithBrackets": "Was [Romy Schneider] [Sacha Darwin]'s German French female sibling",
    "questionPatternModEntities": "Was M0 M1 's German French female sibling",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.0144k5 != ns:m.0gbx3w2 ) .\nns:m.0144k5 ns:people.person.gender ns:m.02zsn .\nns:m.0144k5 ns:people.person.nationality ns:m.0345h .\nns:m.0144k5 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0144k5 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gbx3w2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M2 .\nM0 P1 M3 .\nM0 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 38280,
    "questionWithBrackets": "Did a prequel of [Chasing Amy] star [POW! Entertainment]'s founder and employee",
    "questionPatternModEntities": "Did a prequel of M0 star M1 's founder and employee",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ns:m.0gd92 .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.026y0vz .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.026y0vz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 39606,
    "questionWithBrackets": "Did a sibling of [I'm Still Here]'s cinematographer and writer play [Gavin Banek]",
    "questionPatternModEntities": "Did a sibling of M1 's cinematographer and writer play M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.04ds18y .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0czbf7b .\n?x1 ns:film.writer.film ns:m.0czbf7b .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 221392,
    "questionWithBrackets": "Who married a film director and was influenced by [Robert Benchley]",
    "questionPatternModEntities": "Who married a film director and was influenced by M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.03gph9 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.director .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Woody Allen",
    "recursionDepth": 26
  },
  {
    "questionIdx": 124563,
    "questionWithBrackets": "Were [Sicily!] and [From Today Until Tomorrow] directed and edited by an actor",
    "questionPatternModEntities": "Were M1 and M2 directed and edited by a actor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nns:m.02w_h5y ns:film.film.directed_by ?x0 .\nns:m.02w_h5y ns:film.film.edited_by ?x0 .\nns:m.0bggmkk ns:film.film.directed_by ?x0 .\nns:m.0bggmkk ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 12345,
    "questionWithBrackets": "Did [Kelly Herron] edit [MVP: Most Vertical Primate]'s sequel and edit [Santa Paws 2: The Santa Pups]",
    "questionPatternModEntities": "Did M1 edit M0 's sequel and edit M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.0dh_2c .\nns:m.0jt3xy ns:film.editor.film ?x0 .\nns:m.0jt3xy ns:film.editor.film ns:m.0p2sqrd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 207966,
    "questionWithBrackets": "Which person married [Little Feet]'s executive producer, editor, and producer",
    "questionPatternModEntities": "Which person married M1 's executive producer , editor , and producer",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.editor.film ns:m.0wyn1f2 .\n?x1 ns:film.producer.films_executive_produced ns:m.0wyn1f2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0wyn1f2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Karyn Parsons; Jennifer Beals",
    "recursionDepth": 26
  },
  {
    "questionIdx": 103140,
    "questionWithBrackets": "Was a person an art director that [The Flim-Flam Man]'s distributor employed",
    "questionPatternModEntities": "Was a person a art director that M2 's distributor employed",
    "questionTemplate": "Was a [NP_SIMPLE] a [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0b8l1g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 146185,
    "questionWithBrackets": "What did [Rose Castorini]'s actor executive produce and [D.G. Brock] direct",
    "questionPatternModEntities": "What did M1 's actor executive produce and M0 direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.0s965f_ .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0t4vgd_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Montana Amazon",
    "recursionDepth": 26
  },
  {
    "questionIdx": 185733,
    "questionWithBrackets": "What was written by and executive produced by a sibling of [Bobby Farrelly]",
    "questionPatternModEntities": "What was written by and executive produced by a sibling of M0",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.03ysmg .\nFILTER ( ?x1 != ns:m.03ysmg )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "There's Something About Mary",
    "recursionDepth": 26
  },
  {
    "questionIdx": 70012,
    "questionWithBrackets": "Was [Omer Hussain] a male person that [My Lady's Lips] was distributed by",
    "questionPatternModEntities": "Was M0 a male person that M2 was distributed by",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.02668hm a ns:people.person .\nns:m.02668hm ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0h_cb4j .\nns:m.02668hm ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 194810,
    "questionWithBrackets": "Which character influenced and was influenced by a person",
    "questionPatternModEntities": "Which character influenced and was influenced by a person",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M1\n}",
    "expectedResponse": "Federico Garc\u00eda Lorca",
    "recursionDepth": 26
  },
  {
    "questionIdx": 100517,
    "questionWithBrackets": "Was a film's costume designer, producer, cinematographer, and executive producer [Charlene Gilbert]",
    "questionPatternModEntities": "Was a film 's costume designer , producer , cinematographer , and executive producer M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0c38mtw ns:film.cinematographer.film ?x0 .\nns:m.0c38mtw ns:film.film_costumer_designer.costume_design_for_film ?x0 .\nns:m.0c38mtw ns:film.producer.films_executive_produced ?x0 .\nns:m.0c38mtw ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 75875,
    "questionWithBrackets": "Was [Sergey Tolstoy] a male person whose sibling influenced [L\u00fc Jiamin]",
    "questionPatternModEntities": "Was M1 a male person whose sibling influenced M0",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.03wfl6r .\nFILTER ( ns:m.0rznm24 != ?x0 ) .\nns:m.0rznm24 a ns:people.person .\nns:m.0rznm24 ns:people.person.gender ns:m.05zppz .\nns:m.0rznm24 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0 .\nM1 P2 M3 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 215474,
    "questionWithBrackets": "Who did a German person's German actor marry",
    "questionPatternModEntities": "Who did a German person 's German actor marry",
    "questionTemplate": "Who did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x2 a ns:people.person .\n?x2 ns:people.person.nationality ns:m.0345h .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 ?x2 .\n?x2 P1 M1 .\n?x2 a M0 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Christine Mylius",
    "recursionDepth": 27
  },
  {
    "questionIdx": 2992,
    "questionWithBrackets": "Did [Britain in a Day]'s executive producer executive produce and produce a film",
    "questionPatternModEntities": "Did M0 's executive producer executive produce and produce a film",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:film.producer.films_executive_produced ns:m.0hgm2hl .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 88378,
    "questionWithBrackets": "Was a Canadian cinematographer whose child directed [Staunton Hill] [George A. Romero]",
    "questionPatternModEntities": "Was a Canadian cinematographer whose child directed M0 M1",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.080g3d4 .\nns:m.01_k1z a ns:film.cinematographer .\nns:m.01_k1z ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.01_k1z ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 M3 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 145827,
    "questionWithBrackets": "What did [Philom\u00e8ne Esposito]'s French child direct and edit",
    "questionPatternModEntities": "What did M1 's French child direct and edit",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:g.122zk1hl\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Super Trash",
    "recursionDepth": 27
  },
  {
    "questionIdx": 5589,
    "questionWithBrackets": "Did [Deep Burial]'s German executive producer marry a character's actor",
    "questionPatternModEntities": "Did M0 's German executive producer marry a character 's actor",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.0vp1ws_ .\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x2 a ns:fictional_universe.fictional_character .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 88946,
    "questionWithBrackets": "Was a Chinese person that founded [Xstream Pictures] a film editor",
    "questionPatternModEntities": "Was a Chinese person that founded M2 a film editor",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03qjzv2 .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  }
]