[
  {
    "questionIdx": 145863,
    "questionWithBrackets": "What did [Ploy]'s editor's parent executive produce",
    "questionPatternModEntities": "What did M0 's editor 's parent executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:film.editor.film ns:m.02q3ps3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0\n}",
    "expectedResponse": "The Overture",
    "recursionDepth": 19
  },
  {
    "questionIdx": 44157,
    "questionWithBrackets": "Was [Accordeon] produced by a screenwriter's spouse",
    "questionPatternModEntities": "Was M1 produced by a screenwriter 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.06_9v0p ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 163762,
    "questionWithBrackets": "What production company did an editor of [Shorts] found",
    "questionPatternModEntities": "What production company did a editor of M1 found",
    "questionTemplate": "What [NP_SIMPLE] did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.editor.film ns:m.05qpqj6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Troublemaker Studios",
    "recursionDepth": 19
  },
  {
    "questionIdx": 142434,
    "questionWithBrackets": "What did [Bullets of Love]'s Chinese director found",
    "questionPatternModEntities": "What did M1 's Chinese director found",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.director.film ns:m.0crrc8z .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Basic Pictures",
    "recursionDepth": 19
  },
  {
    "questionIdx": 58754,
    "questionWithBrackets": "Was [Honey, We Shrunk Ourselves] directed by a film's cinematographer",
    "questionPatternModEntities": "Was M1 directed by a film 's cinematographer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x1 a ns:film.film .\nns:m.0bplqp ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 214467,
    "questionWithBrackets": "Who did [Kuomintang]'s Chinese founder influence",
    "questionPatternModEntities": "Who did M1 's Chinese founder influence",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.049tb .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Mao Zedong",
    "recursionDepth": 19
  },
  {
    "questionIdx": 213837,
    "questionWithBrackets": "Who did [Border Incident]'s American art director marry",
    "questionPatternModEntities": "Who did M2 's American art director marry",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.07rhc5 .\n?x1 ns:people.person.nationality ns:m.09c7w0 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Dolores del R\u00edo; Hazel Brooks",
    "recursionDepth": 19
  },
  {
    "questionIdx": 181158,
    "questionWithBrackets": "What was produced by [Cyclops]'s sibling's actor",
    "questionPatternModEntities": "What was produced by M0 's sibling 's actor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0kl3p .\nFILTER ( ?x2 != ns:m.0kl3p )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nFILTER ( ?x2 != M0 )\n}",
    "expectedResponse": "Vs; Vacation 8",
    "recursionDepth": 19
  },
  {
    "questionIdx": 184738,
    "questionWithBrackets": "What was written by [Piranha II: The Spawning]'s prequel's producer",
    "questionPatternModEntities": "What was written by M0 's prequel 's producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 ns:film.film.sequel ns:m.09zwdx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0\n}",
    "expectedResponse": "Frankenstein Unbound; The Terror",
    "recursionDepth": 19
  },
  {
    "questionIdx": 70499,
    "questionWithBrackets": "Was [Pamela Douglas] a character's sibling and spouse",
    "questionPatternModEntities": "Was M1 a character 's sibling and spouse",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\nFILTER ( ns:m.026dx0b != ?x0 ) .\nFILTER ( ns:m.026dx0b != ?x0 ) .\nns:m.026dx0b ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0 .\nns:m.026dx0b ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 62540,
    "questionWithBrackets": "Was [Karen Glanz] a film producer's spouse and sibling",
    "questionPatternModEntities": "Was M1 a film producer 's spouse and sibling",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\nFILTER ( ns:m.059btt1 != ?x0 ) .\nFILTER ( ns:m.059btt1 != ?x0 ) .\nns:m.059btt1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0 .\nns:m.059btt1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 64975,
    "questionWithBrackets": "Was [Louis-Pierre Wenes] an art director's Spanish spouse",
    "questionPatternModEntities": "Was M1 a art director 's Spanish spouse",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\nFILTER ( ns:m.07nw_hd != ?x0 ) .\nns:m.07nw_hd ns:people.person.nationality ns:m.06mkj .\nns:m.07nw_hd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 M2 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 97160,
    "questionWithBrackets": "Was a film director's sibling and child [Yoram Gross]",
    "questionPatternModEntities": "Was a film director 's sibling and child M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\nFILTER ( ns:m.0bh6hf != ?x0 ) .\nns:m.0bh6hf ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0 .\nns:m.0bh6hf ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 220078,
    "questionWithBrackets": "Who married [Contract Lover]'s Chinese director",
    "questionPatternModEntities": "Who married M2 's Chinese director",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.0gkrv8c .\n?x1 ns:people.person.nationality ns:m.0d05w3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Cindy Yeung",
    "recursionDepth": 19
  },
  {
    "questionIdx": 75216,
    "questionWithBrackets": "Was [Salman of Saudi Arabia] a sibling of a sibling of [Sophia Barrison]",
    "questionPatternModEntities": "Was M1 a sibling of a sibling of M0",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gykgdy .\nFILTER ( ?x0 != ns:m.0gykgdy ) .\nFILTER ( ns:m.06hh_s != ?x0 ) .\nns:m.06hh_s ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 157180,
    "questionWithBrackets": "What film editor was influenced by [Picasso and Dance]'s costume designer",
    "questionPatternModEntities": "What film editor was influenced by M1 's costume designer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0qz85rr\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Norman Mailer",
    "recursionDepth": 19
  },
  {
    "questionIdx": 133142,
    "questionWithBrackets": "What French screenwriter was employed by [UNESCO]",
    "questionPatternModEntities": "What French screenwriter was employed by M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.05yg8kx .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Julio Cort\u00e1zar",
    "recursionDepth": 19
  },
  {
    "questionIdx": 97215,
    "questionWithBrackets": "Was a film distributed by [Bavaria Film] [Winter Sleepers]",
    "questionPatternModEntities": "Was a film distributed by M2 M0",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0271h00 a ns:film.film .\nns:m.0271h00 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0f4ht7\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 195047,
    "questionWithBrackets": "Which character was influenced by [Sophia Jansdochter Goltzius]'s spouse",
    "questionPatternModEntities": "Which character was influenced by M1 's spouse",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j6bg_2 .\nFILTER ( ?x1 != ns:m.0j6bg_2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "James VI and I",
    "recursionDepth": 19
  },
  {
    "questionIdx": 144001,
    "questionWithBrackets": "What did [Impy's Island]'s executive producer and writer write",
    "questionPatternModEntities": "What did M0 's executive producer and writer write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.02qw0nf .\n?x1 ns:film.writer.film ns:m.02qw0nf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Animals United; Impy's Island",
    "recursionDepth": 19
  },
  {
    "questionIdx": 73358,
    "questionWithBrackets": "Was [Rajin Saleh] a film's Chinese editor",
    "questionPatternModEntities": "Was M1 a film 's Chinese editor",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.03m_ym ns:film.editor.film ?x0 .\nns:m.03m_ym ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M2 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 188104,
    "questionWithBrackets": "Which Canadian cinematographer executive produced [Fierce Light]",
    "questionPatternModEntities": "Which Canadian cinematographer executive produced M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.producer.films_executive_produced ns:m.0bbxy9v .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Mark Achbar",
    "recursionDepth": 19
  },
  {
    "questionIdx": 218711,
    "questionWithBrackets": "Who influenced [Pieter Brueghel the Younger]'s Dutch parent",
    "questionPatternModEntities": "Who influenced M2 's Dutch parent",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0h6m9 .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Hieronymus Bosch",
    "recursionDepth": 19
  },
  {
    "questionIdx": 133942,
    "questionWithBrackets": "What Italian film producer was employed by [The Cannon Group]",
    "questionPatternModEntities": "What Italian film producer was employed by M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.037bm2 .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Giancarlo Parretti; Ovidio G. Assonitis",
    "recursionDepth": 19
  },
  {
    "questionIdx": 230776,
    "questionWithBrackets": "Who was a film editor that founded [SModcast Pictures]",
    "questionPatternModEntities": "Who was a film editor that founded M2",
    "questionTemplate": "Who was a [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0p3r3jj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Kevin Smith",
    "recursionDepth": 19
  },
  {
    "questionIdx": 14342,
    "questionWithBrackets": "Did [Masks and Faces]'s star's child influence [Stephen King]",
    "questionPatternModEntities": "Did M1 's star 's child influence M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.0jt90f5 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0h_dlkg\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 19
  },
  {
    "questionIdx": 26135,
    "questionWithBrackets": "Did a Canadian actor marry [William Lochren]",
    "questionPatternModEntities": "Did a Canadian actor marry M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05p5yl_ .\nFILTER ( ?x0 != ns:m.05p5yl_ )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 3991,
    "questionWithBrackets": "Did [Cheech & Chong's Up in Smoke]'s sequel's writer play [Robbie Hart]",
    "questionPatternModEntities": "Did M1 's sequel 's writer play M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0gkmn47 .\n?x0 ns:film.writer.film ?x1 .\n?x1 ns:film.film.prequel ns:m.04p80y\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 137820,
    "questionWithBrackets": "What art director was employed by [NEXT Ticketing LLC]'s parent",
    "questionPatternModEntities": "What art director was employed by M1 's parent",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09m_wgc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Jason Garner",
    "recursionDepth": 19
  },
  {
    "questionIdx": 143136,
    "questionWithBrackets": "What did [Elena Birkbeck]'s male spouse found",
    "questionPatternModEntities": "What did M1 's male spouse found",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0dgp92 .\nFILTER ( ?x1 != ns:m.0dgp92 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "BP",
    "recursionDepth": 19
  },
  {
    "questionIdx": 4115,
    "questionWithBrackets": "Did [Choi In Yang]'s spouse executive produce a film",
    "questionPatternModEntities": "Did M0 's spouse executive produce a film",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hnv682 .\n?x1 a ns:film.film .\nFILTER ( ?x0 != ns:m.0hnv682 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 19
  },
  {
    "questionIdx": 217160,
    "questionWithBrackets": "Who executive produced [Code Name Coq Rouge]'s sequel's prequel",
    "questionPatternModEntities": "Who executive produced M1 's sequel 's prequel",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x1 ns:film.film.sequel ?x2 .\n?x2 ns:film.film.prequel ns:m.0gkr233\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1\n}",
    "expectedResponse": "Gunnar Bergstr\u00f6m; Wolfgang Esterer",
    "recursionDepth": 19
  },
  {
    "questionIdx": 234435,
    "questionWithBrackets": "Who was employed by [Billy Hytner]'s actor's country of nationality",
    "questionPatternModEntities": "Who was employed by M1 's actor 's country of nationality",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0plt440\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1\n}",
    "expectedResponse": "Mahinda Vilathgamuwa; Kumudu Munasinghe",
    "recursionDepth": 19
  },
  {
    "questionIdx": 189141,
    "questionWithBrackets": "Which Dutch film editor executive produced [Nesma's Birds]",
    "questionPatternModEntities": "Which Dutch film editor executive produced M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.producer.films_executive_produced ns:m.0_7n9qn .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Mohamed Al-Daradji",
    "recursionDepth": 19
  },
  {
    "questionIdx": 138143,
    "questionWithBrackets": "What character founded a child of [Ancient Theban Army]",
    "questionPatternModEntities": "What character founded a child of M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0chtrwn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "Tempus",
    "recursionDepth": 19
  },
  {
    "questionIdx": 215240,
    "questionWithBrackets": "Who did [Under the Palms]'s male star marry",
    "questionPatternModEntities": "Who did M1 's male star marry",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.05znjj2 .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Francesca Guidato",
    "recursionDepth": 19
  },
  {
    "questionIdx": 5931,
    "questionWithBrackets": "Did [Don Rickles] influence [Mrs. Ada Harris]'s female actor",
    "questionPatternModEntities": "Did M2 influence M0 's female actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0gyk2fl .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.013tjc ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 20
  },
  {
    "questionIdx": 189034,
    "questionWithBrackets": "Which Dutch actor was influenced by [Henri Matisse]",
    "questionPatternModEntities": "Which Dutch actor was influenced by M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ns:m.0gct_ .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Dick Bruna",
    "recursionDepth": 20
  },
  {
    "questionIdx": 18446,
    "questionWithBrackets": "Did [Roscoe Arbuckle] influence [The Circus]'s male editor",
    "questionPatternModEntities": "Did M2 influence M1 's male editor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.011_mj .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.0k57l ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 156515,
    "questionWithBrackets": "What film editor did a screenwriter's country of nationality employ",
    "questionPatternModEntities": "What film editor did a screenwriter 's country of nationality employ",
    "questionTemplate": "What [NP_SIMPLE] did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 a ns:film.writer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Mark Aitchison Young",
    "recursionDepth": 20
  },
  {
    "questionIdx": 113416,
    "questionWithBrackets": "Were [Between Shovers] and [The Immigrant] written by [Behind the Screen]'s editor",
    "questionPatternModEntities": "Were M1 and M2 written by M0 's editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.03b1dk .\nns:m.05c34r ns:film.film.written_by ?x0 .\nns:m.0jvw0 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 20
  },
  {
    "questionIdx": 237408,
    "questionWithBrackets": "Who was influenced by [Tetsuo II: Body Hammer]'s writer and art director",
    "questionPatternModEntities": "Who was influenced by M1 's writer and art director",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x1 ns:film.writer.film ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 20
  }
]