[
  {
    "questionIdx": 121077,
    "questionWithBrackets": "Were [Mere Yaar Ki Shaadi Hai] and [\u2026and there wasn\u2019t everafter\u2026] executive produced by a costume designer and edited by a film editor",
    "questionPatternModEntities": "Were M2 and M3 executive produced by a costume designer and edited by a film editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x1 a ns:film.editor .\nns:m.0cc744m ns:film.film.edited_by ?x1 .\nns:m.0cc744m ns:film.film.executive_produced_by ?x0 .\nns:m.0kv551 ns:film.film.edited_by ?x1 .\nns:m.0kv551 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 ?x0 .\nM2 P1 ?x1 .\nM3 P0 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 184762,
    "questionWithBrackets": "What was written by [Red Beard]'s editor and produced by [A Global Affair]'s art director's employer",
    "questionPatternModEntities": "What was written by M0 's editor and produced by M1 's art director 's employer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x3 .\n?x2 ns:film.editor.film ns:m.01j5x_ .\n?x3 ns:film.film_art_director.films_art_directed ns:m.09gldq6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M0 .\n?x2 P3 ?x3 .\n?x3 P4 M1\n}",
    "expectedResponse": "Kagemusha; Tora! Tora! Tora!",
    "recursionDepth": 34
  },
  {
    "questionIdx": 48082,
    "questionWithBrackets": "Was [Blood Flood] produced by, written by, and edited by a French cinematographer",
    "questionPatternModEntities": "Was M2 produced by , written by , and edited by a French cinematographer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0crvhdl ns:film.film.edited_by ?x0 .\nns:m.0crvhdl ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0crvhdl ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 52300,
    "questionWithBrackets": "Was [Der 7bte Zwerg]'s prequel executive produced by, written by, and directed by a film producer",
    "questionPatternModEntities": "Was M0 's prequel executive produced by , written by , and directed by a film producer",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.sequel ns:m.0wsv496 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 125982,
    "questionWithBrackets": "Were [The Campaign], [Two Evil Eyes], [The Sect], [Creepers], and [Trauma] produced by [Deep Red]'s writer and star",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 produced by M0 's writer and star",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0bntlf .\n?x0 ns:film.writer.film ns:m.0bntlf .\nns:m.02rns0q ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bbt9g ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bm15g ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0dwcs4 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0hgnvc3 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 76083,
    "questionWithBrackets": "Was [Shaw Brothers Studio] a film producer that [The House of 72 Tenants] was distributed by and [The One-Armed Swordsman] was distributed by",
    "questionPatternModEntities": "Was M0 a film producer that M2 was distributed by and M3 was distributed by",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.01b83_ a ns:film.producer .\nns:m.01b83_ ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04j0mv5 .\nns:m.01b83_ ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0kv870\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 145148,
    "questionWithBrackets": "What did [Mary, Mother of Jesus]'s female executive producer's sibling found and [Mark Shriver] found",
    "questionPatternModEntities": "What did M1 's female executive producer 's sibling found and M0 found",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.02frx4 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.producer.films_executive_produced ns:m.0b81m4 .\n?x2 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\n?x2 P3 M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Peace Corps",
    "recursionDepth": 34
  },
  {
    "questionIdx": 38,
    "questionWithBrackets": "Did [1941] star a male person's child and star [Dory Manzour]",
    "questionPatternModEntities": "Did M2 star a male person 's child and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.05zppz .\nns:m.04t6fk ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04t6fk ns:film.film.starring/ns:film.performance.actor ns:m.0v8zl19\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 116640,
    "questionWithBrackets": "Were [Federal Art Project], [Tennessee Valley Authority], [Fannie Mae], [Public Works Administration], [United Service Organizations], and [Home Owners' Loan Corporation] founded by a parent of [Anna Roosevelt Halsted]",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , M5 , and M6 founded by a parent of M0",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.026jn1 .\nns:m.019r_w ns:organization.organization.founders ?x0 .\nns:m.01qxf8 ns:organization.organization.founders ?x0 .\nns:m.02np5x ns:organization.organization.founders ?x0 .\nns:m.0fh2p ns:organization.organization.founders ?x0 .\nns:m.0fh30 ns:organization.organization.founders ?x0 .\nns:m.0fh3h ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0 .\nM3 P1 ?x0 .\nM4 P1 ?x0 .\nM5 P1 ?x0 .\nM6 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 18841,
    "questionWithBrackets": "Did [Saving Mr. Banks] star [Anna Roberts] and star a person's British sibling",
    "questionPatternModEntities": "Did M2 star M3 and star a person 's British sibling",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0k3lpxc ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0k3lpxc ns:film.film.starring/ns:film.performance.actor ns:m.0w22dpd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 18099,
    "questionWithBrackets": "Did [Rick Sloane] write, edit, and produce a prequel of a film",
    "questionPatternModEntities": "Did M1 write , edit , and produce a prequel of a film",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 a ns:film.film .\nns:m.09nlnc ns:film.editor.film ?x0 .\nns:m.09nlnc ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.09nlnc ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 150644,
    "questionWithBrackets": "What did a screenwriter found and a cinematographer of [Night Owls] and [Brats] found",
    "questionPatternModEntities": "What did a screenwriter found and a cinematographer of M1 and M2 found",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 a ns:film.writer .\n?x2 ns:film.cinematographer.film ns:m.026ktnx .\n?x2 ns:film.cinematographer.film ns:m.06rj44\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1 .\n?x2 P1 M2\n}",
    "expectedResponse": "Liberty Films",
    "recursionDepth": 34
  },
  {
    "questionIdx": 16717,
    "questionWithBrackets": "Did [PepsiCo] employ a person's American spouse and employ [Peter N. Kellogg]",
    "questionPatternModEntities": "Did M2 employ a person 's American spouse and employ M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nns:m.04htfd ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.04htfd ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03wxrsx\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 185402,
    "questionWithBrackets": "What was written by a person's child and parent and directed by [K\u00e1tia Lund]",
    "questionPatternModEntities": "What was written by a person 's child and parent and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.0ckgy4 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "News from a Personal War",
    "recursionDepth": 34
  },
  {
    "questionIdx": 149948,
    "questionWithBrackets": "What did a film producer found and a writer of [Mei and the Kittenbus] and [The Castle of Cagliostro] found",
    "questionPatternModEntities": "What did a film producer found and a writer of M1 and M2 found",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 a ns:film.producer .\n?x2 ns:film.writer.film ns:m.0cwczl .\n?x2 ns:film.writer.film ns:m.0mbq3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1 .\n?x2 P1 M2\n}",
    "expectedResponse": "Studio Ghibli",
    "recursionDepth": 34
  },
  {
    "questionIdx": 226820,
    "questionWithBrackets": "Who was a French screenwriter that [NYAV Post] was founded by and employed",
    "questionPatternModEntities": "Who was a French screenwriter that M2 was founded by and employed",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0clfr7 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0clfr7 .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Michael Sinterniklaas",
    "recursionDepth": 34
  },
  {
    "questionIdx": 40861,
    "questionWithBrackets": "Did an Italian film editor's parent play [Frank Baylies] and play [Douglas Michelson]",
    "questionPatternModEntities": "Did a Italian film editor 's parent play M0 and play M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0n5d7nq .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0y8kjp_ .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.editor .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M3 .\n?x1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 14655,
    "questionWithBrackets": "Did [Merle Oberon] marry a film editor and marry [White Feather]'s male cinematographer",
    "questionPatternModEntities": "Did M3 marry a film editor and marry M2 's male cinematographer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x1 ns:film.cinematographer.film ns:m.064n_mb .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ns:m.017tkv != ?x0 ) .\nFILTER ( ns:m.017tkv != ?x1 ) .\nns:m.017tkv ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.017tkv ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\n?x1 P1 M2 .\nFILTER ( M3 != ?x0 ) .\nFILTER ( M3 != ?x1 ) .\nM3 P2 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 8045,
    "questionWithBrackets": "Did [Gabbar Singh] star [Jana Sena Party]'s founder and star [The Boondock Saints]'s producer's spouse",
    "questionPatternModEntities": "Did M2 star M1 's founder and star M0 's producer 's spouse",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02kp5p .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0_yfg74 .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0g9xnr0 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0g9xnr0 ns:film.film.starring/ns:film.performance.actor ?x2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x2 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM2 P3 ?x2\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 29400,
    "questionWithBrackets": "Did a character marry [James Dougherty] and influence [I Am Because We Are]'s female executive producer",
    "questionPatternModEntities": "Did a character marry M1 and influence M2 's female executive producer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.07g_2g .\n?x1 ns:film.producer.films_executive_produced ns:m.03cfts5 .\n?x1 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ns:m.07g_2g )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 178339,
    "questionWithBrackets": "What was executive produced by and produced by a costume designer, editor, and producer of [The Brown Bunny]",
    "questionPatternModEntities": "What was executive produced by and produced by a costume designer , editor , and producer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.editor.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0 .\n?x1 P4 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 35
  },
  {
    "questionIdx": 170524,
    "questionWithBrackets": "What was directed by [Wes Craven], directed by an actor, and executive produced by [Ara Katz]",
    "questionPatternModEntities": "What was directed by M1 , directed by a actor , and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.013zyw .\n?x0 ns:film.film.executive_produced_by ns:m.04mv77t .\n?x1 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x1 a M2\n}",
    "expectedResponse": "Paris, je t'aime",
    "recursionDepth": 35
  },
  {
    "questionIdx": 219111,
    "questionWithBrackets": "Who influenced a Chinese film director and was influenced by [Man Ray] and [Tom of Finland]",
    "questionPatternModEntities": "Who influenced a Chinese film director and was influenced by M1 and M2",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.024hjy .\n?x0 ns:influence.influence_node.influenced_by ns:m.0gskj .\n?x1 a ns:film.director .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M4 .\n?x1 a M3\n}",
    "expectedResponse": "Andy Warhol",
    "recursionDepth": 35
  },
  {
    "questionIdx": 98233,
    "questionWithBrackets": "Was a film editor that [Jacques Demy] influenced, married, and was influenced by [Agn\u00e8s Varda]",
    "questionPatternModEntities": "Was a film editor that M2 influenced , married , and was influenced by M0",
    "questionTemplate": "Was a [NP_SIMPLE] that [entity] [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.01vylt != ns:m.046dxx ) .\nns:m.01vylt a ns:film.editor .\nns:m.01vylt ns:influence.influence_node.influenced ns:m.046dxx .\nns:m.01vylt ns:influence.influence_node.influenced_by ns:m.046dxx .\nns:m.01vylt ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.046dxx\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M2 ) .\nM0 P0 M2 .\nM0 P1 M2 .\nM0 P2 M2 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 70035,
    "questionWithBrackets": "Was [On the Green Carpet] produced by and directed by an art director of a prequel of a film",
    "questionPatternModEntities": "Was M1 produced by and directed by a art director of a prequel of a film",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ?x1 .\n?x1 ns:film.film.sequel ?x2 .\n?x2 a ns:film.film .\nns:m.04yblxq ns:film.film.directed_by ?x0 .\nns:m.04yblxq ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 3488,
    "questionWithBrackets": "Did [Cabuche]'s actor influence a costume designer and influence a director of [Offside]",
    "questionPatternModEntities": "Did M0 's actor influence a costume designer and influence a director of M2",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.010q2_6n .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ?x2 .\n?x1 a ns:film.film_costumer_designer .\n?x2 ns:film.director.film ns:m.0273335\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 M0 .\n?x1 a M1 .\n?x2 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 124800,
    "questionWithBrackets": "Were [Somewhere] and [The Bling Ring] produced by and directed by a film's director's child",
    "questionPatternModEntities": "Were M1 and M2 produced by and directed by a film 's director 's child",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.director.film ?x2 .\n?x2 a ns:film.film .\nns:m.06_vlp9 ns:film.film.directed_by ?x0 .\nns:m.06_vlp9 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0kbj11v ns:film.film.directed_by ?x0 .\nns:m.0kbj11v ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 150749,
    "questionWithBrackets": "What did a sibling of [Get on the Bus]'s star write, executive produce, and edit",
    "questionPatternModEntities": "What did a sibling of M0 's star write , executive produce , and edit",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.0cmdm1 .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 P4 M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Window on Your Present",
    "recursionDepth": 35
  },
  {
    "questionIdx": 185083,
    "questionWithBrackets": "What was written by a Chinese film director and executive produced by [Bai Ling] and [Edward Tian Suning]",
    "questionPatternModEntities": "What was written by a Chinese film director and executive produced by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.02lnhv .\n?x0 ns:film.film.executive_produced_by ns:m.04gc7wv .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.director .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M3 .\n?x1 a M2\n}",
    "expectedResponse": "Bodyguards and Assassins",
    "recursionDepth": 35
  },
  {
    "questionIdx": 43736,
    "questionWithBrackets": "Was [A Matter of Hair] directed, produced, and written by a Spanish sibling of [Eduardo Bajo Ulloa]",
    "questionPatternModEntities": "Was M2 directed , produced , and written by a Spanish sibling of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0cgh4s8 .\nFILTER ( ?x0 != ns:m.0cgh4s8 ) .\nns:m.02r55y1 ns:film.film.directed_by ?x0 .\nns:m.02r55y1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.02r55y1 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 81500,
    "questionWithBrackets": "Was [The Long and Short of It] executive produced by a screenwriter that [The House of the Devil] was edited by and starred",
    "questionPatternModEntities": "Was M2 executive produced by a screenwriter that M1 was edited by and starred",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.063yc35 .\n?x0 ns:film.editor.film ns:m.063yc35 .\nns:m.0kv96r ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 68349,
    "questionWithBrackets": "Was [Muktodhara] written by an art director's female spouse and directed by [Shiboprosad mukherjee]",
    "questionPatternModEntities": "Was M2 written by a art director 's female spouse and directed by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0ll0xhf ns:film.film.directed_by ns:m.010x1myz .\nns:m.0ll0xhf ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 32387,
    "questionWithBrackets": "Did a female person executive produce [Malaysian Gods] and [This Longing] and edit [The Life of Rosa]",
    "questionPatternModEntities": "Did a female person executive produce M2 and M3 and edit M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.0j311ms .\n?x0 ns:film.producer.films_executive_produced ns:m.05q7dmq .\n?x0 ns:film.producer.films_executive_produced ns:m.05q9j91 .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  }
]