[
  {
    "questionIdx": 9058,
    "questionWithBrackets": "Did [H. Gifford Fong], [Johann Wolfgang von Goethe], [William Godwin], [Samuel Taylor Coleridge], and [Mary Wollstonecraft] influence a character's female sibling",
    "questionPatternModEntities": "Did M2 , M3 , M4 , M5 , and M6 influence a character 's female sibling",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:fictional_universe.fictional_character .\nFILTER ( ?x0 != ?x1 ) .\nns:m.011zsy ns:influence.influence_node.influenced ?x0 .\nns:m.042q3 ns:influence.influence_node.influenced ?x0 .\nns:m.04_cw ns:influence.influence_node.influenced ?x0 .\nns:m.05w58sv ns:influence.influence_node.influenced ?x0 .\nns:m.078w2 ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0 .\nM6 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 82220,
    "questionWithBrackets": "Was [The Rain People] written by a film editor that executive produced [Goosed] and wrote [Apocalypse Now Redux]",
    "questionPatternModEntities": "Was M3 written by a film editor that executive produced M2 and wrote M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.producer.films_executive_produced ns:m.0dl7yl1 .\n?x0 ns:film.writer.film ns:m.02p5_hn .\nns:m.0ds_t_ ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 81029,
    "questionWithBrackets": "Was [The Heifer] edited by [Rudolfo Wedeles] and executive produced by a film producer's Spanish parent",
    "questionPatternModEntities": "Was M2 edited by M3 and executive produced by a film producer 's Spanish parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x1 a ns:film.producer .\nns:m.03qd025 ns:film.film.edited_by ns:m.0n4c_6_ .\nns:m.03qd025 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 135883,
    "questionWithBrackets": "What Swedish male film producer was influenced by [S\u00f8ren Kierkegaard] and influenced [John Waters]",
    "questionPatternModEntities": "What Swedish male film producer was influenced by M2 and influenced M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ns:m.02yy_j .\n?x0 ns:influence.influence_node.influenced_by ns:m.06qvh .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 P3 M4 .\n?x0 a M0\n}",
    "expectedResponse": "Ingmar Bergman",
    "recursionDepth": 36
  },
  {
    "questionIdx": 125824,
    "questionWithBrackets": "Were [The Big Gay Musical] and [Year of the Nail] edited by and directed by a film editor's Mexican spouse",
    "questionPatternModEntities": "Were M2 and M3 edited by and directed by a film editor 's Mexican spouse",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.editor .\nFILTER ( ?x0 != ?x1 ) .\nns:m.04mwc27 ns:film.film.directed_by ?x0 .\nns:m.04mwc27 ns:film.film.edited_by ?x0 .\nns:m.05c131f ns:film.film.directed_by ?x0 .\nns:m.05c131f ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 122395,
    "questionWithBrackets": "Were [Paradise Road] and [She's the One] distributed by an employer of [Alan N. Braverman] and distributed by a film producer",
    "questionPatternModEntities": "Were M2 and M3 distributed by a employer of M1 and distributed by a film producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03hdl2x .\nns:m.06wqgh ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.06wqgh ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\nns:m.0bvvw7 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0bvvw7 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM3 P1 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 120364,
    "questionWithBrackets": "Were [Loneliness Is Soul], [Radioland Murders], [Maisy's Garden], [Blues for the Avatar], and [Rick's Canoe] written and executive produced by a film editor",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 written and executive produced by a film editor",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\nns:m.08ktmx ns:film.film.executive_produced_by ?x0 .\nns:m.08ktmx ns:film.film.written_by ?x0 .\nns:m.0zd5p8f ns:film.film.executive_produced_by ?x0 .\nns:m.0zd5p8f ns:film.film.written_by ?x0 .\nns:m.0zgygxr ns:film.film.executive_produced_by ?x0 .\nns:m.0zgygxr ns:film.film.written_by ?x0 .\nns:m.0znn7j_ ns:film.film.executive_produced_by ?x0 .\nns:m.0znn7j_ ns:film.film.written_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0 .\nM3 P0 ?x0 .\nM3 P1 ?x0 .\nM4 P0 ?x0 .\nM4 P1 ?x0 .\nM5 P0 ?x0 .\nM5 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 186363,
    "questionWithBrackets": "What was written, directed, and edited by [The Wizard of Speed and Time]'s director, producer, and costume designer",
    "questionPatternModEntities": "What was written , directed , and edited by M0 's director , producer , and costume designer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.director.film ns:m.083y0 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.083y0 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.083y0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M0 .\n?x1 P5 M0\n}",
    "expectedResponse": "The Wizard of Speed and Time; Animato",
    "recursionDepth": 36
  },
  {
    "questionIdx": 150201,
    "questionWithBrackets": "What did a male art director of [Edmond Was a Donkey] write, executive produce, and direct",
    "questionPatternModEntities": "What did a male art director of M1 write , executive produce , and direct",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0k3d95c .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "Mister Cok",
    "recursionDepth": 36
  },
  {
    "questionIdx": 176412,
    "questionWithBrackets": "What was executive produced by [Edward L. Montoro] and directed by [Porno Holocaust]'s director, cinematographer, and star",
    "questionPatternModEntities": "What was executive produced by M0 and directed by M1 's director , cinematographer , and star",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.02qfpxz .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.04jbf3q .\n?x1 ns:film.cinematographer.film ns:m.04jbf3q .\n?x1 ns:film.director.film ns:m.04jbf3q\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 P4 M1\n}",
    "expectedResponse": "Anthropophagous",
    "recursionDepth": 36
  },
  {
    "questionIdx": 47983,
    "questionWithBrackets": "Was [Black Book] directed by a Dutch actor and executive produced by [Andreas Schmid] and [Carl Woebcken]",
    "questionPatternModEntities": "Was M2 directed by a Dutch actor and executive produced by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.059j2 .\nns:m.0b40y4 ns:film.film.directed_by ?x0 .\nns:m.0b40y4 ns:film.film.executive_produced_by ns:m.064kww4 .\nns:m.0b40y4 ns:film.film.executive_produced_by ns:m.0k4h2v\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 M3 .\nM2 P1 M4 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 118007,
    "questionWithBrackets": "Were [Hong Kong Ghost Stories] and [Pulse Pounders] directed by and executive produced by a film's prequel's producer",
    "questionPatternModEntities": "Were M1 and M2 directed by and executive produced by a film 's prequel 's producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 ns:film.film.sequel ?x2 .\n?x2 a ns:film.film .\nns:m.0b6krjv ns:film.film.directed_by ?x0 .\nns:m.0b6krjv ns:film.film.executive_produced_by ?x0 .\nns:m.0hz8pl_ ns:film.film.directed_by ?x0 .\nns:m.0hz8pl_ ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 20536,
    "questionWithBrackets": "Did [Terrence Malick] executive produce [The Medallion], executive produce [Rob-B-Hood], and write a film",
    "questionPatternModEntities": "Did M1 executive produce M2 , executive produce M3 , and write a film",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0kvqv ns:film.producer.films_executive_produced ns:m.02_sqq .\nns:m.0kvqv ns:film.producer.films_executive_produced ns:m.0btf7x .\nns:m.0kvqv ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 M2 .\nM1 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 214785,
    "questionWithBrackets": "Who did [Philippa Scott]'s male spouse's female spouse marry and influence",
    "questionPatternModEntities": "Who did M3 's male spouse 's female spouse marry and influence",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.gender ns:m.05zppz .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.09v6q4s .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.09v6q4s )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 M1 .\n?x2 P1 M3 .\n?x2 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M3 )\n}",
    "expectedResponse": "Kingsley Amis",
    "recursionDepth": 36
  },
  {
    "questionIdx": 125008,
    "questionWithBrackets": "Were [Stars 80] and [Prehysteria!] directed by and produced by a French film director's child",
    "questionPatternModEntities": "Were M2 and M3 directed by and produced by a French film director 's child",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.director .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\nns:m.07j8r5 ns:film.film.directed_by ?x0 .\nns:m.07j8r5 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0ngn633 ns:film.film.directed_by ?x0 .\nns:m.0ngn633 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 216453,
    "questionWithBrackets": "Who did an Italian employee of [Maker Studios] influence and [La Toya Jackson]'s sibling influence",
    "questionPatternModEntities": "Who did a Italian employee of M2 influence and M1 's sibling influence",
    "questionTemplate": "Who did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.013v5j .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0h3m6mm .\n?x2 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x1 != ns:m.013v5j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x2 P2 M2 .\n?x2 P3 M3 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Lady Gaga",
    "recursionDepth": 36
  },
  {
    "questionIdx": 174341,
    "questionWithBrackets": "What was edited by a film editor that [The ABCs of Death] was written by and directed by [Glenn McQuaid]",
    "questionPatternModEntities": "What was edited by a film editor that M2 was written by and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.08tkflp .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 a ns:film.editor .\n?x1 ns:film.writer.film ns:m.0j7n68k\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "V/H/S",
    "recursionDepth": 36
  },
  {
    "questionIdx": 174499,
    "questionWithBrackets": "What was edited by a star of [Pop Skull] and [24 Exposures] and edited by [Rangga Maya Barack-Evans]'s spouse",
    "questionPatternModEntities": "What was edited by a star of M0 and M1 and edited by M2 's spouse",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0cs86r8 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0zv_9rf .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hls1rq .\nFILTER ( ?x2 != ns:m.0hls1rq )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 P1 M0 .\n?x1 P1 M1 .\n?x2 P2 M2 .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "V/H/S/2",
    "recursionDepth": 36
  },
  {
    "questionIdx": 80062,
    "questionWithBrackets": "Was [The Chaplin Revue] distributed by [Warner Bros. Entertainment], produced by [Sleeping Betty]'s editor, and distributed by [United Artists]",
    "questionPatternModEntities": "Was M1 distributed by M2 , produced by M0 's editor , and distributed by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.09gjc4k .\nns:m.02vl0sm ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.017jv5 .\nns:m.02vl0sm ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.086k8 .\nns:m.02vl0sm ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 36
  },
  {
    "questionIdx": 136831,
    "questionWithBrackets": "What actor was a female Canadian film director that edited [P4W: Prison For Women] and [Hookers...On Davie]",
    "questionPatternModEntities": "What actor was a female Canadian film director that edited M2 and M3",
    "questionTemplate": "What [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:film.director .\n?x0 ns:film.editor.film ns:m.0c5j4b3 .\n?x0 ns:film.editor.film ns:m.0c5vgtt .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 P2 M5 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Holly Dale",
    "recursionDepth": 36
  },
  {
    "questionIdx": 128906,
    "questionWithBrackets": "Were [Unforgivable Blackness] and [The Dust Bowl] produced by and executive produced by a film director's parent's spouse",
    "questionPatternModEntities": "Were M1 and M2 produced by and executive produced by a film director 's parent 's spouse",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.director .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0264ttw ns:film.film.executive_produced_by ?x0 .\nns:m.0264ttw ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0nbv85d ns:film.film.executive_produced_by ?x0 .\nns:m.0nbv85d ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 16634,
    "questionWithBrackets": "Did [Pauline Kael] influence a male writer of [Django Unchained] and marry a cinematographer",
    "questionPatternModEntities": "Did M3 influence a male writer of M0 and marry a cinematographer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0gwjw0c .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 a ns:film.cinematographer .\nFILTER ( ns:m.01tgbf != ?x1 ) .\nns:m.01tgbf ns:influence.influence_node.influenced ?x0 .\nns:m.01tgbf ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 a M2 .\nFILTER ( M3 != ?x1 ) .\nM3 P2 ?x0 .\nM3 P3 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 36
  },
  {
    "questionIdx": 219436,
    "questionWithBrackets": "Who influenced a parent and spouse of [David von Schlegell] and influenced [Ostensibly]'s star",
    "questionPatternModEntities": "Who influenced a parent and spouse of M1 and influenced M2 's star",
    "questionTemplate": "Who [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ?x2 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09k4jvh .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.09k4jvh .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.0_cq5vy .\nFILTER ( ?x1 != ns:m.09k4jvh )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x2 P3 M2 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Wallace Stevens",
    "recursionDepth": 36
  },
  {
    "questionIdx": 215654,
    "questionWithBrackets": "Who did a cinematographer that [One Hundred and One Nights] and [Les dites cariatides bis] were directed by marry and influence",
    "questionPatternModEntities": "Who did a cinematographer that M2 and M3 were directed by marry and influence",
    "questionTemplate": "Who did a [NP_SIMPLE] that [entity] and [entity] were [VP_SIMPLE] by [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.cinematographer .\n?x1 ns:film.director.film ns:m.05q6jgk .\n?x1 ns:film.director.film ns:m.0hz1xxb .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P2 M3 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 36
  },
  {
    "questionIdx": 124227,
    "questionWithBrackets": "Were [Scenes from a Marriage] and [Sally and Freedom] produced by a Swedish person influenced by [August Strindberg] and [D. W. Griffith]",
    "questionPatternModEntities": "Were M4 and M5 produced by a Swedish person influenced by M1 and M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.026ck .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d5_f .\n?x0 ns:people.person.nationality ns:m.0d0vqn .\nns:m.037ld1 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bxl9s3 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\nM4 P2 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 180229,
    "questionWithBrackets": "What was founded by [Yogi the Easter Bear]'s executive producer and founded by a film's sequel's producer",
    "questionPatternModEntities": "What was founded by M1 's executive producer and founded by a film 's sequel 's producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x3 .\n?x2 ns:film.producer.films_executive_produced ns:m.06mccp .\n?x3 ns:film.film.prequel ?x4 .\n?x4 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 P1 ?x3 .\n?x2 P2 M1 .\n?x3 P3 ?x4 .\n?x4 a M0\n}",
    "expectedResponse": "Hanna-Barbera",
    "recursionDepth": 37
  },
  {
    "questionIdx": 172446,
    "questionWithBrackets": "What was distributed by [Newmarket Films] and distributed by a film distributor that a film distributor acquired",
    "questionPatternModEntities": "What was distributed by M0 and distributed by a film distributor that a film distributor acquired",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] that a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.02nssb .\n?x1 a ns:film.film_distributor .\n?x1 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x2 .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x1 a M1 .\n?x2 a M1\n}",
    "expectedResponse": "Memento",
    "recursionDepth": 37
  },
  {
    "questionIdx": 179391,
    "questionWithBrackets": "What was founded by [Buddy Squires] and founded by a producer, executive producer, and director of [The Central Park Five]",
    "questionPatternModEntities": "What was founded by M0 and founded by a producer , executive producer , and director of M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.0jt29j .\n?x1 ns:film.director.film ns:m.0js8x3_ .\n?x1 ns:film.producer.films_executive_produced ns:m.0js8x3_ .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0js8x3_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Florentine Films",
    "recursionDepth": 37
  },
  {
    "questionIdx": 8204,
    "questionWithBrackets": "Did [George Carlin] and [Don Rickles] influence [Dan Cochran]'s actor and influence a film's executive producer",
    "questionPatternModEntities": "Did M2 and M3 influence M0 's actor and influence a film 's executive producer",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0j36zlx .\n?x1 ns:film.producer.films_executive_produced ?x2 .\n?x2 a ns:film.film .\nns:m.013tjc ns:influence.influence_node.influenced ?x0 .\nns:m.013tjc ns:influence.influence_node.influenced ?x1 .\nns:m.014z8v ns:influence.influence_node.influenced ?x0 .\nns:m.014z8v ns:influence.influence_node.influenced ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 a M1 .\nM2 P2 ?x0 .\nM2 P2 ?x1 .\nM3 P2 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 145540,
    "questionWithBrackets": "What did [Niels Dekker] and [L\u00e9on Verkade] edit and a film's producer and art director direct",
    "questionPatternModEntities": "What did M0 and M1 edit and a film 's producer and art director direct",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0gwvlhx .\n?x0 ns:film.film.edited_by ns:m.0w_h96_ .\n?x1 ns:film.film_art_director.films_art_directed ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 37
  }
]