[
  {
    "questionIdx": 33439,
    "questionWithBrackets": "Did a film distributor acquire a child and parent of [KML II Holdings Co Ltd]",
    "questionPatternModEntities": "Did a film distributor acquire a child and parent of M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09mw2cr .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.09mw2cr\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 87325,
    "questionWithBrackets": "Was [Xiu Xiu: The Sent Down Girl] written by and executive produced by [Pierre Sarrazin]'s spouse",
    "questionPatternModEntities": "Was M1 written by and executive produced by M0 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0b79gql .\nFILTER ( ?x0 != ns:m.0b79gql ) .\nns:m.08chpb ns:film.film.executive_produced_by ?x0 .\nns:m.08chpb ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 156427,
    "questionWithBrackets": "What film editor did [A Place for Paedophiles]'s prequel's distributor's employee marry",
    "questionPatternModEntities": "What film editor did M1 's prequel 's distributor 's employee marry",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ?x3 .\n?x3 ns:film.film.sequel ns:m.0ddgv56 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Tony Scott",
    "recursionDepth": 25
  },
  {
    "questionIdx": 47297,
    "questionWithBrackets": "Was [Battlefield Earth]'s British cinematographer's British sibling [Sandy Nuttgens]",
    "questionPatternModEntities": "Was M1 's British cinematographer 's British sibling M2",
    "questionTemplate": "Was [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0gzlb9 .\n?x0 ns:people.person.nationality ns:m.07ssc .\nFILTER ( ns:m.0416w7s != ?x0 ) .\nns:m.0416w7s ns:people.person.nationality ns:m.07ssc .\nns:m.0416w7s ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P0 M0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 68768,
    "questionWithBrackets": "Was [Napoleon III] [Fiona Prince]'s French Dutch sibling's child",
    "questionPatternModEntities": "Was M3 M0 's French Dutch sibling 's child",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.049fph7 .\nFILTER ( ?x0 != ns:m.049fph7 ) .\nns:m.0gxct ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2 .\nFILTER ( ?x0 != M0 ) .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 29941,
    "questionWithBrackets": "Did a cinematographer distribute [Road Runner a Go-Go] and distribute [The Feminist and the Fuzz]",
    "questionPatternModEntities": "Did a cinematographer distribute M1 and distribute M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04gvkmx .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0g4zl8s\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 172893,
    "questionWithBrackets": "What was edited and executive produced by a child of [Mary Louise Davis]",
    "questionPatternModEntities": "What was edited and executive produced by a child of M0",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0gxqyl1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0\n}",
    "expectedResponse": "Louis C.K.: Chewed Up",
    "recursionDepth": 25
  },
  {
    "questionIdx": 149044,
    "questionWithBrackets": "What did a cinematographer, star, and director of [Grindhouse] found",
    "questionPatternModEntities": "What did a cinematographer , star , and director of M0 found",
    "questionTemplate": "What did a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.084qpk .\n?x1 ns:film.cinematographer.film ns:m.084qpk .\n?x1 ns:film.director.film ns:m.084qpk\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Rolling Thunder Pictures; A Band Apart",
    "recursionDepth": 25
  },
  {
    "questionIdx": 143273,
    "questionWithBrackets": "What did [FVC Productions, Inc]'s parent found and [British Sky Broadcasting] found",
    "questionPatternModEntities": "What did M1 's parent found and M0 found",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.03p1p8r .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09n9b0x\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "SKY M\u00e9xico",
    "recursionDepth": 25
  },
  {
    "questionIdx": 216156,
    "questionWithBrackets": "Who did a male writer of [Lovers and Liars] and [Il Brigante Musolino] marry",
    "questionPatternModEntities": "Who did a male writer of M1 and M2 marry",
    "questionTemplate": "Who did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.writer.film ns:m.03wfpwd .\n?x1 ns:film.writer.film ns:m.0bq8sb .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Antonella Salerni; Chiara Rapaccini",
    "recursionDepth": 25
  },
  {
    "questionIdx": 221143,
    "questionWithBrackets": "Who married a Canadian employee of [Pereira and Luckman] and [Columbia University]",
    "questionPatternModEntities": "Who married a Canadian employee of M1 and M2",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01w5m .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.025dt2y .\n?x1 ns:people.person.nationality ns:m.0d060g .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Berta Isabel Aguilera; Anita Snyder",
    "recursionDepth": 25
  },
  {
    "questionIdx": 176726,
    "questionWithBrackets": "What was executive produced by [Junko's Shamisen]'s executive producer, writer, and art director",
    "questionPatternModEntities": "What was executive produced by M0 's executive producer , writer , and art director",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0fq6c0m .\n?x1 ns:film.producer.films_executive_produced ns:m.0fq6c0m .\n?x1 ns:film.writer.film ns:m.0fq6c0m\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Junko's Shamisen; Beasts in the Real World",
    "recursionDepth": 25
  },
  {
    "questionIdx": 217338,
    "questionWithBrackets": "Who executive produced, produced, and directed [It's Not About the Shawerma]",
    "questionPatternModEntities": "Who executive produced , produced , and directed M1",
    "questionTemplate": "Who [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.0zztylq .\n?x0 ns:film.producer.films_executive_produced ns:m.0zztylq .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0zztylq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 P2 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Rick Schmidt",
    "recursionDepth": 25
  },
  {
    "questionIdx": 13731,
    "questionWithBrackets": "Did [Macys Department Stores Inc] employ [Herbert Frank]'s Dutch German sibling",
    "questionPatternModEntities": "Did M3 employ M0 's Dutch German sibling",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.073jm1m .\nFILTER ( ?x0 != ns:m.073jm1m ) .\nns:m.09mldzd ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P1 M2 .\nFILTER ( ?x0 != M0 ) .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 70985,
    "questionWithBrackets": "Was [Patrick Drake] [Holly Sutton-Scorpio]'s female child's parent and child",
    "questionPatternModEntities": "Was M2 M1 's female child 's parent and child",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.02rdkd0 .\nns:m.0gw37x ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.0gw37x ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 25
  },
  {
    "questionIdx": 34852,
    "questionWithBrackets": "Did a film producer that [Malti's father] was played by marry [Punitha Prabhu]",
    "questionPatternModEntities": "Did a film producer that M1 was played by marry M2",
    "questionTemplate": "Did a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h8c1rt .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hktjd_ .\nFILTER ( ?x0 != ns:m.0hktjd_ )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 25
  },
  {
    "questionIdx": 148735,
    "questionWithBrackets": "What did a character write and [Michael Tollin] executive produce",
    "questionPatternModEntities": "What did a character write and M0 executive produce",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.0bgrsl .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:fictional_universe.fictional_character\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1\n}",
    "expectedResponse": "Norbit",
    "recursionDepth": 25
  },
  {
    "questionIdx": 54418,
    "questionWithBrackets": "Was [Everyone Is Older Than I Am] directed and edited by a film editor's child",
    "questionPatternModEntities": "Was M1 directed and edited by a film editor 's child",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.editor .\nns:m.011x833c ns:film.film.directed_by ?x0 .\nns:m.011x833c ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 149803,
    "questionWithBrackets": "What did a film distributor's employee executive produce and edit",
    "questionPatternModEntities": "What did a film distributor 's employee executive produce and edit",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M0\n}",
    "expectedResponse": "The Goonies; Reds",
    "recursionDepth": 26
  },
  {
    "questionIdx": 136656,
    "questionWithBrackets": "What actor that married [Jos\u00e9 Wilker] and [F\u00e1bio Jr.] married [Murilo Benicio]",
    "questionPatternModEntities": "What actor that married M1 and M2 married M3",
    "questionTemplate": "What [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02r6thr .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05f9f1g .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.07g7kn .\nFILTER ( ?x0 != ns:m.02r6thr ) .\nFILTER ( ?x0 != ns:m.05f9f1g ) .\nFILTER ( ?x0 != ns:m.07g7kn )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 ) .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Guilhermina Guinle",
    "recursionDepth": 26
  },
  {
    "questionIdx": 154412,
    "questionWithBrackets": "What female film director did an Italian film editor influence",
    "questionPatternModEntities": "What female film director did a Italian film editor influence",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 a ns:film.editor .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 a M2\n}",
    "expectedResponse": "Catherine Breillat",
    "recursionDepth": 26
  },
  {
    "questionIdx": 221400,
    "questionWithBrackets": "Who married a film director's male actor's sibling",
    "questionPatternModEntities": "Who married a film director 's male actor 's sibling",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ?x3 .\n?x2 ns:people.person.gender ns:m.05zppz .\n?x3 a ns:film.director .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x2 P3 M1 .\n?x3 a M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Vincent Dowling; Cornelia Hayes O'Herlihy",
    "recursionDepth": 26
  },
  {
    "questionIdx": 167964,
    "questionWithBrackets": "What was a company whose founder edited [For Ever Mozart] and [A Letter to Freddy Buache]",
    "questionPatternModEntities": "What was a company whose founder edited M1 and M2",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.editor.film ns:m.0479kqt .\n?x1 ns:film.editor.film ns:m.0660q7l\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2\n}",
    "expectedResponse": "Dziga Vertov Group",
    "recursionDepth": 26
  },
  {
    "questionIdx": 14009,
    "questionWithBrackets": "Did [Margaret Maldonado] and [Phoebe Cates] marry a screenwriter's sibling's sibling",
    "questionPatternModEntities": "Did M1 and M2 marry a screenwriter 's sibling 's sibling",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ns:m.0151fv != ?x0 ) .\nFILTER ( ns:m.0h5w73n != ?x0 ) .\nns:m.0151fv ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0h5w73n ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P0 ?x2 .\n?x2 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M2 != ?x0 ) .\nM1 P1 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 141353,
    "questionWithBrackets": "What costume designer was a film producer that [Rabindranath Tagore] and [Jean Renoir] influenced",
    "questionPatternModEntities": "What costume designer was a film producer that M2 and M3 influenced",
    "questionTemplate": "What [NP_SIMPLE] was a [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d0mbj .\n?x0 ns:influence.influence_node.influenced_by ns:m.0qdm8\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Satyajit Ray",
    "recursionDepth": 26
  },
  {
    "questionIdx": 140380,
    "questionWithBrackets": "What company did [Julie & Jack]'s director, costume designer, and cinematographer found",
    "questionPatternModEntities": "What company did M1 's director , costume designer , and cinematographer found",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0crtjmg .\n?x1 ns:film.director.film ns:m.0crtjmg .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0crtjmg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Moviehead Pictures",
    "recursionDepth": 26
  },
  {
    "questionIdx": 61179,
    "questionWithBrackets": "Was [Jean Genet Is Dead] produced by, edited by, and written by [Jeffery Peterson]",
    "questionPatternModEntities": "Was M0 produced by , edited by , and written by M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0gybg9q ns:film.film.edited_by ns:m.0pyt4yd .\nns:m.0gybg9q ns:film.film.produced_by|ns:film.film.production_companies ns:m.0pyt4yd .\nns:m.0gybg9q ns:film.film.written_by ns:m.0pyt4yd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 41634,
    "questionWithBrackets": "Did an actor's parent's child's sibling influence [Marcus Knecht]",
    "questionPatternModEntities": "Did a actor 's parent 's child 's sibling influence M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.0j3ddvv .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 a ns:film.actor .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 22446,
    "questionWithBrackets": "Did [The Magic Crystal] and [Cop Shop Babes] star a Chinese writer of [Flirting in the Air]",
    "questionPatternModEntities": "Did M2 and M3 star a Chinese writer of M0",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.010pfc_0 .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nns:m.02r85l1 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04j2h3k ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 49869,
    "questionWithBrackets": "Was [Charles IV of Spain] [Luc\u00eda Domingu\u00edn]'s male Italian Spanish sibling",
    "questionPatternModEntities": "Was M0 M1 's male Italian Spanish sibling",
    "questionTemplate": "Was [entity] [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.01360q != ns:m.0kk48sm ) .\nns:m.01360q ns:people.person.gender ns:m.05zppz .\nns:m.01360q ns:people.person.nationality ns:m.03rjj .\nns:m.01360q ns:people.person.nationality ns:m.06mkj .\nns:m.01360q ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0kk48sm\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M2 .\nM0 P1 M3 .\nM0 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 74870,
    "questionWithBrackets": "Was [Roy O. Disney] a film producer whose sibling founded [Walt Disney World Company] and [Disneyland Resort]",
    "questionPatternModEntities": "Was M2 a film producer whose sibling founded M0 and M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01zx_x .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.048g9h .\nFILTER ( ns:m.015yg9 != ?x0 ) .\nns:m.015yg9 a ns:film.producer .\nns:m.015yg9 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 26
  },
  {
    "questionIdx": 46631,
    "questionWithBrackets": "Was [Ashok Kumar] a cinematographer whose sibling married [Richard Roxburgh] and [Leena Chandavarkar]",
    "questionPatternModEntities": "Was M2 a cinematographer whose sibling married M0 and M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02zl4d .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0cd7g0 .\nFILTER ( ?x0 != ns:m.02zl4d ) .\nFILTER ( ?x0 != ns:m.0cd7g0 ) .\nFILTER ( ns:m.03f22dp != ?x0 ) .\nns:m.03f22dp a ns:film.cinematographer .\nns:m.03f22dp ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 26
  },
  {
    "questionIdx": 185804,
    "questionWithBrackets": "What was written by, directed by, and executive produced by [Glen Stephens]",
    "questionPatternModEntities": "What was written by , directed by , and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.0fppcqb .\n?x0 ns:film.film.executive_produced_by ns:m.0fppcqb .\n?x0 ns:film.film.written_by ns:m.0fppcqb\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0\n}",
    "expectedResponse": "Hoboken Hollow",
    "recursionDepth": 26
  },
  {
    "questionIdx": 149881,
    "questionWithBrackets": "What did a film editor that directed [Sethurama Iyer CBI]'s sequel edit",
    "questionPatternModEntities": "What did a film editor that directed M1 's sequel edit",
    "questionTemplate": "What did a [NP_SIMPLE] that [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 a ns:film.editor .\n?x1 ns:film.director.film ?x2 .\n?x2 ns:film.film.prequel ns:m.07ttd1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 a M0 .\n?x2 P2 M1\n}",
    "expectedResponse": "Evadaithe Nakenti",
    "recursionDepth": 26
  }
]