[
  {
    "questionIdx": 77500,
    "questionWithBrackets": "Was [Steven Spielberg] a film director that [Mimic]'s distributor and producer employed, [DreamWorks Studios] employed, and [Amblimation] was founded by",
    "questionPatternModEntities": "Was M1 a film director that M0 's distributor and producer employed , M3 employed , and M4 was founded by",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04d0ng .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.04d0ng .\nns:m.06pj8 a ns:film.director .\nns:m.06pj8 ns:organization.organization_founder.organizations_founded ns:m.052_rb .\nns:m.06pj8 ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.06pj8 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01gb54\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M3 .\nM1 P3 M4 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 205627,
    "questionWithBrackets": "Which film whose director, editor, and costume designer wrote [The Cow] and directed [Tehran, Tehran] and [Rumi's Kimia] was written by [Vahideh Mohammadifar]",
    "questionPatternModEntities": "Which film whose director , editor , and costume designer wrote M2 and directed M3 and M4 was written by M1",
    "questionTemplate": "Which [NP_SIMPLE] whose [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] and [entity] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.costume_design_by ?x1 .\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0gsyc62 .\n?x1 ns:film.director.film ns:m.0dg9sh1 .\n?x1 ns:film.director.film ns:m.0glrz7d .\n?x1 ns:film.writer.film ns:m.0dfx9n\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 a M0 .\n?x1 P4 M2 .\n?x1 P5 M3 .\n?x1 P5 M4\n}",
    "expectedResponse": "To Stay Alive",
    "recursionDepth": 50
  },
  {
    "questionIdx": 203370,
    "questionWithBrackets": "Which film editor was influenced by [Ill Met by Moonlight]'s director, influenced by [The Kingdom of Diamonds]'s director and costume designer, and influenced by a person",
    "questionPatternModEntities": "Which film editor was influenced by M2 's director , influenced by M1 's director and costume designer , and influenced by a person",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ?x3 .\n?x1 ns:film.director.film ns:m.098dmr .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.098dmr .\n?x2 ns:film.director.film ns:m.0h08ml4 .\n?x3 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 ?x3 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x2 P2 M2 .\n?x3 a M3\n}",
    "expectedResponse": "Martin Scorsese",
    "recursionDepth": 50
  },
  {
    "questionIdx": 119103,
    "questionWithBrackets": "Were [James Joyce] and [Machado de Assis] influenced by an Italian sibling of [Francesco Alighieri], influenced by [John Milton], and influenced by a screenwriter",
    "questionPatternModEntities": "Were M3 and M5 influenced by a Italian sibling of M0 , influenced by M4 , and influenced by a screenwriter",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0y5mvbz .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ns:m.0y5mvbz ) .\nns:m.01vc3g ns:influence.influence_node.influenced_by ?x0 .\nns:m.01vc3g ns:influence.influence_node.influenced_by ?x1 .\nns:m.01vc3g ns:influence.influence_node.influenced_by ns:m.0448r .\nns:m.03_87 ns:influence.influence_node.influenced_by ?x0 .\nns:m.03_87 ns:influence.influence_node.influenced_by ?x1 .\nns:m.03_87 ns:influence.influence_node.influenced_by ns:m.0448r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 a M2 .\nFILTER ( ?x0 != M0 ) .\nM3 P2 ?x0 .\nM3 P2 ?x1 .\nM3 P2 M4 .\nM5 P2 ?x0 .\nM5 P2 ?x1 .\nM5 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 151149,
    "questionWithBrackets": "What did an Italian art director's spouse's spouse executive produce, [David S. Sterling] produce, and a film editor direct",
    "questionPatternModEntities": "What did a Italian art director 's spouse 's spouse executive produce , M0 produce , and a film editor direct",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0hg_4f6 .\n?x1 a ns:film.editor .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x3 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x4 .\n?x4 a ns:film.film_art_director .\n?x4 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x2 != ?x3 ) .\nFILTER ( ?x3 != ?x4 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x2 .\n?x1 P3 ?x3 .\n?x2 a M3 .\n?x3 P3 ?x4 .\n?x4 P4 M2 .\n?x4 a M1 .\nFILTER ( ?x1 != ?x3 ) .\nFILTER ( ?x3 != ?x4 )\n}",
    "expectedResponse": "The Brides of Sodom",
    "recursionDepth": 50
  },
  {
    "questionIdx": 156353,
    "questionWithBrackets": "What film distributor was founded by [Sadie Warner]'s sibling, was founded by [Sam Warner] and [Albert Warner], and was founded by a film producer",
    "questionPatternModEntities": "What film distributor was founded by M4 's sibling , was founded by M1 and M2 , and was founded by a film producer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , was [VP_SIMPLE] by [entity] and [entity] , and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x0 ns:organization.organization.founders ns:m.02z15d .\n?x0 ns:organization.organization.founders ns:m.06qq7g .\n?x1 a ns:film.producer .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0hmz46s .\nFILTER ( ?x2 != ns:m.0hmz46s )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 a M3 .\n?x2 P1 M4 .\nFILTER ( ?x2 != M4 )\n}",
    "expectedResponse": "Warner Bros. Entertainment",
    "recursionDepth": 50
  },
  {
    "questionIdx": 80980,
    "questionWithBrackets": "Was [The Guilt Trip] executive produced by a female person's Canadian spouse, directed by [Hal Mohr], and written by [Dashiell Hammett]",
    "questionPatternModEntities": "Was M3 executive produced by a female person 's Canadian spouse , directed by M5 , and written by M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0gmff58 ns:film.film.directed_by ns:m.0f_zkz .\nns:m.0gmff58 ns:film.film.executive_produced_by ?x0 .\nns:m.0gmff58 ns:film.film.written_by ns:m.012cph\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM3 P3 ?x0 .\nM3 P4 M4 .\nM3 P5 M5\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 172219,
    "questionWithBrackets": "What was distributed by [Dimension Films], produced by a film's cinematographer, and produced by a film producer's founder and employee",
    "questionPatternModEntities": "What was distributed by M0 , produced by a film 's cinematographer , and produced by a film producer 's founder and employee",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.032j_n .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:organization.organization_founder.organizations_founded ?x3 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x3 .\n?x2 ns:film.cinematographer.film ?x4 .\n?x3 a ns:film.producer .\n?x4 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 ?x3 .\n?x1 P3 ?x3 .\n?x2 P4 ?x4 .\n?x3 a M1 .\n?x4 a M2\n}",
    "expectedResponse": "The Accidental Spy",
    "recursionDepth": 50
  }
]