[
  {
    "questionIdx": 774,
    "questionWithBrackets": "Did [Alan Becker] executive produce, edit, produce, write, and direct [Animation vs. Animator 1]'s sequel",
    "questionPatternModEntities": "Did M1 executive produce , edit , produce , write , and direct M0 's sequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.0108m1yx .\nns:m.0108mkjv ns:film.director.film ?x0 .\nns:m.0108mkjv ns:film.editor.film ?x0 .\nns:m.0108mkjv ns:film.producer.films_executive_produced ?x0 .\nns:m.0108mkjv ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.0108mkjv ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 175524,
    "questionWithBrackets": "What was edited, directed, executive produced, and written by [Bullet Ballet]'s cinematographer, star, and editor",
    "questionPatternModEntities": "What was edited , directed , executive produced , and written by M0 's cinematographer , star , and editor",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0b2981 .\n?x1 ns:film.cinematographer.film ns:m.0b2981 .\n?x1 ns:film.editor.film ns:m.0b2981\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 M0 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Tetsuo II: Body Hammer",
    "recursionDepth": 42
  },
  {
    "questionIdx": 29638,
    "questionWithBrackets": "Did a character's spouse's female actor executive produce, write, and produce [Words Unspoken]",
    "questionPatternModEntities": "Did a character 's spouse 's female actor executive produce , write , and produce M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:film.producer.films_executive_produced ns:m.0h2bj_j .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0h2bj_j .\n?x0 ns:film.writer.film ns:m.0h2bj_j .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:fictional_universe.fictional_character .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\n?x0 P3 ?x1 .\n?x0 P4 M1 .\n?x1 P5 ?x2 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 235201,
    "questionWithBrackets": "Who was employed by a production company's child, employed by [EA Mobile] and [Electronic Arts], and employed by [The Walt Disney Company]",
    "questionPatternModEntities": "Who was employed by a production company 's child , employed by M1 and M2 , and employed by M3",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01n073 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.064424 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.09b3v .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M4\n}",
    "expectedResponse": "Mitch Lasky",
    "recursionDepth": 42
  },
  {
    "questionIdx": 121335,
    "questionWithBrackets": "Were [Monsieur Verdoux] and [The Great Dictator] written by a British founder of [National Car Rental] and [Hollywood Athletic Club] and edited by [Willard Nico]",
    "questionPatternModEntities": "Were M3 and M5 written by a British founder of M0 and M1 and edited by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.07vlg_ .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0bbz0qs .\n?x0 ns:people.person.nationality ns:m.07ssc .\nns:m.02nmmc ns:film.film.edited_by ns:m.0g9ckvg .\nns:m.02nmmc ns:film.film.written_by ?x0 .\nns:m.0gy4z ns:film.film.edited_by ns:m.0g9ckvg .\nns:m.0gy4z ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0 .\nM3 P3 M4 .\nM5 P2 ?x0 .\nM5 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 236640,
    "questionWithBrackets": "Who was influenced by [Lucretius] and [Clifford Geertz], influenced [Bryan Reynolds], and married an art director of [The Sleep of Death]",
    "questionPatternModEntities": "Who was influenced by M2 and M3 , influenced M1 , and married a art director of M4",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.02pg9_9 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0303rh .\n?x0 ns:influence.influence_node.influenced_by ns:m.0987k .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0ddc7vx .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P1 M3 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M4 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Stephen Greenblatt",
    "recursionDepth": 42
  },
  {
    "questionIdx": 79639,
    "questionWithBrackets": "Was [The Brown Bunny] edited and produced by an art director that [Janine Loves Jenna] was executive produced by and starred",
    "questionPatternModEntities": "Was M2 edited and produced by a art director that M1 was executive produced by and starred",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.05kd8b8 .\n?x0 ns:film.producer.films_executive_produced ns:m.05kd8b8 .\nns:m.01n9cy ns:film.film.edited_by ?x0 .\nns:m.01n9cy ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 172540,
    "questionWithBrackets": "What was distributed by [Sony Pictures Entertainment], distributed by [Vampires: Los Muertos]'s cinematographer, and produced by a screenwriter's sibling",
    "questionPatternModEntities": "What was distributed by M0 , distributed by M1 's cinematographer , and produced by a screenwriter 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03rwz3 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:film.cinematographer.film ns:m.0frc02 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x3 a ns:film.writer .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x2 P3 ?x3 .\n?x3 a M2 .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "The Messengers",
    "recursionDepth": 42
  },
  {
    "questionIdx": 121473,
    "questionWithBrackets": "Were [Mucheettukalikkaarante Makal], [Nakshthrakoodaram], [Maru Malarchi], [Anantha Poongathe], [Indira], and [Padheyam] edited by a film director and edited by [V. T. Vijayan]",
    "questionPatternModEntities": "Were M1 , M3 , M4 , M5 , M6 , and M7 edited by a film director and edited by M2",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\nns:m.0121lkbc ns:film.film.edited_by ?x0 .\nns:m.0121lkbc ns:film.film.edited_by ns:m.03cldz0 .\nns:m.02pqkzr ns:film.film.edited_by ?x0 .\nns:m.02pqkzr ns:film.film.edited_by ns:m.03cldz0 .\nns:m.0b3wxm ns:film.film.edited_by ?x0 .\nns:m.0b3wxm ns:film.film.edited_by ns:m.03cldz0 .\nns:m.0by1y6r ns:film.film.edited_by ?x0 .\nns:m.0by1y6r ns:film.film.edited_by ns:m.03cldz0 .\nns:m.0cz9zfs ns:film.film.edited_by ?x0 .\nns:m.0cz9zfs ns:film.film.edited_by ns:m.03cldz0 .\nns:m.0hncgxx ns:film.film.edited_by ?x0 .\nns:m.0hncgxx ns:film.film.edited_by ns:m.03cldz0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P0 M2 .\nM3 P0 ?x0 .\nM3 P0 M2 .\nM4 P0 ?x0 .\nM4 P0 M2 .\nM5 P0 ?x0 .\nM5 P0 M2 .\nM6 P0 ?x0 .\nM6 P0 M2 .\nM7 P0 ?x0 .\nM7 P0 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 68677,
    "questionWithBrackets": "Was [Nadie te querr\u00e1 como yo] executive produced by, edited by, directed by, written by, and produced by a film editor",
    "questionPatternModEntities": "Was M1 executive produced by , edited by , directed by , written by , and produced by a film editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\nns:m.0gg7q5r ns:film.film.directed_by ?x0 .\nns:m.0gg7q5r ns:film.film.edited_by ?x0 .\nns:m.0gg7q5r ns:film.film.executive_produced_by ?x0 .\nns:m.0gg7q5r ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0gg7q5r ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 168806,
    "questionWithBrackets": "What was a production company whose employee and founder directed [Empty Socks] and [Alice Solves the Puzzle] and directed [Servants' Entrance]",
    "questionPatternModEntities": "What was a production company whose employee and founder directed M1 and M2 and directed M3",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.director.film ns:m.012gd4ts .\n?x1 ns:film.director.film ns:m.0281fyy .\n?x1 ns:film.director.film ns:m.0805n71\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P2 M2 .\n?x1 P2 M3\n}",
    "expectedResponse": "Walt Disney Animation Studios; The Walt Disney Company",
    "recursionDepth": 42
  },
  {
    "questionIdx": 55742,
    "questionWithBrackets": "Was [Frosted Chocolate Mouse] produced, directed, written, and edited by [Avenge But One Of My Two Eyes]'s editor, cinematographer, and writer",
    "questionPatternModEntities": "Was M1 produced , directed , written , and edited by M0 's editor , cinematographer , and writer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.06_96xj .\n?x0 ns:film.editor.film ns:m.06_96xj .\n?x0 ns:film.writer.film ns:m.06_96xj .\nns:m.0k3dcg7 ns:film.film.directed_by ?x0 .\nns:m.0k3dcg7 ns:film.film.edited_by ?x0 .\nns:m.0k3dcg7 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0k3dcg7 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 50842,
    "questionWithBrackets": "Was [Communist Party of China] founded by a spouse of [Symphony of Lianhua]'s Chinese star and founded by [Li Dazhao] and [Zhou Enlai]",
    "questionPatternModEntities": "Was M2 founded by a spouse of M1 's Chinese star and founded by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0v1gc0y .\n?x1 ns:people.person.nationality ns:m.0d05w3 .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02189 ns:organization.organization.founders ?x0 .\nns:m.02189 ns:organization.organization.founders ns:m.02d42c .\nns:m.02189 ns:organization.organization.founders ns:m.0dbk8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM2 P3 M3 .\nM2 P3 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 82709,
    "questionWithBrackets": "Was [The Tempest] executive produced by [Tino Puri], produced by [Jason K. Lau], and written by [Fool's Fire]'s director and costume designer",
    "questionPatternModEntities": "Was M1 executive produced by M2 , produced by M3 , and written by M0 's director and costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0c0l48s .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0c0l48s .\nns:m.04zx0rb ns:film.film.executive_produced_by ns:m.0gbpfl4 .\nns:m.04zx0rb ns:film.film.produced_by|ns:film.film.production_companies ns:m.0cpm0_7 .\nns:m.04zx0rb ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 M2 .\nM1 P3 ?x0 .\nM1 P4 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 234462,
    "questionWithBrackets": "Who was employed by [Code for America] and [Macromedia], founded [Allison Randal]'s employer, and was employed by [MySQL AB]",
    "questionPatternModEntities": "Who was employed by M1 and M2 , founded M4 's employer , and was employed by M3",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0180df .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0297wy .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0g5rs3z .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.02qzhwp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M4\n}",
    "expectedResponse": "Tim O'Reilly",
    "recursionDepth": 42
  },
  {
    "questionIdx": 81910,
    "questionWithBrackets": "Was [The Newburgh Sting] produced, edited, directed, written, and executive produced by a film director's spouse",
    "questionPatternModEntities": "Was M1 produced , edited , directed , written , and executive produced by a film director 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.director .\nFILTER ( ?x0 != ?x1 ) .\nns:m.010bdvxw ns:film.film.directed_by ?x0 .\nns:m.010bdvxw ns:film.film.edited_by ?x0 .\nns:m.010bdvxw ns:film.film.executive_produced_by ?x0 .\nns:m.010bdvxw ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.010bdvxw ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 171392,
    "questionWithBrackets": "What was directed by, edited by, written by, executive produced by, and produced by [Quentin Heilbroner]'s parent",
    "questionPatternModEntities": "What was directed by , edited by , written by , executive produced by , and produced by M0 's parent",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.010flpzw\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0\n}",
    "expectedResponse": "The Newburgh Sting",
    "recursionDepth": 42
  },
  {
    "questionIdx": 62165,
    "questionWithBrackets": "Was [Judd Apatow] influenced by [Bullets over Broadway]'s director and writer and influenced by a writer of [Mizugumo Monmon] and [A Woman Under the Influence]",
    "questionPatternModEntities": "Was M3 influenced by M2 's director and writer and influenced by a writer of M0 and M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0gjkg8 .\n?x0 ns:film.writer.film ns:m.0k5nq .\n?x1 ns:film.director.film ns:m.0421ng .\n?x1 ns:film.writer.film ns:m.0421ng .\nns:m.05ty4m ns:influence.influence_node.influenced_by ?x0 .\nns:m.05ty4m ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P0 M2 .\n?x1 P1 M2 .\nM3 P2 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 42
  },
  {
    "questionIdx": 236266,
    "questionWithBrackets": "Who was influenced by [Italianamerican]'s cinematographer's male spouse and was influenced by [Nancy Holt] and [Bruce Nauman]",
    "questionPatternModEntities": "Who was influenced by M4 's cinematographer 's male spouse and was influenced by M1 and M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.02679w3 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d97b .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.cinematographer.film ns:m.0b3_43 .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 ?x2 .\n?x2 P3 M4 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Peter Campus",
    "recursionDepth": 42
  },
  {
    "questionIdx": 235791,
    "questionWithBrackets": "Who was influenced by [Django Unchained]'s director, writer, and star and was influenced by [Hubert Selby, Jr.] and [Buddy Holly]",
    "questionPatternModEntities": "Who was influenced by M3 's director , writer , and star and was influenced by M1 and M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01vs_yt .\n?x0 ns:influence.influence_node.influenced_by ns:m.0nk02 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0gwjw0c .\n?x1 ns:film.director.film ns:m.0gwjw0c .\n?x1 ns:film.writer.film ns:m.0gwjw0c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M3 .\n?x1 P3 M3\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 42
  },
  {
    "questionIdx": 21979,
    "questionWithBrackets": "Did [The Departed] star a producer and editor of [The Gay Marriage Thing], star [Buddy Dolan], and star [Steve Scarfo]",
    "questionPatternModEntities": "Did M1 star a producer and editor of M0 , star M2 , and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.05p156z .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.05p156z .\nns:m.04vr_f ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.04vr_f ns:film.film.starring/ns:film.performance.actor ns:m.0gc853n .\nns:m.04vr_f ns:film.film.starring/ns:film.performance.actor ns:m.0vx3cxz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 42
  },
  {
    "questionIdx": 196663,
    "questionWithBrackets": "Which cinematographer was influenced by a Dutch film director, influenced by [David Lynch], and influenced by [David Cronenberg]",
    "questionPatternModEntities": "Which cinematographer was influenced by a Dutch film director , influenced by M1 , and influenced by M2",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.026dx .\n?x0 ns:influence.influence_node.influenced_by ns:m.026fd .\n?x1 a ns:film.director .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M4 .\n?x1 a M3\n}",
    "expectedResponse": "Takashi Miike",
    "recursionDepth": 42
  },
  {
    "questionIdx": 215030,
    "questionWithBrackets": "Who did [Tetsuo II: Body Hammer]'s director, cinematographer, and executive producer influence, [Rachel Weisz] marry, and [Terry Gilliam] influence",
    "questionPatternModEntities": "Who did M3 's director , cinematographer , and executive producer influence , M2 marry , and M1 influence",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.07h5d .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.014x77 .\n?x1 ns:film.cinematographer.film ns:m.0brs6b .\n?x1 ns:film.director.film ns:m.0brs6b .\n?x1 ns:film.producer.films_executive_produced ns:m.0brs6b .\nFILTER ( ?x0 != ns:m.014x77 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 43
  },
  {
    "questionIdx": 127083,
    "questionWithBrackets": "Were [The Hudsucker Proxy] and [A Serious Man] written by [Philippa Boyens], executive produced by a person, and directed by an actor",
    "questionPatternModEntities": "Were M2 and M4 written by M3 , executive produced by a person , and directed by a actor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x1 a ns:film.actor .\nns:m.016y0b ns:film.film.directed_by ?x1 .\nns:m.016y0b ns:film.film.executive_produced_by ?x0 .\nns:m.016y0b ns:film.film.written_by ns:m.02bfy5 .\nns:m.02r1c18 ns:film.film.directed_by ?x1 .\nns:m.02r1c18 ns:film.film.executive_produced_by ?x0 .\nns:m.02r1c18 ns:film.film.written_by ns:m.02bfy5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 ?x0 .\nM2 P1 M3 .\nM2 P2 ?x1 .\nM4 P0 ?x0 .\nM4 P1 M3 .\nM4 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 58671,
    "questionWithBrackets": "Was [Holiday Road] directed by a person, written by [Mary McIlwain] and [Daron Nefcy], and written by [Annalisa Bugliani]'s spouse",
    "questionPatternModEntities": "Was M2 directed by a person , written by M3 and M4 , and written by M0 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0h28b9t .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ns:m.0h28b9t ) .\nns:m.0h2lzkf ns:film.film.directed_by ?x1 .\nns:m.0h2lzkf ns:film.film.written_by ?x0 .\nns:m.0h2lzkf ns:film.film.written_by ns:m.0gdn72_ .\nns:m.0h2lzkf ns:film.film.written_by ns:m.0hb_989\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != M0 ) .\nM2 P1 ?x0 .\nM2 P1 M3 .\nM2 P1 M4 .\nM2 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 43
  },
  {
    "questionIdx": 115876,
    "questionWithBrackets": "Were [Donald in Mathmagic Land] and [The Brave Little Tailor] produced by a film director that founded [Walt Disney Pictures] and [The Walt Disney Company] and founded [Walt Disney Records]",
    "questionPatternModEntities": "Were M4 and M5 produced by a film director that founded M1 and M2 and founded M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01795t .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03tg5s .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.09b3v .\nns:m.06qr39 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.08nqgk ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\nM4 P1 ?x0 .\nM5 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 172502,
    "questionWithBrackets": "What was distributed by [RKO Pictures], produced by an art director, and distributed by [Mystery of the Wax Museum]'s distributor and producer",
    "questionPatternModEntities": "What was distributed by M0 , produced by a art director , and distributed by M1 's distributor and producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0k9ctht .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.06ljyr .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.06ljyr .\n?x2 a ns:film.film_art_director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x2 a M2\n}",
    "expectedResponse": "Citizen Kane",
    "recursionDepth": 43
  }
]