[
  {
    "questionIdx": 8939,
    "questionWithBrackets": "Did [Gregory Bateson] influence a film editor that married [Norris Church Mailer] and [Teiji Ito] and marry [Lois Cammack]",
    "questionPatternModEntities": "Did M3 influence a film editor that married M1 and M2 and marry M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bmd3bb .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0fss6y .\nFILTER ( ?x0 != ns:m.0bmd3bb ) .\nFILTER ( ?x0 != ns:m.0fss6y ) .\nFILTER ( ns:m.01452x != ns:m.0j6b62k ) .\nns:m.01452x ns:influence.influence_node.influenced ?x0 .\nns:m.01452x ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j6b62k\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 ) .\nFILTER ( M3 != M4 ) .\nM3 P0 M4 .\nM3 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 238305,
    "questionWithBrackets": "Who was influenced by a film editor and influenced by [Tetsuo II: Body Hammer]'s art director, director, and executive producer",
    "questionPatternModEntities": "Who was influenced by a film editor and influenced by M2 's art director , director , and executive producer",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 a ns:film.editor .\n?x2 ns:film.director.film ns:m.0brs6b .\n?x2 ns:film.film_art_director.films_art_directed ns:m.0brs6b .\n?x2 ns:film.producer.films_executive_produced ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 P1 M2 .\n?x2 P2 M2 .\n?x2 P3 M2\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 38
  },
  {
    "questionIdx": 179153,
    "questionWithBrackets": "What was executive produced, produced, directed, and edited by [The Private Life Of Fenfen]'s Chinese director",
    "questionPatternModEntities": "What was executive produced , produced , directed , and edited by M1 's Chinese director",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.director.film ns:m.0_zb30t .\n?x1 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 M0 .\n?x1 P5 M1\n}",
    "expectedResponse": "Grave Goods",
    "recursionDepth": 38
  },
  {
    "questionIdx": 92956,
    "questionWithBrackets": "Was a cinematographer that a screenwriter married, was influenced by, and influenced [Robert H. Whaley]",
    "questionPatternModEntities": "Was a cinematographer that a screenwriter married , was influenced by , and influenced M1",
    "questionTemplate": "Was a [NP_SIMPLE] that a [NP_SIMPLE] [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\nFILTER ( ns:m.05p34yf != ?x0 ) .\nns:m.05p34yf a ns:film.cinematographer .\nns:m.05p34yf ns:influence.influence_node.influenced ?x0 .\nns:m.05p34yf ns:influence.influence_node.influenced_by ?x0 .\nns:m.05p34yf ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 182403,
    "questionWithBrackets": "What was produced by a person's sibling and child and edited by [Ted Otton] and [Neil Thumpston]",
    "questionPatternModEntities": "What was produced by a person 's sibling and child and edited by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0k89h4 .\n?x0 ns:film.film.edited_by ns:m.0kbh3vz .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:people.person .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Dot and the Koala",
    "recursionDepth": 38
  },
  {
    "questionIdx": 99551,
    "questionWithBrackets": "Was a film producer's child founded by [Tales from Earthsea]'s director's parent and founded by [Linda Oldham]",
    "questionPatternModEntities": "Was a film producer 's child founded by M2 's director 's parent and founded by M0",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.0c4md70 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x2 a ns:film.producer .\n?x3 ns:film.director.film ns:m.09c557\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P1 M0 .\n?x1 a M1 .\n?x2 P2 ?x3 .\n?x3 P3 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 237662,
    "questionWithBrackets": "Who was influenced by [Video Archives]'s employee and influenced by [Eraserhead]'s editor, producer, and art director",
    "questionPatternModEntities": "Who was influenced by M1 's employee and influenced by M2 's editor , producer , and art director",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03phx4 .\n?x2 ns:film.editor.film ns:m.027jhb .\n?x2 ns:film.film_art_director.films_art_directed ns:m.027jhb .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.027jhb\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x2 P2 M2 .\n?x2 P3 M2 .\n?x2 P4 M2\n}",
    "expectedResponse": "Garret Schuelke; Martin McDonagh",
    "recursionDepth": 39
  },
  {
    "questionIdx": 63759,
    "questionWithBrackets": "Was [Last Will and Embezzlement] executive produced, written, produced, directed, and edited by [Angela Winter]'s sibling",
    "questionPatternModEntities": "Was M1 executive produced , written , produced , directed , and edited by M0 's sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.011cfvg0 .\nFILTER ( ?x0 != ns:m.011cfvg0 ) .\nns:m.0w1b18c ns:film.film.directed_by ?x0 .\nns:m.0w1b18c ns:film.film.edited_by ?x0 .\nns:m.0w1b18c ns:film.film.executive_produced_by ?x0 .\nns:m.0w1b18c ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0w1b18c ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 217795,
    "questionWithBrackets": "Who founded a film distributor's parent, founded [CNN], and was employed by [World Championship Wrestling]",
    "questionPatternModEntities": "Who founded a film distributor 's parent , founded M2 , and was employed by M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0gsgr .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.019jdn .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Ted Turner",
    "recursionDepth": 39
  },
  {
    "questionIdx": 179472,
    "questionWithBrackets": "What was founded by [Daddy Longlegs]'s executive producer, founded by [Chad Buri], and founded by [Partners & Spade]'s founder",
    "questionPatternModEntities": "What was founded by M1 's executive producer , founded by M0 , and founded by M2 's founder",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x0 ns:organization.organization.founders ns:m.0tlvcvg .\n?x1 ns:film.producer.films_executive_produced ns:m.09sylrq .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0ch24xg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x2 P2 M2\n}",
    "expectedResponse": "Sleepy Jones",
    "recursionDepth": 39
  },
  {
    "questionIdx": 93601,
    "questionWithBrackets": "Was a company that was acquired by [Providence Equity Partners] and [APriori Capital Partners] and acquired a film distributor [FK Spartak Zlatibor Voda]",
    "questionPatternModEntities": "Was a company that was acquired by M3 and M4 and acquired a film distributor M1",
    "questionTemplate": "Was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] a [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\nns:m.052480b a ns:business.employer .\nns:m.052480b ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02qb2mr .\nns:m.052480b ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.04rcx3 .\nns:m.052480b ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M3 .\nM1 P0 M4 .\nM1 P1 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 168807,
    "questionWithBrackets": "What was a production company whose employee and founder executive produced [Dateline: Disneyland] and produced [Pinocchio]",
    "questionPatternModEntities": "What was a production company whose employee and founder executive produced M1 and produced M2",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.0y639_j .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.019kyn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Walt Disney Animation Studios; The Walt Disney Company",
    "recursionDepth": 39
  },
  {
    "questionIdx": 144137,
    "questionWithBrackets": "What did [Jane Rosenthal] found and a star of a film's prequel and sequel found",
    "questionPatternModEntities": "What did M0 found and a star of a film 's prequel and sequel found",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [ROLE_SIMPLE] of a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.0ctmx1 .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x2 ns:film.film.prequel ?x3 .\n?x2 ns:film.film.sequel ?x3 .\n?x3 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x2 P3 ?x3 .\n?x3 a M1\n}",
    "expectedResponse": "TriBeCa Productions",
    "recursionDepth": 39
  },
  {
    "questionIdx": 214775,
    "questionWithBrackets": "Who did [Perilous Holiday]'s male costume designer marry, [Mae Murray] influence, and [Grant Withers] marry",
    "questionPatternModEntities": "Who did M3 's male costume designer marry , M1 influence , and M2 marry",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.02dmts .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0fj_nl .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.09rjzth .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0fj_nl )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M4 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Loretta Young",
    "recursionDepth": 39
  },
  {
    "questionIdx": 59029,
    "questionWithBrackets": "Was [Human Rights Association] founded by a person that wrote [Balalayka] and founded by [Didar \u015eensoy] and [Filiz Karaku\u015f]",
    "questionPatternModEntities": "Was M2 founded by a person that wrote M1 and founded by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.writer.film ns:m.04174hl .\nns:m.02r1shh ns:organization.organization.founders ?x0 .\nns:m.02r1shh ns:organization.organization.founders ns:m.0w37jjn .\nns:m.02r1shh ns:organization.organization.founders ns:m.0w37jv4\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P1 M3 .\nM2 P1 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 9662,
    "questionWithBrackets": "Did [Here Comes the Boom] star [Kevin James] and [Marely Mercedes] and star [Katherine Borowitz]'s Italian spouse's sibling",
    "questionPatternModEntities": "Did M2 star M3 and M4 and star M1 's Italian spouse 's sibling",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.nationality ns:m.03rjj .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bbr594 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0bbr594 ) .\nns:m.0gh9fjz ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0gh9fjz ns:film.film.starring/ns:film.performance.actor ns:m.03xb2w .\nns:m.0gh9fjz ns:film.film.starring/ns:film.performance.actor ns:m.0v4062f\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 ) .\nM2 P3 ?x0 .\nM2 P3 M3 .\nM2 P3 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 194266,
    "questionWithBrackets": "Which art director was a Canadian screenwriter that wrote [Titanic] and executive produced [The Exodus Decoded]",
    "questionPatternModEntities": "Which art director was a Canadian screenwriter that wrote M2 and executive produced M3",
    "questionTemplate": "Which [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 a ns:film.writer .\n?x0 ns:film.producer.films_executive_produced ns:m.0cmw3v .\n?x0 ns:film.writer.film ns:m.0dr_4 .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "James Cameron",
    "recursionDepth": 39
  },
  {
    "questionIdx": 5400,
    "questionWithBrackets": "Did [David Lynch] and [Martin Scorsese] marry a child of an actor and influence [Christopher Largen] and [David Chase]",
    "questionPatternModEntities": "Did M1 and M4 marry a child of a actor and influence M2 and M3",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [ROLE_SIMPLE] of a [NP_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.actor .\nFILTER ( ns:m.026dx != ?x0 ) .\nFILTER ( ns:m.04sry != ?x0 ) .\nns:m.026dx ns:influence.influence_node.influenced ns:m.04x4s2 .\nns:m.026dx ns:influence.influence_node.influenced ns:m.0bqnky .\nns:m.026dx ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.04sry ns:influence.influence_node.influenced ns:m.04x4s2 .\nns:m.04sry ns:influence.influence_node.influenced ns:m.0bqnky .\nns:m.04sry ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M4 != ?x0 ) .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P2 ?x0 .\nM4 P1 M2 .\nM4 P1 M3 .\nM4 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 24734,
    "questionWithBrackets": "Did [Walt Disney] found [Walt Disney Animation Studios], found [Disney Channel], and found [Steamboat Willie]'s producer's employer",
    "questionPatternModEntities": "Did M1 found M2 , found M3 , and found M0 's producer 's employer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.07bp0 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ns:m.04rcl7 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ns:m.0kc9f\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 183853,
    "questionWithBrackets": "What was written and edited by a costume designer that executive produced and edited [Promises Written in Water]",
    "questionPatternModEntities": "What was written and edited by a costume designer that executive produced and edited M1",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.film_costumer_designer .\n?x1 ns:film.editor.film ns:m.0bh9qf1 .\n?x1 ns:film.producer.films_executive_produced ns:m.0bh9qf1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 a M0\n}",
    "expectedResponse": "The Brown Bunny; Promises Written in Water",
    "recursionDepth": 39
  },
  {
    "questionIdx": 76639,
    "questionWithBrackets": "Was [Skhizein] written by a film producer and edited by [Panic in the Parlour]'s executive producer, art director, and cinematographer",
    "questionPatternModEntities": "Was M2 written by a film producer and edited by M1 's executive producer , art director , and cinematographer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x1 ns:film.cinematographer.film ns:m.05szgwg .\n?x1 ns:film.film_art_director.films_art_directed ns:m.05szgwg .\n?x1 ns:film.producer.films_executive_produced ns:m.05szgwg .\nns:m.04mwpwz ns:film.film.edited_by ?x1 .\nns:m.04mwpwz ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P4 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 98097,
    "questionWithBrackets": "Was a film editor employed by [Temple University], employed by [The Walt Disney Company]'s child, and employed by [Industrial Light & Magic]",
    "questionPatternModEntities": "Was a film editor employed by M1 , employed by M3 's child , and employed by M2",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01813n .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01jt2w .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.09b3v\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 74674,
    "questionWithBrackets": "Was [Role Models] produced by a production company, executive produced by [Peter Saraf], and written by a character",
    "questionPatternModEntities": "Was M2 produced by a production company , executive produced by M3 , and written by a character",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x1 a ns:film.production_company .\nns:m.03b_fm5 ns:film.film.executive_produced_by ns:m.0jxyym .\nns:m.03b_fm5 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\nns:m.03b_fm5 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 M3 .\nM2 P1 ?x0 .\nM2 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 181737,
    "questionWithBrackets": "What was produced by [Tarak Ben Ammar] and executive produced by a film producer's parent's employee and founder",
    "questionPatternModEntities": "What was produced by M0 and executive produced by a film producer 's parent 's employee and founder",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.047kcc .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 P4 ?x3 .\n?x3 a M1\n}",
    "expectedResponse": "The Last Legion",
    "recursionDepth": 39
  },
  {
    "questionIdx": 11222,
    "questionWithBrackets": "Did [Jean Renoir] marry [Dido Renoir], influence [The Kingdom of Diamonds]'s costume designer, and influence [Changing Lanes]'s star",
    "questionPatternModEntities": "Did M2 marry M3 , influence M0 's costume designer , and influence M1 's star",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.098dmr .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.04w7fk .\nFILTER ( ns:m.0qdm8 != ns:m.0hn30y5 ) .\nns:m.0qdm8 ns:influence.influence_node.influenced ?x0 .\nns:m.0qdm8 ns:influence.influence_node.influenced ?x1 .\nns:m.0qdm8 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hn30y5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( M2 != M3 ) .\nM2 P2 ?x0 .\nM2 P2 ?x1 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 227153,
    "questionWithBrackets": "Who was a German male film director that [Bigfoot Entertainment] employed and was founded by",
    "questionPatternModEntities": "Who was a German male film director that M2 employed and was founded by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE] and was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.04f4nrb .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04f4nrb .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 P3 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Michael Gleissner",
    "recursionDepth": 39
  },
  {
    "questionIdx": 56502,
    "questionWithBrackets": "Was [George Lucas] a cinematographer that [Christopher Lee] influenced and [American Zoetrope]'s Italian founder influenced",
    "questionPatternModEntities": "Was M2 a cinematographer that M4 influenced and M0 's Italian founder influenced",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02jd_7 .\n?x0 ns:people.person.nationality ns:m.03rjj .\nns:m.0343h a ns:film.cinematographer .\nns:m.0343h ns:influence.influence_node.influenced_by ?x0 .\nns:m.0343h ns:influence.influence_node.influenced_by ns:m.0f0kz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M4 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 7189,
    "questionWithBrackets": "Did [Ezra Pound] influence [Florence Joyce]'s sibling, marry [Dorothy Shakespear], and influence [The McClatchy Company]'s employee",
    "questionPatternModEntities": "Did M2 influence M1 's sibling , marry M3 , and influence M0 's employee",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03y7ml .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0__wb6h .\nFILTER ( ?x1 != ns:m.0__wb6h ) .\nFILTER ( ns:m.0c1jh != ns:m.05jh5j ) .\nns:m.0c1jh ns:influence.influence_node.influenced ?x0 .\nns:m.0c1jh ns:influence.influence_node.influenced ?x1 .\nns:m.0c1jh ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05jh5j\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( ?x1 != M1 ) .\nFILTER ( M2 != M3 ) .\nM2 P2 ?x0 .\nM2 P2 ?x1 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  }
]