[
  {
    "questionIdx": 180963,
    "questionWithBrackets": "What was produced by [A Hole in My Heart]'s Swedish costume designer, produced by [Fasad AB], and distributed by [Nordisk Film]",
    "questionPatternModEntities": "What was produced by M2 's Swedish costume designer , produced by M1 , and distributed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03_81s .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.07mp1m0 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.03xkr6 .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "The Ape",
    "recursionDepth": 40
  },
  {
    "questionIdx": 150200,
    "questionWithBrackets": "What did a male art director and producer of [Villa Antropoff] produce, write, and edit",
    "questionPatternModEntities": "What did a male art director and producer of M0 produce , write , and edit",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0k3dcff .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0k3dcff .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1 .\n?x1 P5 M0\n}",
    "expectedResponse": "Wings and Oars; Villa Antropoff",
    "recursionDepth": 40
  },
  {
    "questionIdx": 7143,
    "questionWithBrackets": "Did [Evelyn Waugh] influence a sibling of [Hideous Kinky]'s producer's employee and marry [Pamela Stephenson] and [Iris Pressagh]",
    "questionPatternModEntities": "Did M1 influence a sibling of M0 's producer 's employee and marry M2 and M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.0dtp46 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.0h0v2 != ns:m.01jj7_ ) .\nFILTER ( ns:m.0h0v2 != ns:m.0j4c3jz ) .\nns:m.0h0v2 ns:influence.influence_node.influenced ?x0 .\nns:m.0h0v2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.01jj7_ .\nns:m.0h0v2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j4c3jz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != M2 ) .\nFILTER ( M1 != M3 ) .\nM1 P3 ?x0 .\nM1 P4 M2 .\nM1 P4 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 218980,
    "questionWithBrackets": "Who influenced [The Silence of the Sea]'s editor, producer, and executive producer and was influenced by [Henry David Thoreau] and [Thomas Carlyle]",
    "questionPatternModEntities": "Who influenced M3 's editor , producer , and executive producer and was influenced by M1 and M2",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0bwx3 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0ymtb .\n?x1 ns:film.editor.film ns:m.0bgspt .\n?x1 ns:film.producer.films_executive_produced ns:m.0bgspt .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0bgspt\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3\n}",
    "expectedResponse": "Herman Melville",
    "recursionDepth": 40
  },
  {
    "questionIdx": 164130,
    "questionWithBrackets": "What screenwriter founded [Disney Channel], was employed by [Laugh-O-Gram Studio], and was employed by a production company",
    "questionPatternModEntities": "What screenwriter founded M2 , was employed by M1 , and was employed by a production company",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0kc9f .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03tksd .\n?x1 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Walt Disney",
    "recursionDepth": 40
  },
  {
    "questionIdx": 72275,
    "questionWithBrackets": "Was [Promises Written in Water] edited by, produced by, and executive produced by [Across the Wide Missouri]'s art director, director, and costume designer",
    "questionPatternModEntities": "Was M1 edited by , produced by , and executive produced by M0 's art director , director , and costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.08qzwt .\n?x0 ns:film.film_art_director.films_art_directed ns:m.08qzwt .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.08qzwt .\nns:m.0bh9qf1 ns:film.film.edited_by ?x0 .\nns:m.0bh9qf1 ns:film.film.executive_produced_by ?x0 .\nns:m.0bh9qf1 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 170047,
    "questionWithBrackets": "What was directed by [Kaspar Heidelbach] and executive produced by a male person's German spouse",
    "questionPatternModEntities": "What was directed by M0 and executive produced by a male person 's German spouse",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.09k8f6q .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:people.person .\n?x2 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 ?x2 .\n?x2 P4 M3 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Der Untergang der Pamir",
    "recursionDepth": 40
  },
  {
    "questionIdx": 159169,
    "questionWithBrackets": "What film was produced, edited, directed, and written by [El Bruto]'s Mexican writer",
    "questionPatternModEntities": "What film was produced , edited , directed , and written by M1 's Mexican writer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.writer.film ns:m.0415g7c .\n?x1 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 a M0 .\n?x1 P4 M1 .\n?x1 P5 M2\n}",
    "expectedResponse": "An Andalusian Dog",
    "recursionDepth": 40
  },
  {
    "questionIdx": 55771,
    "questionWithBrackets": "Was [Fucking Different S\u00e3o Paulo]'s sequel directed by [Leave Blank]'s editor, written by [J\u00fcrgen Br\u00fcning], and edited by [Emilie Jouvet]",
    "questionPatternModEntities": "Was M2 's sequel directed by M3 's editor , written by M0 , and edited by M1",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0c0nk8k .\n?x0 ns:film.film.prequel ns:m.0bdt344 .\n?x0 ns:film.film.written_by ns:m.04lqwwr .\n?x1 ns:film.editor.film ns:m.0hp7vtv\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\n?x0 P3 ?x1 .\n?x1 P4 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 159410,
    "questionWithBrackets": "What film whose editor executive produced [Crash My Funeral] did a cinematographer edit and [Andrea Ament] write",
    "questionPatternModEntities": "What film whose editor executive produced M3 did a cinematographer edit and M1 write",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] did a [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x0 ns:film.film.written_by ns:m.0zzv1mt .\n?x1 a ns:film.cinematographer .\n?x2 ns:film.producer.films_executive_produced ns:m.0zp0j9w\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M2 .\n?x2 P2 M3\n}",
    "expectedResponse": "It's Not About the Shawerma",
    "recursionDepth": 40
  },
  {
    "questionIdx": 158860,
    "questionWithBrackets": "What film was edited by and executive produced by a Dutch film director that produced [War, Love, God & Madness]",
    "questionPatternModEntities": "What film was edited by and executive produced by a Dutch film director that produced M3",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 a ns:film.director .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.04nlbgc .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3 .\n?x1 a M1\n}",
    "expectedResponse": "Nesma's Birds",
    "recursionDepth": 40
  },
  {
    "questionIdx": 145099,
    "questionWithBrackets": "What did [Mark Frost] executive produce, [DumbLand]'s writer and star write, and [Mary Sweeney] edit",
    "questionPatternModEntities": "What did M0 executive produce , M2 's writer and star write , and M1 edit",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.02ptqpx .\n?x0 ns:film.film.executive_produced_by ns:m.06lv4f .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0dkg6f .\n?x1 ns:film.writer.film ns:m.0dkg6f\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 P3 M2 .\n?x1 P4 M2\n}",
    "expectedResponse": "Twin Peaks: Fire Walk With Me",
    "recursionDepth": 40
  },
  {
    "questionIdx": 111177,
    "questionWithBrackets": "Were [1968 with Tom Brokaw] and [An Unsullied Shield] directed by and written by a person's female actor's spouse",
    "questionPatternModEntities": "Were M2 and M3 directed by and written by a person 's female actor 's spouse",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x2 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0_8z1by ns:film.film.directed_by ?x0 .\nns:m.0_8z1by ns:film.film.written_by ?x0 .\nns:m.0r5w388 ns:film.film.directed_by ?x0 .\nns:m.0r5w388 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 M0 .\n?x2 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM3 P3 ?x0 .\nM3 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 173697,
    "questionWithBrackets": "What was edited by [Patrick Amos], edited by [Jean-Pierre Gorin], and edited by [Artist on Fire]'s French cinematographer",
    "questionPatternModEntities": "What was edited by M0 , edited by M1 , and edited by M3 's French cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.04gs3_ .\n?x0 ns:film.film.edited_by ns:m.0h0ng0y .\n?x1 ns:film.cinematographer.film ns:m.0byp8kw .\n?x1 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P1 M2 .\n?x1 P2 M3\n}",
    "expectedResponse": "Routine Pleasures",
    "recursionDepth": 40
  },
  {
    "questionIdx": 76539,
    "questionWithBrackets": "Was [Sin City: A Dame to Kill For] distributed by [Dimension Films] and [Columbia Pictures] and produced by [Spy Kids]'s sequel's editor and producer",
    "questionPatternModEntities": "Was M1 distributed by M2 and M3 and produced by M0 's sequel 's editor and producer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 ns:film.film.prequel ns:m.02rrfzf .\nns:m.08q3xy ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.017s11 .\nns:m.08q3xy ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.032j_n .\nns:m.08q3xy ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nM1 P3 M2 .\nM1 P3 M3 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 10629,
    "questionWithBrackets": "Did [J. D. Salinger] influence [Fantastic Mr. Fox]'s writer and producer, influence [Jonathan Safran Foer], and marry [Sylvia Welter]",
    "questionPatternModEntities": "Did M1 influence M0 's writer and producer , influence M2 , and marry M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.08s6mr .\n?x0 ns:film.writer.film ns:m.08s6mr .\nFILTER ( ns:m.041_y != ns:m.0n7vfrh ) .\nns:m.041_y ns:influence.influence_node.influenced ?x0 .\nns:m.041_y ns:influence.influence_node.influenced ns:m.03qg2l .\nns:m.041_y ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0n7vfrh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nFILTER ( M1 != M3 ) .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 84374,
    "questionWithBrackets": "Was [Turtles Can Fly] produced by a producer and art director of [A Time for Drunken Horses] and produced by a cinematographer of [111 Girls]",
    "questionPatternModEntities": "Was M2 produced by a producer and art director of M1 and produced by a cinematographer of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0qprmpb .\n?x1 ns:film.film_art_director.films_art_directed ns:m.097p2g .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.097p2g .\nns:m.054gjs ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.054gjs ns:film.film.produced_by|ns:film.film.production_companies ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P3 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 233511,
    "questionWithBrackets": "Who was an Italian male film editor that [Zombie Massacre] was written by and executive produced by",
    "questionPatternModEntities": "Who was a Italian male film editor that M2 was written by and executive produced by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ns:m.06ztc8_ .\n?x0 ns:film.writer.film ns:m.06ztc8_ .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 P3 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Marco Ristori",
    "recursionDepth": 40
  },
  {
    "questionIdx": 48691,
    "questionWithBrackets": "Was [Brutal Relax] edited by [Adri\u00e1n Cardona] and [Rafa Dengr\u00e1] and edited by [Fist Of Jesus]'s editor, costume designer, and writer",
    "questionPatternModEntities": "Was M1 edited by M2 and M3 and edited by M0 's editor , costume designer , and writer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.010s0v9j .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.010s0v9j .\n?x0 ns:film.writer.film ns:m.010s0v9j .\nns:m.0hpfc9c ns:film.film.edited_by ?x0 .\nns:m.0hpfc9c ns:film.film.edited_by ns:m.0hpfc9j .\nns:m.0hpfc9c ns:film.film.edited_by ns:m.0hpfc9m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P3 M2 .\nM1 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 20297,
    "questionWithBrackets": "Did [S\u00f8ren Kierkegaard] influence [Karl Barth], influence [Walter Benjamin], and influence [Pi]'s male director",
    "questionPatternModEntities": "Did M2 influence M3 , influence M4 , and influence M1 's male director",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.02bz36 .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.06qvh ns:influence.influence_node.influenced ?x0 .\nns:m.06qvh ns:influence.influence_node.influenced ns:m.01h2_6 .\nns:m.06qvh ns:influence.influence_node.influenced ns:m.01hcbh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 155552,
    "questionWithBrackets": "What film director that [Congregation Lady #3]'s actor's spouse was influenced by and influenced did [Jack Benny] influence",
    "questionPatternModEntities": "What film director that M2 's actor 's spouse was influenced by and influenced did M1 influence",
    "questionTemplate": "What [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] was [VP_SIMPLE] by and [VP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0l5yl .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0vb3c95 .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 P3 M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Richard Pryor",
    "recursionDepth": 40
  },
  {
    "questionIdx": 173354,
    "questionWithBrackets": "What was edited by [Gareth O'Neil], written by an actor, and written by a sibling of [Jennifer Milmore]",
    "questionPatternModEntities": "What was edited by M0 , written by a actor , and written by a sibling of M2",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0q2vpy0 .\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.03h32r7 .\nFILTER ( ?x2 != ns:m.03h32r7 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 M0 .\n?x1 a M1 .\n?x2 P2 M2 .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "A Wake in Providence",
    "recursionDepth": 40
  },
  {
    "questionIdx": 50275,
    "questionWithBrackets": "Was [Chris Rock] influenced by [Deborah McGuire]'s spouse, influenced by [Tough Mice]'s actor, and influenced by [Bill Hicks]",
    "questionPatternModEntities": "Was M2 influenced by M1 's spouse , influenced by M0 's actor , and influenced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h5pfzz .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.080dcv6 .\nFILTER ( ?x1 != ns:m.080dcv6 ) .\nns:m.016_mj ns:influence.influence_node.influenced_by ?x0 .\nns:m.016_mj ns:influence.influence_node.influenced_by ?x1 .\nns:m.016_mj ns:influence.influence_node.influenced_by ns:m.01wp_jm\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( ?x1 != M1 ) .\nM2 P2 ?x0 .\nM2 P2 ?x1 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 162531,
    "questionWithBrackets": "What person whose country of nationality employed [Henry Arthur Blake] and employed [John Bowring] played [Cock Head] and [Sword Hua]",
    "questionPatternModEntities": "What person whose country of nationality employed M3 and employed M4 played M1 and M2",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h0zhkz .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h0zhmq .\n?x0 ns:people.person.nationality ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.01w5mx .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.02pfy9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P2 M4\n}",
    "expectedResponse": "Nicholas Tse",
    "recursionDepth": 40
  },
  {
    "questionIdx": 80496,
    "questionWithBrackets": "Was [The Exploding Girl] executive produced by a film editor, written by [David Self], and executive produced by a film director",
    "questionPatternModEntities": "Was M2 executive produced by a film editor , written by M3 , and executive produced by a film director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x1 a ns:film.director .\nns:m.05sqd88 ns:film.film.executive_produced_by ?x0 .\nns:m.05sqd88 ns:film.film.executive_produced_by ?x1 .\nns:m.05sqd88 ns:film.film.written_by ns:m.02rqh8k\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 ?x0 .\nM2 P0 ?x1 .\nM2 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 181976,
    "questionWithBrackets": "What was produced by a French editor of [The Crazy Ray] and distributed by a company's founder",
    "questionPatternModEntities": "What was produced by a French editor of M2 and distributed by a company 's founder",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:organization.organization_founder.organizations_founded ?x3 .\n?x2 ns:film.editor.film ns:m.0g3d77 .\n?x2 ns:people.person.nationality ns:m.0f8l9c .\n?x3 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 ?x3 .\n?x2 P3 M1 .\n?x2 P4 M2 .\n?x3 a M0\n}",
    "expectedResponse": "I Married a Witch",
    "recursionDepth": 40
  },
  {
    "questionIdx": 157271,
    "questionWithBrackets": "What film executive produced by a costume designer and edited by [Lawrence Fajardo] did a costume designer produce",
    "questionPatternModEntities": "What film executive produced by a costume designer and edited by M1 did a costume designer produce",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity] did a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ns:m.09rn56m .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 a ns:film.film_costumer_designer .\n?x2 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P2 M1 .\n?x0 a M0 .\n?x1 a M2 .\n?x2 a M2\n}",
    "expectedResponse": "Amok",
    "recursionDepth": 40
  },
  {
    "questionIdx": 224947,
    "questionWithBrackets": "Who was a British actor that [The Special Relationship] was written by and [Killers] was executive produced by",
    "questionPatternModEntities": "Who was a British actor that M2 was written by and M3 was executive produced by",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ns:m.05m_jsg .\n?x0 ns:film.writer.film ns:m.06wc7k7 .\n?x0 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Peter Morgan",
    "recursionDepth": 40
  },
  {
    "questionIdx": 52630,
    "questionWithBrackets": "Was [Dimension Films] a production company whose employee and founder executive produced [The Road to El Dorado] and executive produced [Scary Movie 5]",
    "questionPatternModEntities": "Was M2 a production company whose employee and founder executive produced M0 and executive produced M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.03r6q1 .\n?x0 ns:film.producer.films_executive_produced ns:m.0kg2b5h .\nns:m.032j_n a ns:film.production_company .\nns:m.032j_n ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.032j_n ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 123021,
    "questionWithBrackets": "Were [Querida Bamako], [Almost a Husband], [Cupid's Victory], [Paging a Wife], and [Al's Troubles] executive produced by [Abe Stern] and directed by a person",
    "questionPatternModEntities": "Were M1 , M3 , M4 , M5 , and M6 executive produced by M2 and directed by a person",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\nns:m.0b6ygdq ns:film.film.directed_by ?x0 .\nns:m.0b6ygdq ns:film.film.executive_produced_by ns:m.02z337g .\nns:m.0b6ygf_ ns:film.film.directed_by ?x0 .\nns:m.0b6ygf_ ns:film.film.executive_produced_by ns:m.02z337g .\nns:m.0b6yghz ns:film.film.directed_by ?x0 .\nns:m.0b6yghz ns:film.film.executive_produced_by ns:m.02z337g .\nns:m.0b6ygkz ns:film.film.directed_by ?x0 .\nns:m.0b6ygkz ns:film.film.executive_produced_by ns:m.02z337g .\nns:m.0j65bq4 ns:film.film.directed_by ?x0 .\nns:m.0j65bq4 ns:film.film.executive_produced_by ns:m.02z337g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M2 .\nM1 P1 ?x0 .\nM3 P0 M2 .\nM3 P1 ?x0 .\nM4 P0 M2 .\nM4 P1 ?x0 .\nM5 P0 M2 .\nM5 P1 ?x0 .\nM6 P0 M2 .\nM6 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  }
]