[
  {
    "questionIdx": 122150,
    "questionWithBrackets": "Were [Obsession], [Phantom of the Paradise], [Blow Out], [The Fury], and [Mission: Impossible] edited by a screenwriter's sibling and directed by [Brian De Palma]",
    "questionPatternModEntities": "Were M1 , M3 , M4 , M5 , and M6 edited by a screenwriter 's sibling and directed by M2",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.035w2k ns:film.film.directed_by ns:m.01c6l .\nns:m.035w2k ns:film.film.edited_by ?x0 .\nns:m.04sgl8 ns:film.film.directed_by ns:m.01c6l .\nns:m.04sgl8 ns:film.film.edited_by ?x0 .\nns:m.04wh_s ns:film.film.directed_by ns:m.01c6l .\nns:m.04wh_s ns:film.film.edited_by ?x0 .\nns:m.05dyyx ns:film.film.directed_by ns:m.01c6l .\nns:m.05dyyx ns:film.film.edited_by ?x0 .\nns:m.08t6yk ns:film.film.directed_by ns:m.01c6l .\nns:m.08t6yk ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0 .\nM1 P2 M2 .\nM3 P1 ?x0 .\nM3 P2 M2 .\nM4 P1 ?x0 .\nM4 P2 M2 .\nM5 P1 ?x0 .\nM5 P2 M2 .\nM6 P1 ?x0 .\nM6 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 43
  },
  {
    "questionIdx": 175547,
    "questionWithBrackets": "What was edited, directed, produced, executive produced, and written by [Baby, I Love You.]'s producer and cinematographer",
    "questionPatternModEntities": "What was edited , directed , produced , executive produced , and written by M0 's producer and cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.011_z9lq .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.011_z9lq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Baby, I Love You.; Planet Utero",
    "recursionDepth": 43
  },
  {
    "questionIdx": 168292,
    "questionWithBrackets": "What was a film distributor whose male founder and employee played [Max Rockatansky] and played [Tim Melville]",
    "questionPatternModEntities": "What was a film distributor whose male founder and employee played M1 and played M2",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.05spy34 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.090wrh .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Icon Productions",
    "recursionDepth": 43
  },
  {
    "questionIdx": 205446,
    "questionWithBrackets": "Which film was written by [Hamsun]'s editor and cinematographer, edited by [Niels Dekker], and executive produced by [Mariano Vanhoof]",
    "questionPatternModEntities": "Which film was written by M3 's editor and cinematographer , edited by M2 , and executive produced by M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ns:m.0gwvlhx .\n?x0 ns:film.film.executive_produced_by ns:m.0jmw6f0 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.05f6kpj .\n?x1 ns:film.editor.film ns:m.05f6kpj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x1 P3 M3 .\n?x1 P4 M3\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 44
  },
  {
    "questionIdx": 83572,
    "questionWithBrackets": "Was [Tim Burton] a cinematographer that [Lena Gieseke] married and a character that influenced [Garret Schuelke] was influenced by",
    "questionPatternModEntities": "Was M2 a cinematographer that M4 married and a character that influenced M1 was influenced by",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and a [NP_SIMPLE] that [VP_SIMPLE] [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced ns:m.066b7gk .\nFILTER ( ns:m.07rd7 != ns:m.0hpr979 ) .\nns:m.07rd7 a ns:film.cinematographer .\nns:m.07rd7 ns:influence.influence_node.influenced ?x0 .\nns:m.07rd7 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hpr979\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != M4 ) .\nM2 P0 ?x0 .\nM2 P1 M4 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 73996,
    "questionWithBrackets": "Was [Richard Lewis] influenced by an actor and influenced by a cinematographer that [It Rains on Our Love] and [The High Sign] were written by",
    "questionPatternModEntities": "Was M4 influenced by a actor and influenced by a cinematographer that M2 and M3 were written by",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] and [entity] were [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x1 a ns:film.cinematographer .\n?x1 ns:film.writer.film ns:m.02r9cv1 .\n?x1 ns:film.writer.film ns:m.0gmjm6 .\nns:m.01fvf9 ns:influence.influence_node.influenced_by ?x0 .\nns:m.01fvf9 ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M2 .\n?x1 P0 M3 .\n?x1 a M1 .\nM4 P1 ?x0 .\nM4 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 97423,
    "questionWithBrackets": "Was a film distributor that was founded by [John Ju]'s employer's founder and employed [Fred Graver] and [David T. Cassaro] [CBS]",
    "questionPatternModEntities": "Was a film distributor that was founded by M0 's employer 's founder and employed M3 and M4 M1",
    "questionTemplate": "Was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] and [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.02z_mbk .\nns:m.09d5h a ns:film.film_distributor .\nns:m.09d5h ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04h_k3f .\nns:m.09d5h ns:business.employer.employees/ns:business.employment_tenure.person ns:m.092b80 .\nns:m.09d5h ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P1 M3 .\nM1 P1 M4 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 235444,
    "questionWithBrackets": "Who was influenced by [Arizona Motel Clerk]'s actor's sibling, was influenced by [Edmund Husserl], and was influenced by [Karl Marx]",
    "questionPatternModEntities": "Who was influenced by M3 's actor 's sibling , was influenced by M1 , and was influenced by M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.02ln1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.048cl .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0yq97cz .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M3 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Pierre Bourdieu; Michel Foucault",
    "recursionDepth": 44
  },
  {
    "questionIdx": 120859,
    "questionWithBrackets": "Were [Martin McDonagh] and [Garret Schuelke] influenced by a star and cinematographer of [Death Proof] and influenced by an executive producer of [Twin Peaks: Fire Walk With Me]",
    "questionPatternModEntities": "Were M2 and M3 influenced by a star and cinematographer of M1 and influenced by a executive producer of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.01kjr0 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.03bxrfl .\n?x1 ns:film.cinematographer.film ns:m.03bxrfl .\nns:m.040rjq ns:influence.influence_node.influenced_by ?x0 .\nns:m.040rjq ns:influence.influence_node.influenced_by ?x1 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x0 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P3 ?x1 .\nM3 P3 ?x0 .\nM3 P3 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 215287,
    "questionWithBrackets": "Who did [Warren Plath]'s female German sibling influence and [The Prince and the Showgirl]'s female executive producer influence",
    "questionPatternModEntities": "Who did M1 's female German sibling influence and M4 's female executive producer influence",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.05n4tpw .\n?x2 ns:film.producer.films_executive_produced ns:m.06cv63 .\n?x2 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x1 != ns:m.05n4tpw )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\n?x1 P3 M3 .\n?x2 P3 M3 .\n?x2 P4 M4 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Madonna",
    "recursionDepth": 44
  },
  {
    "questionIdx": 183530,
    "questionWithBrackets": "What was produced, directed, executive produced, written, and edited by an executive producer of [Che: Rise & Fall] and [La Raulito, Low Blows]",
    "questionPatternModEntities": "What was produced , directed , executive produced , written , and edited by a executive producer of M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.080gfks .\n?x1 ns:film.producer.films_executive_produced ns:m.0qsdn24\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P5 M1\n}",
    "expectedResponse": "Rita Dove: An American Poet",
    "recursionDepth": 44
  },
  {
    "questionIdx": 237625,
    "questionWithBrackets": "Who was influenced by [Tom Waits], influenced by [Mickey Spillane] and [David Lynch], and influenced by [Studio Ghibli]'s employee and founder",
    "questionPatternModEntities": "Who was influenced by M1 , influenced by M2 and M3 , and influenced by M4 's employee and founder",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.012cy5 .\n?x0 ns:influence.influence_node.influenced_by ns:m.026dx .\n?x0 ns:influence.influence_node.influenced_by ns:m.03h_fqv .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0130kc .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0130kc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 M4 .\n?x1 P2 M4\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 44
  },
  {
    "questionIdx": 125829,
    "questionWithBrackets": "Were [The Big Lebowski] and [A Serious Man] executive produced by an actor, edited by [Racer Rodr\u00edguez]'s parent, and edited by [Ethan Coen]",
    "questionPatternModEntities": "Were M2 and M4 executive produced by a actor , edited by M1 's parent , and edited by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0k4906 .\nns:m.02r1c18 ns:film.film.edited_by ?x1 .\nns:m.02r1c18 ns:film.film.edited_by ns:m.02kxbwx .\nns:m.02r1c18 ns:film.film.executive_produced_by ?x0 .\nns:m.07bwr ns:film.film.edited_by ?x1 .\nns:m.07bwr ns:film.film.edited_by ns:m.02kxbwx .\nns:m.07bwr ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x1 .\nM2 P2 M3 .\nM4 P1 ?x0 .\nM4 P2 ?x1 .\nM4 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 118427,
    "questionWithBrackets": "Were [Inquietude [light Version]] and [Samad dar rah ejdeha] executive produced by, edited by, and directed by [Samad dar-be-dar mishavad]'s director, star, and executive producer",
    "questionPatternModEntities": "Were M1 and M2 executive produced by , edited by , and directed by M0 's director , star , and executive producer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:g.12qhk8l3t .\n?x0 ns:film.director.film ns:g.12qhk8l3t .\n?x0 ns:film.producer.films_executive_produced ns:g.12qhk8l3t .\nns:g.121_c37n ns:film.film.directed_by ?x0 .\nns:g.121_c37n ns:film.film.edited_by ?x0 .\nns:g.121_c37n ns:film.film.executive_produced_by ?x0 .\nns:m.011qztzx ns:film.film.directed_by ?x0 .\nns:m.011qztzx ns:film.film.edited_by ?x0 .\nns:m.011qztzx ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 231398,
    "questionWithBrackets": "Who was a male Swedish cinematographer that was employed by [Royal Dramatic Theatre] and was employed by [Residenz Theatre]",
    "questionPatternModEntities": "Who was a male Swedish cinematographer that was employed by M2 and was employed by M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02qg49s .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.09rcs7 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 P2 M5 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Ingmar Bergman",
    "recursionDepth": 44
  },
  {
    "questionIdx": 119536,
    "questionWithBrackets": "Were [Kasal, Kasali, Kasalo] and [Love Begins with One Hello] executive produced by [Vic Sotto] and [Malou N. Santos] and directed by a film's director and writer",
    "questionPatternModEntities": "Were M1 and M4 executive produced by M2 and M3 and directed by a film 's director and writer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 a ns:film.film .\nns:m.027d5dt ns:film.film.directed_by ?x0 .\nns:m.027d5dt ns:film.film.executive_produced_by ns:m.0bffb2d .\nns:m.027d5dt ns:film.film.executive_produced_by ns:m.0gvyx6 .\nns:m.04jkwnh ns:film.film.directed_by ?x0 .\nns:m.04jkwnh ns:film.film.executive_produced_by ns:m.0bffb2d .\nns:m.04jkwnh ns:film.film.executive_produced_by ns:m.0gvyx6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM1 P3 ?x0 .\nM4 P2 M2 .\nM4 P2 M3 .\nM4 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 176594,
    "questionWithBrackets": "What was executive produced by [Ivan Rehder], written by a costume designer, and executive produced by a male actor",
    "questionPatternModEntities": "What was executive produced by M0 , written by a costume designer , and executive produced by a male actor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0hh2bk2 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.actor .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x2 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M2 .\n?x1 a M1 .\n?x2 a M3\n}",
    "expectedResponse": "Bright Day!",
    "recursionDepth": 44
  },
  {
    "questionIdx": 129443,
    "questionWithBrackets": "Were [Welcome to the Rileys], [Yatzy], [All That Matters Is Past], [Through A Glass, Darkly], and [90 Minutes] executive produced by a film editor and executive produced by a screenwriter",
    "questionPatternModEntities": "Were M2 , M3 , M4 , M5 , and M6 executive produced by a film editor and executive produced by a screenwriter",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x1 a ns:film.editor .\nns:m.04q86tb ns:film.film.executive_produced_by ?x0 .\nns:m.04q86tb ns:film.film.executive_produced_by ?x1 .\nns:m.0bdv8p3 ns:film.film.executive_produced_by ?x0 .\nns:m.0bdv8p3 ns:film.film.executive_produced_by ?x1 .\nns:m.0cjc8y7 ns:film.film.executive_produced_by ?x0 .\nns:m.0cjc8y7 ns:film.film.executive_produced_by ?x1 .\nns:m.0n5szc3 ns:film.film.executive_produced_by ?x0 .\nns:m.0n5szc3 ns:film.film.executive_produced_by ?x1 .\nns:m.0p79ptq ns:film.film.executive_produced_by ?x0 .\nns:m.0p79ptq ns:film.film.executive_produced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 ?x0 .\nM2 P0 ?x1 .\nM3 P0 ?x0 .\nM3 P0 ?x1 .\nM4 P0 ?x0 .\nM4 P0 ?x1 .\nM5 P0 ?x0 .\nM5 P0 ?x1 .\nM6 P0 ?x0 .\nM6 P0 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 57643,
    "questionWithBrackets": "Was [H. Jon Benjamin] influenced by a costume designer and star of [Chimes at Midnight] and influenced by an employee of [KJOE] and [WTHR]",
    "questionPatternModEntities": "Was M3 influenced by a costume designer and star of M2 and influenced by a employee of M0 and M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.06l8j5 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.07k4byy .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.07jpg0 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.07jpg0 .\nns:m.05rx__ ns:influence.influence_node.influenced_by ?x0 .\nns:m.05rx__ ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P1 M2 .\n?x1 P2 M2 .\nM3 P3 ?x0 .\nM3 P3 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 178805,
    "questionWithBrackets": "What was executive produced by, produced by, edited by, written by, and directed by a cinematographer of [The Weight of Chains]",
    "questionPatternModEntities": "What was executive produced by , produced by , edited by , written by , and directed by a cinematographer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0ds6ps9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0\n}",
    "expectedResponse": "The Presumption of Justice",
    "recursionDepth": 44
  },
  {
    "questionIdx": 752,
    "questionWithBrackets": "Did [Alan Becker] edit, write, executive produce, produce, and direct a prequel of [Animator vs Animation 3]",
    "questionPatternModEntities": "Did M1 edit , write , executive produce , produce , and direct a prequel of M0",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ns:m.010lfbym .\nns:m.0108mkjv ns:film.director.film ?x0 .\nns:m.0108mkjv ns:film.editor.film ?x0 .\nns:m.0108mkjv ns:film.producer.films_executive_produced ?x0 .\nns:m.0108mkjv ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.0108mkjv ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 181963,
    "questionWithBrackets": "What was produced by a Dutch founder of [Fortissimo Films], executive produced by [Meileen Choo], and executive produced by [Pawadee Chantanom]",
    "questionPatternModEntities": "What was produced by a Dutch founder of M2 , executive produced by M0 , and executive produced by M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.0bff24x .\n?x0 ns:film.film.executive_produced_by ns:m.0bff254 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.03d2c8d .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Last Life in the Universe",
    "recursionDepth": 44
  },
  {
    "questionIdx": 82101,
    "questionWithBrackets": "Was [The Pawnshop] written, produced, and directed by a British actor whose spouse played [Allisa Randall]",
    "questionPatternModEntities": "Was M3 written , produced , and directed by a British actor whose spouse played M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0s91n2_ .\nFILTER ( ?x0 != ?x1 ) .\nns:m.07m2js ns:film.film.directed_by ?x0 .\nns:m.07m2js ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.07m2js ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nM3 P3 ?x0 .\nM3 P4 ?x0 .\nM3 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 225102,
    "questionWithBrackets": "Who was a British film director whose parent influenced [Poppy Z. Brite] and was influenced by [Joseph Conrad] and [Henry James]",
    "questionPatternModEntities": "Who was a British film director whose parent influenced M3 and was influenced by M4 and M5",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:influence.influence_node.influenced ns:m.0n8cg .\n?x1 ns:influence.influence_node.influenced_by ns:m.040_9 .\n?x1 ns:influence.influence_node.influenced_by ns:m.0l99s\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\n?x1 P3 M4 .\n?x1 P3 M5\n}",
    "expectedResponse": "Louis Theroux",
    "recursionDepth": 44
  },
  {
    "questionIdx": 2235,
    "questionWithBrackets": "Did [Before Night Falls] star [Walkover]'s sequel's writer and art director, star [Antonio Zavala], and star [Lois Barrag\u00e1n]",
    "questionPatternModEntities": "Did M1 star M0 's sequel 's writer and art director , star M2 , and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 ns:film.film.prequel ns:m.0h_c2zg .\nns:m.0clh4y ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0clh4y ns:film.film.starring/ns:film.performance.actor ns:m.0gc5xdj .\nns:m.0clh4y ns:film.film.starring/ns:film.performance.actor ns:m.0w9jz4g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nM1 P3 ?x0 .\nM1 P3 M2 .\nM1 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  },
  {
    "questionIdx": 10427,
    "questionWithBrackets": "Did [Iron Man 2] star a film producer, star an art director of [Rushmore], and star [Jennifer Lynne Johnson] and [Kylette Zamora]",
    "questionPatternModEntities": "Did M2 star a film producer , star a art director of M0 , and star M3 and M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] , [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.024lt6 .\n?x1 a ns:film.producer .\nns:m.05qbckf ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.05qbckf ns:film.film.starring/ns:film.performance.actor ?x1 .\nns:m.05qbckf ns:film.film.starring/ns:film.performance.actor ns:m.0p97bft .\nns:m.05qbckf ns:film.film.starring/ns:film.performance.actor ns:m.0y5dr7q\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 a M1 .\nM2 P1 ?x0 .\nM2 P1 ?x1 .\nM2 P1 M3 .\nM2 P1 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 44
  },
  {
    "questionIdx": 85279,
    "questionWithBrackets": "Was [Viagem na Chuva] written, directed, edited, produced, and executive produced by [Far West: A True Western]'s editor and art director",
    "questionPatternModEntities": "Was M1 written , directed , edited , produced , and executive produced by M0 's editor and art director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0107hywx .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0107hywx .\nns:m.011p1tds ns:film.film.directed_by ?x0 .\nns:m.011p1tds ns:film.film.edited_by ?x0 .\nns:m.011p1tds ns:film.film.executive_produced_by ?x0 .\nns:m.011p1tds ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.011p1tds ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 44
  }
]