[
  {
    "questionIdx": 19553,
    "questionWithBrackets": "Did [Spiritual Kung Fu] and [Enter the Phoenix] star [Yuen Biao] and star an art director and executive producer of [CZ12]",
    "questionPatternModEntities": "Did M1 and M3 star M2 and star a art director and executive producer of M0",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.0hznzl6 .\n?x0 ns:film.producer.films_executive_produced ns:m.0hznzl6 .\nns:m.040p_b ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.040p_b ns:film.film.starring/ns:film.performance.actor ns:m.02nrln .\nns:m.09h355 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.09h355 ns:film.film.starring/ns:film.performance.actor ns:m.02nrln\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM3 P2 ?x0 .\nM3 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 123264,
    "questionWithBrackets": "Were [Return of the Jedi] and [Radioland Murders] written by and executive produced by a production company's founder and employee",
    "questionPatternModEntities": "Were M1 and M2 written by and executive produced by a production company 's founder and employee",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.production_company .\nns:m.08ktmx ns:film.film.executive_produced_by ?x0 .\nns:m.08ktmx ns:film.film.written_by ?x0 .\nns:m.0ddjy ns:film.film.executive_produced_by ?x0 .\nns:m.0ddjy ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 210693,
    "questionWithBrackets": "Which screenwriter that married [The Evening Star]'s star and married [Viviane Gaudet] directed [The Postman's White Nights]",
    "questionPatternModEntities": "Which screenwriter that married M3 's star and married M1 directed M2",
    "questionTemplate": "Which [NP_SIMPLE] that [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.director.film ns:m.011f1wxn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j10qps .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.05nysd .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0j10qps )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Andrei Konchalovsky",
    "recursionDepth": 37
  },
  {
    "questionIdx": 215691,
    "questionWithBrackets": "Who did a company's child and parent employ and [MyPoints.com] and [Federal Reserve System] employ",
    "questionPatternModEntities": "Who did a company 's child and parent employ and M1 and M2 employ",
    "questionTemplate": "Who did a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02xmb .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03btr4q .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Curtis Atkisson",
    "recursionDepth": 37
  },
  {
    "questionIdx": 193607,
    "questionWithBrackets": "Which actor whose spouse directed and wrote [Animals Distract Me] did [Franz Kafka] and [William Eggleston] influence",
    "questionPatternModEntities": "Which actor whose spouse directed and wrote M3 did M1 and M2 influence",
    "questionTemplate": "Which [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] did [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ns:m.03dpcd .\n?x0 ns:influence.influence_node.influenced_by ns:m.03f0324 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.0ft1rpp .\n?x1 ns:film.writer.film ns:m.0ft1rpp .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "David Lynch",
    "recursionDepth": 37
  },
  {
    "questionIdx": 181918,
    "questionWithBrackets": "What was produced by a Canadian cinematographer of [Elton John: Tantrums & Tiaras] and written by [Steve Hamilton Shaw] and [Kathy Greenberg]",
    "questionPatternModEntities": "What was produced by a Canadian cinematographer of M3 and written by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ns:m.0b3vx23 .\n?x0 ns:film.film.written_by ns:m.0k2bwd .\n?x1 ns:film.cinematographer.film ns:m.08hgwv .\n?x1 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Gnomeo & Juliet",
    "recursionDepth": 37
  },
  {
    "questionIdx": 9962,
    "questionWithBrackets": "Did [Howard Hughes] found [Electron Technologies, Inc.], found an employer of [Guy Meisl], and found [Trans World Airlines]",
    "questionPatternModEntities": "Did M1 found M2 , found a employer of M0 , and found M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.042x5dh .\nns:m.03n93 ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.03n93 ns:organization.organization_founder.organizations_founded ns:m.013w80 .\nns:m.03n93 ns:organization.organization_founder.organizations_founded ns:m.0gyt9_f\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 51501,
    "questionWithBrackets": "Was [Danielle Koenig] an Italian film editor that [Dante Alighieri] influenced and [Catherine Breillat] was influenced by",
    "questionPatternModEntities": "Was M0 a Italian film editor that M3 influenced and M2 was influenced by",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE] and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.0gcrj5 a ns:film.editor .\nns:m.0gcrj5 ns:influence.influence_node.influenced ns:m.01sws5 .\nns:m.0gcrj5 ns:influence.influence_node.influenced_by ns:m.028p0 .\nns:m.0gcrj5 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 P2 M4 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 58794,
    "questionWithBrackets": "Was [Hopelessly in June] executive produced by an art director of [Inquietude [light Version]] and [Osmosis Jones] and written by an actor",
    "questionPatternModEntities": "Was M3 executive produced by a art director of M0 and M1 and written by a actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_art_director.films_art_directed ns:m.011qztzx .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0dqwvw .\n?x1 a ns:film.actor .\nns:m.0h4_31c ns:film.film.executive_produced_by ?x0 .\nns:m.0h4_31c ns:film.film.written_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 a M2 .\nM3 P1 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 122137,
    "questionWithBrackets": "Were [O Porto] and [The Godfather Part III] edited by a cinematographer's sibling and edited by a screenwriter",
    "questionPatternModEntities": "Were M2 and M3 edited by a cinematographer 's sibling and edited by a screenwriter",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.cinematographer .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0_skr6c ns:film.film.edited_by ?x0 .\nns:m.0_skr6c ns:film.film.edited_by ?x2 .\nns:m.0y_yw ns:film.film.edited_by ?x0 .\nns:m.0y_yw ns:film.film.edited_by ?x2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\n?x2 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P1 ?x0 .\nM2 P1 ?x2 .\nM3 P1 ?x0 .\nM3 P1 ?x2\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 26429,
    "questionWithBrackets": "Did a Canadian founder of a film producer executive produce [Milius] and edit [Jersey Girl]",
    "questionPatternModEntities": "Did a Canadian founder of a film producer executive produce M1 and edit M0",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.02qzh2 .\n?x0 ns:film.producer.films_executive_produced ns:m.0_7n71j .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x0 P3 M2 .\n?x1 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 216049,
    "questionWithBrackets": "Who did a film's sequel's female producer marry and [Patty Walters] marry",
    "questionPatternModEntities": "Who did a film 's sequel 's female producer marry and M1 marry",
    "questionTemplate": "Who did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0vs7lf4 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x2 ns:film.film.prequel ?x3 .\n?x3 a ns:film.film .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0vs7lf4 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 M2 .\n?x2 P3 ?x3 .\n?x3 a M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Jamie Walters",
    "recursionDepth": 37
  },
  {
    "questionIdx": 144573,
    "questionWithBrackets": "What did [Kalpathi S. Suresh] produce, [Abburi Ravi] write, and a film editor's child direct",
    "questionPatternModEntities": "What did M1 produce , M0 write , and a film editor 's child direct",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0wrqjg1 .\n?x0 ns:film.film.written_by ns:m.026v1zh .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Santosh Subramaniam",
    "recursionDepth": 37
  },
  {
    "questionIdx": 164040,
    "questionWithBrackets": "What screenwriter did [The Oil Conspiracy]'s male writer's employer employ and [Temple University] employ",
    "questionPatternModEntities": "What screenwriter did M2 's male writer 's employer employ and M1 employ",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01jt2w .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 ns:film.writer.film ns:m.0j8ghjr .\n?x2 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M2 .\n?x2 P3 M3\n}",
    "expectedResponse": "Jan Krawitz",
    "recursionDepth": 37
  },
  {
    "questionIdx": 145507,
    "questionWithBrackets": "What did [Newmarket Films] and [Walt Disney Pictures] distribute and a film's cinematographer and editor produce",
    "questionPatternModEntities": "What did M0 and M1 distribute and a film 's cinematographer and editor produce",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.01795t .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.02nssb .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x1 ns:film.editor.film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "The Prestige",
    "recursionDepth": 37
  },
  {
    "questionIdx": 161941,
    "questionWithBrackets": "What person that a person married was employed by [Regent Seven Seas Cruises] and employed by [Radisson Seven Seas]",
    "questionPatternModEntities": "What person that a person married was employed by M1 and employed by M2",
    "questionTemplate": "What [NP_SIMPLE] that a [NP_SIMPLE] [VP_SIMPLE] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.053srj .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0q35m_y .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Maria Cabase",
    "recursionDepth": 37
  },
  {
    "questionIdx": 71821,
    "questionWithBrackets": "Was [Pop Skull] produced by and edited by [Leningrad Cowboys Go America]'s sequel's director, editor, and star",
    "questionPatternModEntities": "Was M1 produced by and edited by M0 's sequel 's director , editor , and star",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.editor.film ?x1 .\n?x1 ns:film.film.prequel ns:m.08tg5n .\nns:m.0cs86r8 ns:film.film.edited_by ?x0 .\nns:m.0cs86r8 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 142693,
    "questionWithBrackets": "What did [Claudine Merlin] and [Gina Pignier] edit and a film director's French sibling produce",
    "questionPatternModEntities": "What did M0 and M1 edit and a film director 's French sibling produce",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0bwb7z4 .\n?x0 ns:film.film.edited_by ns:m.0k3md0 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.director .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 P2 ?x2 .\n?x1 P3 M2 .\n?x2 a M3 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "The Big Feast",
    "recursionDepth": 37
  },
  {
    "questionIdx": 180501,
    "questionWithBrackets": "What was founded by a film producer, founded by a costume designer, and founded by [Jamie Selkirk]",
    "questionPatternModEntities": "What was founded by a film producer , founded by a costume designer , and founded by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x0 ns:organization.organization.founders ns:m.0bxj82 .\n?x1 a ns:film.producer .\n?x2 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M0 .\n?x1 a M1 .\n?x2 a M2\n}",
    "expectedResponse": "Weta Workshop; Weta Digital",
    "recursionDepth": 37
  },
  {
    "questionIdx": 44555,
    "questionWithBrackets": "Was [Agn\u00e8s Varda] a person that a director of [Le sabotier du val de Loire] and [Three Tickets for the 26th] married and influenced",
    "questionPatternModEntities": "Was M2 a person that a director of M0 and M1 married and influenced",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.07wvrk8 .\n?x0 ns:film.director.film ns:m.0gwdz5t .\nFILTER ( ns:m.01vylt != ?x0 ) .\nns:m.01vylt a ns:people.person .\nns:m.01vylt ns:influence.influence_node.influenced_by ?x0 .\nns:m.01vylt ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 171309,
    "questionWithBrackets": "What was directed by, edited by, and written by a French film editor's child",
    "questionPatternModEntities": "What was directed by , edited by , and written by a French film editor 's child",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.editor .\n?x2 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 P4 M1 .\n?x2 a M0\n}",
    "expectedResponse": "The Ceiling",
    "recursionDepth": 37
  },
  {
    "questionIdx": 99253,
    "questionWithBrackets": "Was a film producer that [Ennio Flaiano] was influenced by and [Semih Kaplano\u011flu] was influenced by a costume designer",
    "questionPatternModEntities": "Was a film producer that M2 was influenced by and M3 was influenced by a costume designer",
    "questionTemplate": "Was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ns:m.03cs629 .\n?x0 ns:influence.influence_node.influenced ns:m.0czp2t\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 213742,
    "questionWithBrackets": "Who did [Anthony Burgess] influence, an art director marry, and [Toba Metz] and [Christiane Kubrick] marry",
    "questionPatternModEntities": "Who did M1 influence , a art director marry , and M2 and M3 marry",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] , a [NP_SIMPLE] [VP_SIMPLE] , and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d4jl .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02g6jx0 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.09385j .\n?x1 a ns:film.film_art_director .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.02g6jx0 ) .\nFILTER ( ?x0 != ns:m.09385j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x1 a M4 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M2 ) .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Stanley Kubrick",
    "recursionDepth": 37
  },
  {
    "questionIdx": 128282,
    "questionWithBrackets": "Were [Tiger Cage], [Last Hero in China], [True Legend], [Snake in the Eagle's Shadow], and [The Hands of Shang-Chi] directed by a screenwriter's Chinese sibling",
    "questionPatternModEntities": "Were M2 , M3 , M4 , M5 , and M6 directed by a screenwriter 's Chinese sibling",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02_s2p ns:film.film.directed_by ?x0 .\nns:m.02pxxlq ns:film.film.directed_by ?x0 .\nns:m.07kf0d4 ns:film.film.directed_by ?x0 .\nns:m.0gkrk43 ns:film.film.directed_by ?x0 .\nns:m.0hyqv3d ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0 .\nM6 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 577,
    "questionWithBrackets": "Did [Agatha Sparrow]'s female American actor's spouse's sibling play [Clara Forsythe Allen] and [Queen Clarion]",
    "questionPatternModEntities": "Did M3 's female American actor 's spouse 's sibling play M0 and M1",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0283__w .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h2c_g0 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0gj65x5 .\n?x2 ns:people.person.gender ns:m.02zsn .\n?x2 ns:people.person.nationality ns:m.09c7w0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 P2 ?x2 .\n?x2 P1 M3 .\n?x2 P3 M2 .\n?x2 P4 M4 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 160713,
    "questionWithBrackets": "What male person was influenced by a film director's child and influenced by [Terry Wooten]",
    "questionPatternModEntities": "What male person was influenced by a film director 's child and influenced by M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.05w0hgg .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M3\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 37
  },
  {
    "questionIdx": 238048,
    "questionWithBrackets": "Who was influenced by a cinematographer, influenced by a film editor, and influenced by [Jack Kerouac]",
    "questionPatternModEntities": "Who was influenced by a cinematographer , influenced by a film editor , and influenced by M1",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.041mt .\n?x1 a ns:film.editor .\n?x2 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2 .\n?x2 a M3\n}",
    "expectedResponse": "Garret Schuelke; Haruki Murakami",
    "recursionDepth": 37
  },
  {
    "questionIdx": 150636,
    "questionWithBrackets": "What did a screenwriter executive produce and a Canadian screenwriter's child edit",
    "questionPatternModEntities": "What did a screenwriter executive produce and a Canadian screenwriter 's child edit",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x3 .\n?x2 a ns:film.writer .\n?x3 a ns:film.writer .\n?x3 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 a M0 .\n?x2 P2 ?x3 .\n?x3 P3 M1 .\n?x3 a M0\n}",
    "expectedResponse": "Piranha 3DD; Drive Angry",
    "recursionDepth": 37
  },
  {
    "questionIdx": 174916,
    "questionWithBrackets": "What was edited by, directed by, and executive produced by a female founder of [Interloper Films]",
    "questionPatternModEntities": "What was edited by , directed by , and executive produced by a female founder of M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0kqjl3 .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "Dig!",
    "recursionDepth": 37
  }
]