[
  {
    "questionIdx": 208645,
    "questionWithBrackets": "Which person was employed by [Kansas City Film Ad Company] and founded a company's child",
    "questionPatternModEntities": "Which person was employed by M1 and founded a company 's child",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0gy7412 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Walt Disney",
    "recursionDepth": 33
  },
  {
    "questionIdx": 82193,
    "questionWithBrackets": "Was [The Proposal] directed by [Anne Fletcher] and executive produced by [Birdee Pruitt]'s female actor",
    "questionPatternModEntities": "Was M2 directed by M3 and executive produced by M0 's female actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0bj9kwg .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.0421v9q ns:film.film.directed_by ns:m.0f9p8x .\nns:m.0421v9q ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 39496,
    "questionWithBrackets": "Did a screenwriter's spouse found [A Mighty Heart]'s producer and found [World Film Company]",
    "questionPatternModEntities": "Did a screenwriter 's spouse found M1 's producer and found M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0hzplml .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0fgm_l .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 217457,
    "questionWithBrackets": "Who founded [Disneynature] and founded a Canadian actor's employer",
    "questionPatternModEntities": "Who founded M1 and founded a Canadian actor 's employer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0416ycv .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.actor .\n?x2 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M3 .\n?x2 a M2\n}",
    "expectedResponse": "Walt Disney",
    "recursionDepth": 33
  },
  {
    "questionIdx": 53555,
    "questionWithBrackets": "Was [Edward C Forst] a person's Spanish German sibling's female sibling",
    "questionPatternModEntities": "Was M3 a person 's Spanish German sibling 's female sibling",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.03ww471 != ?x0 ) .\nns:m.03ww471 ns:people.person.gender ns:m.02zsn .\nns:m.03ww471 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 a M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M3 != ?x0 ) .\nM3 P0 ?x0 .\nM3 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 146048,
    "questionWithBrackets": "What did [Rhapsody in August]'s producer's parent direct, produce, and executive produce",
    "questionPatternModEntities": "What did M0 's producer 's parent direct , produce , and executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.07g36f\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 P4 M0\n}",
    "expectedResponse": "Kagemusha",
    "recursionDepth": 33
  },
  {
    "questionIdx": 142818,
    "questionWithBrackets": "What did [Damjan Kozole] and [Andy Bausch] write and [How Harry Became a Tree]'s art director's sibling direct",
    "questionPatternModEntities": "What did M0 and M1 write and M2 's art director 's sibling direct",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ns:m.038wxz .\n?x0 ns:film.film.written_by ns:m.05234yc .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.film_art_director.films_art_directed ns:m.0gkrryz .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 33
  },
  {
    "questionIdx": 116430,
    "questionWithBrackets": "Were [Eraserhead] and [The 3 Rs] edited by an art director that a cinematographer was influenced by",
    "questionPatternModEntities": "Were M2 and M3 edited by a art director that a cinematographer was influenced by",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that a [NP_SIMPLE] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 a ns:film.cinematographer .\nns:m.027jhb ns:film.film.edited_by ?x0 .\nns:m.0px9295 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nM2 P1 ?x0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 171003,
    "questionWithBrackets": "What was directed by an art director's sibling's parent and written by [Girish Dhamija]",
    "questionPatternModEntities": "What was directed by a art director 's sibling 's parent and written by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0jt1t9 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x3 a ns:film.film_art_director .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M1 .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "Yeh Hai Mumbai Meri Jaan; Zakhm",
    "recursionDepth": 33
  },
  {
    "questionIdx": 52161,
    "questionWithBrackets": "Was [Deh Namaki-ha] edited by and directed by [Arifmetika ubiystva]'s female producer's child",
    "questionPatternModEntities": "Was M2 edited by and directed by M0 's female producer 's child",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0ghsjzv .\n?x1 ns:people.person.gender ns:m.02zsn .\nns:m.0x1x8yb ns:film.film.directed_by ?x0 .\nns:m.0x1x8yb ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 128391,
    "questionWithBrackets": "Were [Tokyo Fist] and [A Snake of June] produced by [Tetsuo II: Body Hammer]'s prequel's writer, cinematographer, and director",
    "questionPatternModEntities": "Were M1 and M2 produced by M0 's prequel 's writer , cinematographer , and director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 ns:film.film.sequel ns:m.0brs6b .\nns:m.03m9g_y ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.09twfb ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\nM1 P4 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 157703,
    "questionWithBrackets": "What film producer married, influenced, and was influenced by [Antoine Bourseiller]'s spouse",
    "questionPatternModEntities": "What film producer married , influenced , and was influenced by M1 's spouse",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0jwhqh .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0jwhqh )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 33
  },
  {
    "questionIdx": 185406,
    "questionWithBrackets": "What was written by a person's parent's parent and directed by [Roger Donaldson]",
    "questionPatternModEntities": "What was written by a person 's parent 's parent and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.03n120 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P2 ?x3 .\n?x3 a M1\n}",
    "expectedResponse": "The Bounty",
    "recursionDepth": 33
  },
  {
    "questionIdx": 144365,
    "questionWithBrackets": "What did [John Gay] found, [Thomas Parnell] found, and a character found",
    "questionPatternModEntities": "What did M0 found , M1 found , and a character found",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.015kcp .\n?x0 ns:organization.organization.founders ns:m.03rt5q .\n?x1 a ns:fictional_universe.fictional_character\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 a M2\n}",
    "expectedResponse": "Scriblerus Club",
    "recursionDepth": 33
  },
  {
    "questionIdx": 70793,
    "questionWithBrackets": "Was [Paris, je t'aime] executive produced by [Sam Englebardt] and directed by [Django Films]'s French founder",
    "questionPatternModEntities": "Was M2 executive produced by M3 and directed by M0 's French founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03czmkw .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0bz3jx ns:film.film.directed_by ?x0 .\nns:m.0bz3jx ns:film.film.executive_produced_by ns:m.04mv787\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 M3 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 6194,
    "questionWithBrackets": "Did [EMEP Records] employ an Italian film producer and employ a character",
    "questionPatternModEntities": "Did M3 employ a Italian film producer and employ a character",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x1 a ns:fictional_universe.fictional_character .\nns:m.0nkkfw8 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0nkkfw8 ns:business.employer.employees/ns:business.employment_tenure.person ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2 .\nM3 P1 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 113089,
    "questionWithBrackets": "Were [Bade Dil Wala] and [Zamaana Deewana] directed by a film director and edited by an art director",
    "questionPatternModEntities": "Were M2 and M3 directed by a film director and edited by a art director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\n?x1 a ns:film.director .\nns:m.03m6ljb ns:film.film.directed_by ?x1 .\nns:m.03m6ljb ns:film.film.edited_by ?x0 .\nns:m.0btt8v ns:film.film.directed_by ?x1 .\nns:m.0btt8v ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nM2 P0 ?x0 .\nM2 P1 ?x1 .\nM3 P0 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 37546,
    "questionWithBrackets": "Did a parent of a Dutch actor direct and write [Salute for Three]",
    "questionPatternModEntities": "Did a parent of a Dutch actor direct and write M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.091m4db .\n?x0 ns:film.writer.film ns:m.091m4db .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.actor .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M0 .\n?x1 P3 M2 .\n?x1 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 13052,
    "questionWithBrackets": "Did [Leo Tolstoy] influence a female founder of [Hogarth Press] and influence [Manuel Mujica L\u00e1inez]",
    "questionPatternModEntities": "Did M2 influence a female founder of M0 and influence M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01r2q9 .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.01tz6vs ns:influence.influence_node.influenced ?x0 .\nns:m.01tz6vs ns:influence.influence_node.influenced ns:m.0cp2l9\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 234624,
    "questionWithBrackets": "Who was employed by [Louisiana State Police] and employed by an actor's spouse's employer",
    "questionPatternModEntities": "Who was employed by M1 and employed by a actor 's spouse 's employer",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0fb8w5 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x3 a ns:film.actor .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 a M2 .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "Francis Grevemberg",
    "recursionDepth": 33
  },
  {
    "questionIdx": 161664,
    "questionWithBrackets": "What person did an editor of [Lost Highway] marry and a cinematographer influence",
    "questionPatternModEntities": "What person did a editor of M2 marry and a cinematographer influence",
    "questionTemplate": "What [NP_SIMPLE] did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 a ns:film.cinematographer .\n?x2 ns:film.editor.film ns:m.01d259 .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 a M1 .\n?x2 P2 M2 .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "David Lynch",
    "recursionDepth": 33
  },
  {
    "questionIdx": 176414,
    "questionWithBrackets": "What was executive produced by [Edward McDonnell] and executive produced by [CZ12]'s art director and cinematographer",
    "questionPatternModEntities": "What was executive produced by M0 and executive produced by M1 's art director and cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0jw65p .\n?x1 ns:film.cinematographer.film ns:m.0hznzl6 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0hznzl6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Shanghai Knights",
    "recursionDepth": 33
  },
  {
    "questionIdx": 184469,
    "questionWithBrackets": "What was written by [Joel Spencer]'s employer's employee and written by an actor",
    "questionPatternModEntities": "What was written by M1 's employer 's employee and written by a actor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ?x3 .\n?x3 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0bs1b5\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 ?x3 .\n?x3 P2 M1\n}",
    "expectedResponse": "Re:Awakenings",
    "recursionDepth": 33
  },
  {
    "questionIdx": 169527,
    "questionWithBrackets": "What was directed and written by a costume designer, writer, and director of [The Wizard of Speed and Time]",
    "questionPatternModEntities": "What was directed and written by a costume designer , writer , and director of M0",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.director.film ns:m.083y0 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.083y0 .\n?x1 ns:film.writer.film ns:m.083y0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0 .\n?x1 P4 M0\n}",
    "expectedResponse": "Animato; The Wizard of Speed and Time",
    "recursionDepth": 33
  },
  {
    "questionIdx": 69319,
    "questionWithBrackets": "Was [Nicolai V. Krylov] employed by a film producer and employed by a film producer's parent",
    "questionPatternModEntities": "Was M1 employed by a film producer and employed by a film producer 's parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.producer .\n?x2 a ns:film.producer .\nns:m.0j7l7k4 ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.0j7l7k4 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\n?x2 a M0 .\nM1 P1 ?x0 .\nM1 P1 ?x2\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 217398,
    "questionWithBrackets": "Who founded [Bell Labs], founded [Aerial Experiment Association], and founded a film distributor",
    "questionPatternModEntities": "Who founded M1 , founded M2 , and founded a film distributor",
    "questionTemplate": "Who [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0179y .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02fggr .\n?x1 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Alexander Graham Bell",
    "recursionDepth": 33
  },
  {
    "questionIdx": 178168,
    "questionWithBrackets": "What was executive produced by and directed by [The Brown Bunny]'s cinematographer, editor, and costume designer",
    "questionPatternModEntities": "What was executive produced by and directed by M0 's cinematographer , editor , and costume designer",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.01n9cy .\n?x1 ns:film.editor.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0 .\n?x1 P4 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 33
  },
  {
    "questionIdx": 204898,
    "questionWithBrackets": "Which film was directed by and was edited by a Dutch art director",
    "questionPatternModEntities": "Which film was directed by and was edited by a Dutch art director",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by and was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 a ns:film.film_art_director .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "The Monster of Nix",
    "recursionDepth": 33
  },
  {
    "questionIdx": 90883,
    "questionWithBrackets": "Was a Spanish costume designer that [Joanna Dunn] and [Georges Braque] were influenced by an actor",
    "questionPatternModEntities": "Was a Spanish costume designer that M2 and M3 were influenced by a actor",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] and [entity] were [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:influence.influence_node.influenced ns:m.037f3 .\n?x0 ns:influence.influence_node.influenced ns:m.0k_1y7t .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 227820,
    "questionWithBrackets": "Who was a Mexican film director whose male sibling executive produced [Scriptfellas]",
    "questionPatternModEntities": "Who was a Mexican film director whose male sibling executive produced M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.05sp75r .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\n?x1 P3 M4 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Fernando Rovzar",
    "recursionDepth": 33
  },
  {
    "questionIdx": 99848,
    "questionWithBrackets": "Was a film that was executive produced by [Agn\u00e8s Mentre] and starred [Adam Kozlowski] [Lay the Favorite]",
    "questionPatternModEntities": "Was a film that was executive produced by M3 and starred M2 M0",
    "questionTemplate": "Was a [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0gy0p_h a ns:film.film .\nns:m.0gy0p_h ns:film.film.executive_produced_by ns:m.04mvyjq .\nns:m.0gy0p_h ns:film.film.starring/ns:film.performance.actor ns:m.0v_2g7k\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 214000,
    "questionWithBrackets": "Who did [DreamWorks Studios] employ and a production company acquired by [NBCUniversal] employ",
    "questionPatternModEntities": "Who did M1 employ and a production company acquired by M3 employ",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE] by [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01gb54 .\n?x1 a ns:film.production_company .\n?x1 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02_l39\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 a M2\n}",
    "expectedResponse": "Steven Spielberg; Stacey Snider",
    "recursionDepth": 33
  },
  {
    "questionIdx": 133002,
    "questionWithBrackets": "What French film producer founded and was employed by a producer of [Transporter 3]",
    "questionPatternModEntities": "What French film producer founded and was employed by a producer of M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.047vq5n\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x0 a M0 .\n?x1 P3 M2\n}",
    "expectedResponse": "Luc Besson",
    "recursionDepth": 34
  }
]