[
  {
    "questionIdx": 7940,
    "questionWithBrackets": "Did [Fucke-Michels] and [H\u00f6chstetter] marry a female German sibling of [Eva Braun]",
    "questionPatternModEntities": "Did M3 and M4 marry a female German sibling of M0",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.02n7m .\nFILTER ( ?x0 != ns:m.02n7m ) .\nFILTER ( ns:m.0v8xw_m != ?x0 ) .\nFILTER ( ns:m.0v8xwwd != ?x0 ) .\nns:m.0v8xw_m ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0v8xwwd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M3 != ?x0 ) .\nFILTER ( M4 != ?x0 ) .\nM3 P3 ?x0 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 60667,
    "questionWithBrackets": "Was [Jacky Heung] a Chinese actor whose parent founded [HK Express] and [Ocean Shores Video]",
    "questionPatternModEntities": "Was M2 a Chinese actor whose parent founded M0 and M1",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.05xmql .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0f3xfm .\nns:m.03qn51m a ns:film.actor .\nns:m.03qn51m ns:people.person.nationality ns:m.0d05w3 .\nns:m.03qn51m ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 M4 .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 83547,
    "questionWithBrackets": "Was [Tie ban shao] written by and directed by a Chinese sibling of [Ning Dai]",
    "questionPatternModEntities": "Was M2 written by and directed by a Chinese sibling of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0bfrxkv .\nFILTER ( ?x0 != ns:m.0bfrxkv ) .\nns:m.0ndg46b ns:film.film.directed_by ?x0 .\nns:m.0ndg46b ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 148820,
    "questionWithBrackets": "What did a child of a company produce and [Jesse Berger] executive produce",
    "questionPatternModEntities": "What did a child of a company produce and M0 executive produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] of a [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.0gwn49k .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Oblivion",
    "recursionDepth": 31
  },
  {
    "questionIdx": 65211,
    "questionWithBrackets": "Was [Luigi De Laurentiis] an Italian film producer whose sibling produced [Gay Cock Cravers] and [Amityville II: The Possession]",
    "questionPatternModEntities": "Was M2 a Italian film producer whose sibling produced M0 and M1",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.06pqx7 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09vp3rk .\nFILTER ( ns:m.0bb8v9q != ?x0 ) .\nns:m.0bb8v9q a ns:film.producer .\nns:m.0bb8v9q ns:people.person.nationality ns:m.03rjj .\nns:m.0bb8v9q ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 P2 M4 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 47326,
    "questionWithBrackets": "Was [Bears and Man] produced and distributed by a Canadian film producer's employer",
    "questionPatternModEntities": "Was M2 produced and distributed by a Canadian film producer 's employer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.0d060g .\nns:m.0qfq7xj ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0qfq7xj ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 18838,
    "questionWithBrackets": "Did [Savages] star [Seann William Scott] and star [Ventanarosa]'s Mexican founder",
    "questionPatternModEntities": "Did M2 star M3 and star M0 's Mexican founder",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0284zcx .\n?x0 ns:people.person.nationality ns:m.0b90_r .\nns:m.0gmd3k7 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0gmd3k7 ns:film.film.starring/ns:film.performance.actor ns:m.03n08b\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 22094,
    "questionWithBrackets": "Did [The Flat Jungle]'s producer marry and influence [A Room in Town]'s costume designer's parent",
    "questionPatternModEntities": "Did M0 's producer marry and influence M1 's costume designer 's parent",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0gsycrd .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 ns:film.film_costumer_designer.costume_design_for_film ns:m.0404hwv .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x1 .\n?x1 P3 ?x2 .\n?x2 P4 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 182096,
    "questionWithBrackets": "What was produced by a child of a production company and distributed by [Sony Music Entertainment]",
    "questionPatternModEntities": "What was produced by a child of a production company and distributed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.043g7l .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Pink Floyd \u2013 The Wall",
    "recursionDepth": 31
  },
  {
    "questionIdx": 172940,
    "questionWithBrackets": "What was edited and produced by [Pickels In A Pickle]'s German editor's sibling",
    "questionPatternModEntities": "What was edited and produced by M1 's German editor 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:film.editor.film ns:m.0jsdgcz .\n?x2 ns:people.person.nationality ns:m.0345h .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M0 .\n?x2 P4 M1 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "The Periwig-Maker",
    "recursionDepth": 31
  },
  {
    "questionIdx": 81651,
    "questionWithBrackets": "Was [The Masquerader] a film whose writer and editor influenced [Wes Anderson] and [Will Hay]",
    "questionPatternModEntities": "Was M2 a film whose writer and editor influenced M0 and M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.02k_gj .\n?x0 ns:influence.influence_node.influenced ns:m.02ld6x .\nns:m.08b2hs a ns:film.film .\nns:m.08b2hs ns:film.film.edited_by ?x0 .\nns:m.08b2hs ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 194658,
    "questionWithBrackets": "Which character did [Malaak Compton Rock] marry and a costume designer's sibling influence",
    "questionPatternModEntities": "Which character did M1 marry and a costume designer 's sibling influence",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04dn76t .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ns:m.04dn76t ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M2 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Chris Rock",
    "recursionDepth": 31
  },
  {
    "questionIdx": 92918,
    "questionWithBrackets": "Was a cinematographer that [Son Seul] was written by and was edited by [Daniel Mall]",
    "questionPatternModEntities": "Was a cinematographer that M2 was written by and was edited by M0",
    "questionTemplate": "Was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0114b77r a ns:film.cinematographer .\nns:m.0114b77r ns:film.editor.film ns:m.0110gw14 .\nns:m.0114b77r ns:film.writer.film ns:m.0110gw14\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M2 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 86397,
    "questionWithBrackets": "Was [Wee Sing Together] produced and written by a cinematographer's American child",
    "questionPatternModEntities": "Was M2 produced and written by a cinematographer 's American child",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.cinematographer .\nns:m.0crrpkw ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0crrpkw ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 122000,
    "questionWithBrackets": "Were [Noel Fielding], [Takashi Miike], [Joe Velikovsky], [Vernon Chatman], [Ellen Stagg], and [Don Hertzfeldt] influenced by an art director",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , M5 , and M6 influenced by a art director",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\nns:m.01dtbz ns:influence.influence_node.influenced_by ?x0 .\nns:m.01dxx3 ns:influence.influence_node.influenced_by ?x0 .\nns:m.057qgw ns:influence.influence_node.influenced_by ?x0 .\nns:m.05c3v_5 ns:influence.influence_node.influenced_by ?x0 .\nns:m.065zt7y ns:influence.influence_node.influenced_by ?x0 .\nns:m.0bz60q ns:influence.influence_node.influenced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM2 P0 ?x0 .\nM3 P0 ?x0 .\nM4 P0 ?x0 .\nM5 P0 ?x0 .\nM6 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 215955,
    "questionWithBrackets": "Who did a film editor that executive produced and directed [The Last Drop of Water] influence",
    "questionPatternModEntities": "Who did a film editor that executive produced and directed M2 influence",
    "questionTemplate": "Who did a [NP_SIMPLE] that [VP_SIMPLE] and [VP_SIMPLE] [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 a ns:film.editor .\n?x1 ns:film.director.film ns:m.04f3d2x .\n?x1 ns:film.producer.films_executive_produced ns:m.04f3d2x\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "Alfred Hitchcock; Ingmar Bergman",
    "recursionDepth": 31
  },
  {
    "questionIdx": 29325,
    "questionWithBrackets": "Did a character found [Sonal Raju Kariya]'s sibling's British parent's employer",
    "questionPatternModEntities": "Did a character found M2 's sibling 's British parent 's employer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x2 ns:people.person.nationality ns:m.07ssc .\n?x3 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0wy8tr9 .\nFILTER ( ?x3 != ns:m.0wy8tr9 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\n?x2 P3 ?x3 .\n?x3 P4 M2 .\nFILTER ( ?x3 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 12685,
    "questionWithBrackets": "Did [L. Rezan Ye\u015filba\u015f] edit, direct, and produce a sequel of [Bride of the Monster]",
    "questionPatternModEntities": "Did M1 edit , direct , and produce a sequel of M0",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.01l40 .\nns:m.0js8xjr ns:film.director.film ?x0 .\nns:m.0js8xjr ns:film.editor.film ?x0 .\nns:m.0js8xjr ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 194174,
    "questionWithBrackets": "Which art director that was influenced by [Jack Smith] and [Franz Kafka] did a film producer marry",
    "questionPatternModEntities": "Which art director that was influenced by M1 and M2 did a film producer marry",
    "questionTemplate": "Which [NP_SIMPLE] that was [VP_SIMPLE] by [entity] and [entity] did a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:influence.influence_node.influenced_by ns:m.03f0324 .\n?x0 ns:influence.influence_node.influenced_by ns:m.07kwmh .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.producer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "David Lynch",
    "recursionDepth": 31
  },
  {
    "questionIdx": 172658,
    "questionWithBrackets": "What was distributed by [Warner Bros. Entertainment], distributed by [Warner Independent Pictures], and produced by [National Geographic Society]",
    "questionPatternModEntities": "What was distributed by M0 , distributed by M1 , and produced by M2",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.06s342 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.086k8 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.05dp2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2\n}",
    "expectedResponse": "March of the Penguins",
    "recursionDepth": 31
  },
  {
    "questionIdx": 180896,
    "questionWithBrackets": "What was produced and executive produced by a Canadian film editor's sibling",
    "questionPatternModEntities": "What was produced and executive produced by a Canadian film editor 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.editor .\n?x2 ns:people.person.nationality ns:m.0d060g .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Heaven on Earth",
    "recursionDepth": 31
  },
  {
    "questionIdx": 42698,
    "questionWithBrackets": "Did an employer of [Evan Bourne] employ [Alfred Radcliffe-Brown] and employ a character",
    "questionPatternModEntities": "Did a employer of M0 employ M1 and employ a character",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03drkk .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.07gs6m .\n?x1 a ns:fictional_universe.fictional_character\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 149597,
    "questionWithBrackets": "What did a female person that founded [Mozark Productions] and [The Claudia Foundation] write",
    "questionPatternModEntities": "What did a female person that founded M1 and M2 write",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:people.person .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.02w72_z .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.05kmbc5 .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 P1 M2 .\n?x1 P2 M3 .\n?x1 a M0\n}",
    "expectedResponse": "Bridegroom",
    "recursionDepth": 31
  },
  {
    "questionIdx": 178267,
    "questionWithBrackets": "What was executive produced by and edited by a female editor of [A Place at the Table]",
    "questionPatternModEntities": "What was executive produced by and edited by a female editor of M1",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:film.editor.film ns:m.0hy_t9b .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "The Road to Fame",
    "recursionDepth": 31
  },
  {
    "questionIdx": 178289,
    "questionWithBrackets": "What was executive produced by and edited by an actor that [Toshiko Kobayashi] married",
    "questionPatternModEntities": "What was executive produced by and edited by a actor that M1 married",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 a ns:film.actor .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hnqmzc .\nFILTER ( ?x1 != ns:m.0hnqmzc )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 a M0 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Antonio Gaudi",
    "recursionDepth": 32
  },
  {
    "questionIdx": 54234,
    "questionWithBrackets": "Was [Errors of the Human Body] written by a male person and executive produced by [Ross Bryan]",
    "questionPatternModEntities": "Was M2 written by a male person and executive produced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.0rh7d23 ns:film.film.executive_produced_by ns:m.0pkyh8k .\nns:m.0rh7d23 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 M3 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 96984,
    "questionWithBrackets": "Was a film director whose spouse founded and was employed by [Lorimar Television] [Rosanna Arquette]",
    "questionPatternModEntities": "Was a film director whose spouse founded and was employed by M0 M1",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.01p5yn .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01p5yn .\nFILTER ( ns:m.01wk51 != ?x0 ) .\nns:m.01wk51 a ns:film.director .\nns:m.01wk51 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 213723,
    "questionWithBrackets": "Who did [Andrew Silverman] marry and a British sibling of [Nicholas Cowell] marry",
    "questionPatternModEntities": "Who did M1 marry and a British sibling of M2 marry",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] and a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0wfddxg .\n?x1 ns:people.person.nationality ns:m.07ssc .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.04jfj7z .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0wfddxg ) .\nFILTER ( ?x1 != ns:m.04jfj7z )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != M2 )\n}",
    "expectedResponse": "Lauren Silverman",
    "recursionDepth": 32
  },
  {
    "questionIdx": 44167,
    "questionWithBrackets": "Was [Across 110th Street] written by [Wally Ferris] and executive produced by [Mrs. Cratchit]'s child's actor",
    "questionPatternModEntities": "Was M1 written by M2 and executive produced by M0 's child 's actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.059q64k .\nns:m.04kvfm ns:film.film.executive_produced_by ?x0 .\nns:m.04kvfm ns:film.film.written_by ns:m.0jt07d\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 66399,
    "questionWithBrackets": "Was [Mariya Petkova] a French male person that founded a film distributor",
    "questionPatternModEntities": "Was M1 a French male person that founded a film distributor",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\nns:m.09ppmn a ns:people.person .\nns:m.09ppmn ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.09ppmn ns:people.person.gender ns:m.05zppz .\nns:m.09ppmn ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 M3 .\nM1 P2 M4 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 59002,
    "questionWithBrackets": "Was [Human Rights Association] founded by [Ivory Coast], founded by [Slovakia], and founded by [Paraguay]",
    "questionPatternModEntities": "Was M0 founded by M1 , founded by M2 , and founded by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02r1shh ns:organization.organization.founders ns:m.05v10 .\nns:m.02r1shh ns:organization.organization.founders ns:m.06npd .\nns:m.02r1shh ns:organization.organization.founders ns:m.0fv4v\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P0 M2 .\nM0 P0 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 147789,
    "questionWithBrackets": "What did [Vicente Aranda] direct and a German star of [Cronolog\u00eda] direct",
    "questionPatternModEntities": "What did M0 direct and a German star of M2 direct",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.0bs_48 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0gbqpfl .\n?x1 ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Lumi\u00e8re and Company",
    "recursionDepth": 32
  },
  {
    "questionIdx": 167970,
    "questionWithBrackets": "What was a company whose founder founded and was employed by [StumbleUpon]",
    "questionPatternModEntities": "What was a company whose founder founded and was employed by M1",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0390wb .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0390wb\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Uber; StumbleUpon",
    "recursionDepth": 32
  }
]