[
  {
    "questionIdx": 7200,
    "questionWithBrackets": "Did [FC Schaffhausen], [FC Winterthur], [FK Austria Wien], [FC Tirol Innsbruck], [FC Frauenfeld], and [VfB Stuttgart] employ a person's German sibling",
    "questionPatternModEntities": "Did M2 , M3 , M4 , M5 , M6 , and M7 employ a person 's German sibling",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0345h .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nns:m.025tjy0 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0371rb ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.03mp37 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.065y5df ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0c5wln ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0f1lkk ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0 .\nM6 P2 ?x0 .\nM7 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 78888,
    "questionWithBrackets": "Was [That Justice Be Done] directed by [Thomas Cappelen Malling], produced by a film producer, and edited by [Muchacho besador]'s actor",
    "questionPatternModEntities": "Was M2 directed by M3 , produced by a film producer , and edited by M1 's actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0w1xgbr .\nns:m.026m0y_ ns:film.film.directed_by ns:m.0bmdc4v .\nns:m.026m0y_ ns:film.film.edited_by ?x1 .\nns:m.026m0y_ ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 ?x1 .\nM2 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 60908,
    "questionWithBrackets": "Was [Jan Persson] a Swedish cinematographer that [Yrrol] was edited by and [Ronia, the Robber's Daughter] was edited by",
    "questionPatternModEntities": "Was M0 a Swedish cinematographer that M2 was edited by and M3 was edited by",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.01wmwcz a ns:film.cinematographer .\nns:m.01wmwcz ns:film.editor.film ns:m.04m_qb1 .\nns:m.01wmwcz ns:film.editor.film ns:m.0dgn3s6 .\nns:m.01wmwcz ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 P1 M4 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 230749,
    "questionWithBrackets": "Who was a film editor that [The 400 Blows]'s star married, was influenced by, and influenced",
    "questionPatternModEntities": "Who was a film editor that M2 's star married , was influenced by , and influenced",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.01cqks .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P3 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Agn\u00e8s Varda",
    "recursionDepth": 39
  },
  {
    "questionIdx": 143647,
    "questionWithBrackets": "What did [Goat Story 2]'s editor, cinematographer, and art director produce and [Patrick Ewald] and [Shaked Berenson] executive produce",
    "questionPatternModEntities": "What did M2 's editor , cinematographer , and art director produce and M0 and M1 executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.0h0t4pz .\n?x0 ns:film.film.executive_produced_by ns:m.0h0t4q7 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0nbtt_1 .\n?x1 ns:film.editor.film ns:m.0nbtt_1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0nbtt_1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M2 .\n?x1 P4 M2\n}",
    "expectedResponse": "Goat Story",
    "recursionDepth": 39
  },
  {
    "questionIdx": 116740,
    "questionWithBrackets": "Were [Flags of Our Fathers] and [Memoirs of a Geisha] produced by a costume designer's male parent and distributed by [DreamWorks Studios]",
    "questionPatternModEntities": "Were M2 and M4 produced by a costume designer 's male parent and distributed by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 a ns:film.film_costumer_designer .\nns:m.08fn5b ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.01gb54 .\nns:m.08fn5b ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0drnwh ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.01gb54 .\nns:m.0drnwh ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 M3 .\nM2 P3 ?x0 .\nM4 P2 M3 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 115741,
    "questionWithBrackets": "Were [Dil Hai Ke Manta Nahin] and [Aashiqui] executive produced by a male sibling of [Sheila Bhatt] and directed by [Mahesh Bhatt]",
    "questionPatternModEntities": "Were M2 and M4 executive produced by a male sibling of M0 and directed by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.010r3gbk .\nFILTER ( ?x0 != ns:m.010r3gbk ) .\nns:m.095r59 ns:film.film.directed_by ns:m.04rs03 .\nns:m.095r59 ns:film.film.executive_produced_by ?x0 .\nns:m.0gfgk5 ns:film.film.directed_by ns:m.04rs03 .\nns:m.0gfgk5 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nM2 P2 ?x0 .\nM2 P3 M3 .\nM4 P2 ?x0 .\nM4 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 48155,
    "questionWithBrackets": "Was [Blues for the Avatar] directed, edited, executive produced, produced, and written by [Maryam Sayyad]'s parent",
    "questionPatternModEntities": "Was M1 directed , edited , executive produced , produced , and written by M0 's parent",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0n4cyvn .\nns:m.0znn7j_ ns:film.film.directed_by ?x0 .\nns:m.0znn7j_ ns:film.film.edited_by ?x0 .\nns:m.0znn7j_ ns:film.film.executive_produced_by ?x0 .\nns:m.0znn7j_ ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0znn7j_ ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 230994,
    "questionWithBrackets": "Who was a film producer whose sibling was influenced by [Bob Newhart] and [Steve Martin] and married [Portia de Rossi]",
    "questionPatternModEntities": "Who was a film producer whose sibling was influenced by M2 and M3 and married M4",
    "questionTemplate": "Who was a [NP_SIMPLE] whose [ROLE_SIMPLE] was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:influence.influence_node.influenced_by ns:m.012gq6 .\n?x1 ns:influence.influence_node.influenced_by ns:m.0p_47 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.01pcz9 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.01pcz9 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M2 .\n?x1 P1 M3 .\n?x1 P2 M4 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M4 )\n}",
    "expectedResponse": "Vance DeGeneres",
    "recursionDepth": 39
  },
  {
    "questionIdx": 63136,
    "questionWithBrackets": "Was [Kitty Kornered]'s director influenced by a film distributor's male founder and influenced by [Buster Keaton]",
    "questionPatternModEntities": "Was M1 's director influenced by a film distributor 's male founder and influenced by M0",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.04sp_n .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0btj0 .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 P2 ?x2 .\n?x1 P3 M2 .\n?x2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 184449,
    "questionWithBrackets": "What was written by [Jeff Nathanson], produced by a female person, and directed by [Allen Hughes]",
    "questionPatternModEntities": "What was written by M0 , produced by a female person , and directed by M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.0jx22s .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ns:m.08rnj6 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 P3 M3 .\n?x1 a M2\n}",
    "expectedResponse": "New York, I Love You",
    "recursionDepth": 39
  },
  {
    "questionIdx": 127945,
    "questionWithBrackets": "Were [The Trial] and [Too Much Johnson] written and edited by a film's writer, costume designer, and cinematographer",
    "questionPatternModEntities": "Were M1 and M2 written and edited by a film 's writer , costume designer , and cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 a ns:film.film .\nns:m.069mcz ns:film.film.edited_by ?x0 .\nns:m.069mcz ns:film.film.written_by ?x0 .\nns:m.0bh75n ns:film.film.edited_by ?x0 .\nns:m.0bh75n ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 117308,
    "questionWithBrackets": "Were [God of Gamblers] and [A True Mob Story] produced by [Andrew Lau] and produced by a film producer's Chinese child",
    "questionPatternModEntities": "Were M2 and M4 produced by M3 and produced by a film producer 's Chinese child",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.producer .\nns:m.073txn ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.073txn ns:film.film.produced_by|ns:film.film.production_companies ns:m.069_0y .\nns:m.0bqs4_n ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bqs4_n ns:film.film.produced_by|ns:film.film.production_companies ns:m.069_0y\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM4 P2 ?x0 .\nM4 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 184910,
    "questionWithBrackets": "What was written by [The Act of Killing]'s executive producer, executive produced by [Kevin L. Beggs], and produced by a film editor",
    "questionPatternModEntities": "What was written by M1 's executive producer , executive produced by M0 , and produced by a film editor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ns:m.0fq3wmx .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.editor .\n?x2 ns:film.producer.films_executive_produced ns:m.0lqh8nl\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 ?x2 .\n?x1 P3 M1 .\n?x2 a M2\n}",
    "expectedResponse": "Grizzly Man",
    "recursionDepth": 39
  },
  {
    "questionIdx": 181098,
    "questionWithBrackets": "What was produced by [CZ12]'s producer, cinematographer, and art director and distributed by [TriStar Pictures] and [Sony Pictures Entertainment]",
    "questionPatternModEntities": "What was produced by M2 's producer , cinematographer , and art director and distributed by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.030_1m .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03rwz3 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0hznzl6 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0hznzl6 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0hznzl6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M2 .\n?x1 P4 M2\n}",
    "expectedResponse": "Gorgeous",
    "recursionDepth": 39
  },
  {
    "questionIdx": 64917,
    "questionWithBrackets": "Was [Louis C.K.: Chewed Up] directed and edited by a Mexican actor that an actor influenced",
    "questionPatternModEntities": "Was M2 directed and edited by a Mexican actor that a actor influenced",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x1 a ns:film.actor .\nns:m.0cr_ltd ns:film.film.directed_by ?x0 .\nns:m.0cr_ltd ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 a M0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 85687,
    "questionWithBrackets": "Was [Visions of Europe] directed by a female person's sibling and directed by [Theo Angelopoulos] and [Jean-Pierre Dardenne]",
    "questionPatternModEntities": "Was M2 directed by a female person 's sibling and directed by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0gkshd_ ns:film.film.directed_by ?x0 .\nns:m.0gkshd_ ns:film.film.directed_by ns:m.06zf4cd .\nns:m.0gkshd_ ns:film.film.directed_by ns:m.0gts8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 91588,
    "questionWithBrackets": "Was a character influenced by [Billy Lyell] and [Albert Camus] and influenced by [Enistasious Tosh Angelos]'s female spouse",
    "questionPatternModEntities": "Was a character influenced by M1 and M2 and influenced by M4 's female spouse",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0gty1_b .\n?x0 ns:influence.influence_node.influenced_by ns:m.0lcx .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0k9zgnq .\nFILTER ( ?x1 != ns:m.0k9zgnq )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M4 .\nFILTER ( ?x1 != M4 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 175798,
    "questionWithBrackets": "What was edited, written, directed, and executive produced by a spouse of [Stephanie Chao-Parkes]'s spouse",
    "questionPatternModEntities": "What was edited , written , directed , and executive produced by a spouse of M0 's spouse",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0z6lc6t .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.0z6lc6t )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 ?x2 .\n?x2 P4 M0 .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M0 )\n}",
    "expectedResponse": "Under the Palms",
    "recursionDepth": 39
  },
  {
    "questionIdx": 145125,
    "questionWithBrackets": "What did [Martin \u0160ul\u00edk] write, [Good Night, Dear]'s director and cinematographer produce, and [Janice Toomey] edit",
    "questionPatternModEntities": "What did M0 write , M2 's director and cinematographer produce , and M1 edit",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0k22qp .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ns:m.0clq39 .\n?x1 ns:film.cinematographer.film ns:m.0tm61sc .\n?x1 ns:film.director.film ns:m.0tm61sc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 P3 M2 .\n?x1 P4 M2\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 39
  },
  {
    "questionIdx": 129199,
    "questionWithBrackets": "Were [W.E.] and [Filth and Wisdom] directed by and written by a female executive producer of [Madonna: The Confessions Tour] and [I Am Because We Are]",
    "questionPatternModEntities": "Were M3 and M4 directed by and written by a female executive producer of M0 and M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.03cfts5 .\n?x0 ns:film.producer.films_executive_produced ns:m.0djc1kz .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.02vpvxm ns:film.film.directed_by ?x0 .\nns:m.02vpvxm ns:film.film.written_by ?x0 .\nns:m.0ch4wh_ ns:film.film.directed_by ?x0 .\nns:m.0ch4wh_ ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM4 P2 ?x0 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 39
  },
  {
    "questionIdx": 88634,
    "questionWithBrackets": "Was a Canadian screenwriter's parent influenced by [William S. Burroughs] and [Wyndham Lewis] and influenced by [Marcel Duchamp]",
    "questionPatternModEntities": "Was a Canadian screenwriter 's parent influenced by M0 and M1 and influenced by M2",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced_by ns:m.0157fx .\n?x0 ns:influence.influence_node.influenced_by ns:m.08433 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0bqch .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x1 P2 M4 .\n?x1 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 1543,
    "questionWithBrackets": "Did [Antoine Bourseiller] marry an actor that married, was influenced by, and influenced [Samuel Cook]",
    "questionPatternModEntities": "Did M2 marry a actor that married , was influenced by , and influenced M1",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] that [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ns:m.0ggbl8x .\n?x0 ns:influence.influence_node.influenced_by ns:m.0ggbl8x .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0ggbl8x .\nFILTER ( ?x0 != ns:m.0ggbl8x ) .\nFILTER ( ns:m.0jwhqh != ?x0 ) .\nns:m.0jwhqh ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 P2 M1 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 58667,
    "questionWithBrackets": "Was [Holiday Makers] written by, executive produced by, and directed by a film's art director and editor",
    "questionPatternModEntities": "Was M1 written by , executive produced by , and directed by a film 's art director and editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.film_art_director.films_art_directed ?x1 .\n?x1 a ns:film.film .\nns:m.0cp1jxk ns:film.film.directed_by ?x0 .\nns:m.0cp1jxk ns:film.film.executive_produced_by ?x0 .\nns:m.0cp1jxk ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 39
  },
  {
    "questionIdx": 8264,
    "questionWithBrackets": "Did [George Eliot] influence [J. K. Rowling], marry [Agnes Jervis]'s male spouse, and marry [John Walter Cross]",
    "questionPatternModEntities": "Did M2 influence M3 , marry M1 's male spouse , and marry M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0pxld58 .\nFILTER ( ?x0 != ns:m.0pxld58 ) .\nFILTER ( ns:m.03d_m != ?x0 ) .\nFILTER ( ns:m.03d_m != ns:m.0pxlfm8 ) .\nns:m.03d_m ns:influence.influence_node.influenced ns:m.042xh .\nns:m.03d_m ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.03d_m ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0pxlfm8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M4 ) .\nM2 P1 ?x0 .\nM2 P1 M4 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 57776,
    "questionWithBrackets": "Was [Halloween II] executive produced by a production company's Italian founder and edited by [Robert Q. Lovett] and [Janice Hampton]",
    "questionPatternModEntities": "Was M2 executive produced by a production company 's Italian founder and edited by M3 and M4",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x1 a ns:film.production_company .\nns:m.06d5sb ns:film.film.edited_by ns:m.08627qj .\nns:m.06d5sb ns:film.film.edited_by ns:m.0jwvqz .\nns:m.06d5sb ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P3 M3 .\nM2 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 40
  },
  {
    "questionIdx": 69562,
    "questionWithBrackets": "Was [Nobody Knows] edited, written, produced, and directed by a Japanese cinematographer of [Going Home (Part 6-11)]",
    "questionPatternModEntities": "Was M2 edited , written , produced , and directed by a Japanese cinematographer of M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0rh7lw1 .\n?x0 ns:people.person.nationality ns:m.03_3d .\nns:m.047h7f ns:film.film.directed_by ?x0 .\nns:m.047h7f ns:film.film.edited_by ?x0 .\nns:m.047h7f ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.047h7f ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  },
  {
    "questionIdx": 22573,
    "questionWithBrackets": "Did [The Other Guys] star [Mother and Child]'s art director and star, star [Roy James Wilson], and star [James Mazzola]",
    "questionPatternModEntities": "Did M1 star M0 's art director and star , star M2 , and star M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.064mg8g .\n?x0 ns:film.film_art_director.films_art_directed ns:m.064mg8g .\nns:m.087vnr5 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.087vnr5 ns:film.film.starring/ns:film.performance.actor ns:m.0tlngq4 .\nns:m.087vnr5 ns:film.film.starring/ns:film.performance.actor ns:m.0vxgss3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 40
  }
]