[
  {
    "questionIdx": 169130,
    "questionWithBrackets": "What was acquired by a distributor of [The Ace of Cads] and [The Mechanical Monsters]",
    "questionPatternModEntities": "What was acquired by a distributor of M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.02r52hc .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0n4c9y6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "TVX Broadcast Group",
    "recursionDepth": 21
  },
  {
    "questionIdx": 37328,
    "questionWithBrackets": "Did a male sibling of [Andr\u00e9 Hakim] produce [The Good Time Girls]",
    "questionPatternModEntities": "Did a male sibling of M0 produce M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0bbytld .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0270m82 .\nFILTER ( ?x0 != ns:m.0270m82 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 84388,
    "questionWithBrackets": "Was [Twilight Zone: The Movie] executive produced by [The Attack of the Mummies]'s male cinematographer",
    "questionPatternModEntities": "Was M2 executive produced by M1 's male cinematographer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.02rml0k .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.04sh80 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 37386,
    "questionWithBrackets": "Did a male star of [The Conquest of the Pole] edit [Oru Veedu Iru Vasal]",
    "questionPatternModEntities": "Did a male star of M1 edit M0",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.03d498s .\n?x0 ns:film.editor.film ns:m.0522zd0 .\n?x0 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 102541,
    "questionWithBrackets": "Was a parent and sibling of [Carlo Hesser]'s spouse [Rex Balsom]",
    "questionPatternModEntities": "Was a parent and sibling of M0 's spouse M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04czj6h .\nFILTER ( ?x0 != ns:m.04czj6h ) .\nFILTER ( ns:m.0278psy != ?x0 ) .\nns:m.0278psy ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.0278psy ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 52886,
    "questionWithBrackets": "Was [Doomstown] executive produced by [CrissCross]'s female star",
    "questionPatternModEntities": "Was M2 executive produced by M0 's female star",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0bq8vh .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.03qcdbx ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 232363,
    "questionWithBrackets": "Who was a screenwriter whose sibling wrote [Gli specialisti]",
    "questionPatternModEntities": "Who was a screenwriter whose sibling wrote M2",
    "questionTemplate": "Who was a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 a ns:people.person .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.writer.film ns:m.0hhq01k .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P1 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Bruno Corbucci",
    "recursionDepth": 22
  },
  {
    "questionIdx": 45005,
    "questionWithBrackets": "Was [Alien Siege] produced and written by an art director",
    "questionPatternModEntities": "Was M1 produced and written by a art director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\nns:m.058sgg3 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.058sgg3 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 180675,
    "questionWithBrackets": "What was founded by an American cinematographer of [Castro Street]",
    "questionPatternModEntities": "What was founded by a American cinematographer of M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0cbksj .\n?x1 ns:people.person.nationality ns:m.09c7w0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Canyon Cinema",
    "recursionDepth": 22
  },
  {
    "questionIdx": 189398,
    "questionWithBrackets": "Which French character edited [A Trip to the Moon] and [The Vanishing Lady]",
    "questionPatternModEntities": "Which French character edited M1 and M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:film.editor.film ns:m.02ltdy .\n?x0 ns:film.editor.film ns:m.0crhf8m .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 22
  },
  {
    "questionIdx": 1007,
    "questionWithBrackets": "Did [Alfred Hitchcock] influence a film director's employer's founder",
    "questionPatternModEntities": "Did M1 influence a film director 's employer 's founder",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.director .\nns:m.0j_c ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 22369,
    "questionWithBrackets": "Did [The Kissing Place] and [Paradise, Texas] star a film director's child",
    "questionPatternModEntities": "Did M1 and M2 star a film director 's child",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.director .\nns:m.05b1dwp ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0gkrtcn ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 180429,
    "questionWithBrackets": "What was founded by a female writer of [Tigerwomen Grow Wings]",
    "questionPatternModEntities": "What was founded by a female writer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.writer.film ns:m.05lp37d .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Hyena Filmproduktion",
    "recursionDepth": 22
  },
  {
    "questionIdx": 131581,
    "questionWithBrackets": "What Canadian film director did [Existenz]'s producer influence",
    "questionPatternModEntities": "What Canadian film director did M2 's producer influence",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.nationality ns:m.0d060g .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.01r92q\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2\n}",
    "expectedResponse": "William Gibson; Vincenzo Natali",
    "recursionDepth": 22
  },
  {
    "questionIdx": 207925,
    "questionWithBrackets": "Which person influenced [Richard Cary Morse]'s male sibling",
    "questionPatternModEntities": "Which person influenced M1 's male sibling",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0rp668n .\nFILTER ( ?x1 != ns:m.0rp668n )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Charles Grafton Page",
    "recursionDepth": 22
  },
  {
    "questionIdx": 141147,
    "questionWithBrackets": "What costume designer that [Oja Kodar] married did [Dolores del R\u00edo] marry",
    "questionPatternModEntities": "What costume designer that M1 married did M2 marry",
    "questionTemplate": "What [NP_SIMPLE] that [entity] [VP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02qj31 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.061kqv .\nFILTER ( ?x0 != ns:m.02qj31 ) .\nFILTER ( ?x0 != ns:m.061kqv )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Orson Welles",
    "recursionDepth": 22
  },
  {
    "questionIdx": 160522,
    "questionWithBrackets": "What male person distributed [My Lady's Lips] and [The Lawful Cheater]",
    "questionPatternModEntities": "What male person distributed M1 and M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0h_93n5 .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0h_cb4j .\n?x0 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Al Lichtman",
    "recursionDepth": 22
  },
  {
    "questionIdx": 25930,
    "questionWithBrackets": "Did a British executive producer of [More Bloody Meetings] play [Donald P. Sinclair]",
    "questionPatternModEntities": "Did a British executive producer of M0 play M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0cgszpy .\n?x0 ns:film.producer.films_executive_produced ns:m.0g553c0 .\n?x0 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 182046,
    "questionWithBrackets": "What was produced by a Swedish editor of [Varning f\u00f6r J\u00f6nssonligan]",
    "questionPatternModEntities": "What was produced by a Swedish editor of M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.editor.film ns:m.03gd6w .\n?x1 ns:people.person.nationality ns:m.0d0vqn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Low Flying Aircraft; Keillers Park",
    "recursionDepth": 22
  },
  {
    "questionIdx": 164037,
    "questionWithBrackets": "What screenwriter did [Steve Tilly]'s Canadian sibling marry",
    "questionPatternModEntities": "What screenwriter did M1 's Canadian sibling marry",
    "questionTemplate": "What [NP_SIMPLE] did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.nationality ns:m.0d060g .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gy267x .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0gy267x )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Sam Simon; Don Calame",
    "recursionDepth": 22
  },
  {
    "questionIdx": 136588,
    "questionWithBrackets": "What actor that [Joseph Dietzgen] influenced influenced [Roy Johnston]",
    "questionPatternModEntities": "What actor that M2 influenced influenced M1",
    "questionTemplate": "What [NP_SIMPLE] that [entity] [VP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ns:m.065z_vt .\n?x0 ns:influence.influence_node.influenced_by ns:m.03_88v\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Karl Marx",
    "recursionDepth": 22
  },
  {
    "questionIdx": 35221,
    "questionWithBrackets": "Did a film producer's parent employ [Matt Baker] and [Giles Latcham]",
    "questionPatternModEntities": "Did a film producer 's parent employ M0 and M1",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03z9qz .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.080jf7h .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 187809,
    "questionWithBrackets": "Which British film producer did [Earls]'s employee marry",
    "questionPatternModEntities": "Which British film producer did M2 's employee marry",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02qlzfd .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Dominic Monaghan",
    "recursionDepth": 22
  },
  {
    "questionIdx": 14207,
    "questionWithBrackets": "Did [Martin Rackin] write [China Town] and write [Lal Patthar]",
    "questionPatternModEntities": "Did M0 write M1 and write M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0jt4c_ ns:film.writer.film ns:m.02qmptt .\nns:m.0jt4c_ ns:film.writer.film ns:m.03yh_mq\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P0 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 43366,
    "questionWithBrackets": "Was [44 Dartmouth Two, LLC] a costume designer's employer's founder's employer",
    "questionPatternModEntities": "Was M1 a costume designer 's employer 's founder 's employer",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.film_costumer_designer .\nns:m.09mx2nj ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 30470,
    "questionWithBrackets": "Did a cinematographer's employer's employee marry [Carl August Dohrn]",
    "questionPatternModEntities": "Did a cinematographer 's employer 's employee marry M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.06zsk6 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.cinematographer .\nFILTER ( ?x0 != ns:m.06zsk6 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 150037,
    "questionWithBrackets": "What did a film producer's parent and sibling write",
    "questionPatternModEntities": "What did a film producer 's parent and sibling write",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.producer .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Joseph the Dreamer",
    "recursionDepth": 22
  },
  {
    "questionIdx": 174198,
    "questionWithBrackets": "What was edited by a cinematographer and art director of [Jean Genet Is Dead]",
    "questionPatternModEntities": "What was edited by a cinematographer and art director of M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0gybg9q .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0gybg9q\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0\n}",
    "expectedResponse": "Man at Sea; Jean Genet Is Dead",
    "recursionDepth": 22
  },
  {
    "questionIdx": 203817,
    "questionWithBrackets": "Which film producer influenced [Tetsuo II: Body Hammer]'s art director and star",
    "questionPatternModEntities": "Which film producer influenced M1 's art director and star",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0brs6b .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0brs6b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "David Cronenberg",
    "recursionDepth": 22
  },
  {
    "questionIdx": 73719,
    "questionWithBrackets": "Was [Ren\u00e9e Gundelach] a German executive producer of [Joan of Arc of Mongolia] and [L\u2019Amour, l\u2019Argent, l\u2019Amour]",
    "questionPatternModEntities": "Was M0 a German executive producer of M1 and M2",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0bfmxm8 ns:film.producer.films_executive_produced ns:m.0bfmxl3 .\nns:m.0bfmxm8 ns:film.producer.films_executive_produced ns:m.0gh70_d .\nns:m.0bfmxm8 ns:people.person.nationality ns:m.0345h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P0 M2 .\nM0 P1 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 194088,
    "questionWithBrackets": "Which art director that [D. W. Griffith] influenced did [Under Capricorn] star",
    "questionPatternModEntities": "Which art director that M1 influenced did M2 star",
    "questionTemplate": "Which [NP_SIMPLE] that [entity] [VP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.05ddtv .\n?x0 ns:influence.influence_node.influenced_by ns:m.026ck\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Alfred Hitchcock",
    "recursionDepth": 22
  },
  {
    "questionIdx": 105943,
    "questionWithBrackets": "Was a sibling of [Margaret of Guelders] [Xelly Cabau]'s Dutch sibling",
    "questionPatternModEntities": "Was a sibling of M0 M1 's Dutch sibling",
    "questionTemplate": "Was a [ROLE_SIMPLE] of [entity] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0101b9ww .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0v_bmc_ .\nFILTER ( ?x0 != ns:m.0101b9ww ) .\nFILTER ( ?x0 != ns:m.0v_bmc_ )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 92245,
    "questionWithBrackets": "Was a child, spouse, and sibling of [Ridge Forrester] [Hope Logan]",
    "questionPatternModEntities": "Was a child , spouse , and sibling of M1 M0",
    "questionTemplate": "Was a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.02w0lyg != ns:m.0g53gd7 ) .\nFILTER ( ns:m.02w0lyg != ns:m.0g53gd7 ) .\nns:m.02w0lyg ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0g53gd7 .\nns:m.02w0lyg ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0g53gd7 .\nns:m.02w0lyg ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0g53gd7\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 63419,
    "questionWithBrackets": "Was [Kyle Lewis] a child, sibling, and spouse of [Taylor Hayes]",
    "questionPatternModEntities": "Was M0 a child , sibling , and spouse of M1",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.05zvmcm != ns:m.025v2m6 ) .\nFILTER ( ns:m.05zvmcm != ns:m.025v2m6 ) .\nns:m.05zvmcm ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.025v2m6 .\nns:m.05zvmcm ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.025v2m6 .\nns:m.05zvmcm ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.025v2m6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 202968,
    "questionWithBrackets": "Which film editor that [Marquis de Sade] influenced played [Father Juan]",
    "questionPatternModEntities": "Which film editor that M1 influenced played M2",
    "questionTemplate": "Which [NP_SIMPLE] that [entity] [VP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0yqrnhq .\n?x0 ns:influence.influence_node.influenced_by ns:m.02flz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Pier Paolo Pasolini",
    "recursionDepth": 22
  },
  {
    "questionIdx": 204038,
    "questionWithBrackets": "Which film producer that married [Michael Biehn] did [The Things We Carry] star",
    "questionPatternModEntities": "Which film producer that married M2 did M1 star",
    "questionTemplate": "Which [NP_SIMPLE] that [VP_SIMPLE] [entity] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0crsclf .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02d6n_ .\nFILTER ( ?x0 != ns:m.02d6n_ )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Jennifer Blanc",
    "recursionDepth": 22
  },
  {
    "questionIdx": 168965,
    "questionWithBrackets": "What was acquired by [Knight Ridder] and acquired by [ProQuest]",
    "questionPatternModEntities": "What was acquired by M0 and acquired by M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.01f_dc .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02p1hn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1\n}",
    "expectedResponse": "Dialog",
    "recursionDepth": 22
  },
  {
    "questionIdx": 52478,
    "questionWithBrackets": "Was [Diamond Rob Music]'s founder's sibling an actor's sibling",
    "questionPatternModEntities": "Was M1 's founder 's sibling a actor 's sibling",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0gm9b_6 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  }
]