[
  {
    "questionIdx": 157581,
    "questionWithBrackets": "What film producer founded [She's the Man]'s producer and distributor and was employed by [DreamWorks Animation]",
    "questionPatternModEntities": "What film producer founded M2 's producer and distributor and was employed by M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.056ws9 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0818gg .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0818gg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M2\n}",
    "expectedResponse": "Jeffrey Katzenberg",
    "recursionDepth": 35
  },
  {
    "questionIdx": 234634,
    "questionWithBrackets": "Who was employed by [Manga Entertainment], founded a film distributor, and founded [Island Records]",
    "questionPatternModEntities": "Who was employed by M1 , founded a film distributor , and founded M2",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.0mzkr .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01w66z .\n?x1 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Chris Blackwell",
    "recursionDepth": 35
  },
  {
    "questionIdx": 46387,
    "questionWithBrackets": "Was [Ariadna Gil] a film producer whose Spanish spouse edited and wrote [Soldiers Of Salamina]",
    "questionPatternModEntities": "Was M2 a film producer whose Spanish spouse edited and wrote M0",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.07cdwl .\n?x0 ns:film.writer.film ns:m.07cdwl .\n?x0 ns:people.person.nationality ns:m.06mkj .\nFILTER ( ns:m.02805gx != ?x0 ) .\nns:m.02805gx a ns:film.producer .\nns:m.02805gx ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P3 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 17209,
    "questionWithBrackets": "Did [Princeton University] employ [Roger Toussaint]'s American sibling and employ [Janette Hegner]'s spouse",
    "questionPatternModEntities": "Did M3 employ M0 's American sibling and employ M2 's spouse",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.09ckyp .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hnt9hb .\nFILTER ( ?x0 != ns:m.09ckyp ) .\nFILTER ( ?x1 != ns:m.0hnt9hb ) .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( ?x1 != M2 ) .\nM3 P3 ?x0 .\nM3 P3 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 172163,
    "questionWithBrackets": "What was distributed by [Bob Iger]'s employer, produced by [David Nicksay], and distributed by [Touchstone Pictures]",
    "questionPatternModEntities": "What was distributed by M2 's employer , produced by M1 , and distributed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.020h2v .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0jv3j7 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.05chnj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Up Close & Personal",
    "recursionDepth": 35
  },
  {
    "questionIdx": 99446,
    "questionWithBrackets": "Was a film producer whose Canadian sibling produced and wrote [The Search for Santa Paws] [William Vince]",
    "questionPatternModEntities": "Was a film producer whose Canadian sibling produced and wrote M0 M2",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.08ntllg .\n?x0 ns:film.writer.film ns:m.08ntllg .\n?x0 ns:people.person.nationality ns:m.0d060g .\nFILTER ( ns:m.04cvqxr != ?x0 ) .\nns:m.04cvqxr a ns:film.producer .\nns:m.04cvqxr ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P3 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 204392,
    "questionWithBrackets": "Which film producer was founded by [Disney Interactive]'s founder and was founded by a film producer",
    "questionPatternModEntities": "Which film producer was founded by M1 's founder and was founded by a film producer",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.047cb57 .\n?x2 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x2 a M0\n}",
    "expectedResponse": "Walt Disney Animation Studios",
    "recursionDepth": 35
  },
  {
    "questionIdx": 206208,
    "questionWithBrackets": "Which male French film editor edited [Backstreets of Paris] and executive produced [French Connexion]",
    "questionPatternModEntities": "Which male French film editor edited M1 and executive produced M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:film.editor.film ns:m.0hypxj2 .\n?x0 ns:film.producer.films_executive_produced ns:m.0hyql59 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 P3 M4 .\n?x0 a M0\n}",
    "expectedResponse": "Marc Dorcel",
    "recursionDepth": 35
  },
  {
    "questionIdx": 217835,
    "questionWithBrackets": "Who founded a film producer, founded [Walt Disney Records], and was employed by [The Walt Disney Company]",
    "questionPatternModEntities": "Who founded a film producer , founded M2 , and was employed by M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] , [VP_SIMPLE] [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03tg5s .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.09b3v .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Walt Disney; Roy O. Disney",
    "recursionDepth": 35
  },
  {
    "questionIdx": 9020,
    "questionWithBrackets": "Did [Gustavo Alatriste] marry [Valerie Mathis]'s Mexican actor's sibling and marry [Sonia Infante]",
    "questionPatternModEntities": "Did M2 marry M1 's Mexican actor 's sibling and marry M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.08nb_sk .\n?x1 ns:people.person.nationality ns:m.0b90_r .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.06wcp_ != ?x0 ) .\nFILTER ( ns:m.06wcp_ != ns:m.0bz6v0h ) .\nns:m.06wcp_ ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.06wcp_ ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0bz6v0h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M3 ) .\nM2 P3 ?x0 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 157658,
    "questionWithBrackets": "What film producer influenced, was influenced by, and married a cinematographer of [The Beaches of Agn\u00e8s]",
    "questionPatternModEntities": "What film producer influenced , was influenced by , and married a cinematographer of M1",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.04nm0cr .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 35
  },
  {
    "questionIdx": 84256,
    "questionWithBrackets": "Was [Troma Entertainment] a production company whose founder and employee directed and produced [The First Turn-On!]",
    "questionPatternModEntities": "Was M1 a production company whose founder and employee directed and produced M0",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.02vwvl4 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.02vwvl4 .\nns:m.0qf1j a ns:film.production_company .\nns:m.0qf1j ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0qf1j ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 5251,
    "questionWithBrackets": "Did [David Cronenberg] influence [Rivers of Fire and Ice]'s prequel's Japanese cinematographer and influence [Christophe Gans]",
    "questionPatternModEntities": "Did M2 influence M1 's prequel 's Japanese cinematographer and influence M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x1 ns:film.film.sequel ns:m.065zr99 .\nns:m.026fd ns:influence.influence_node.influenced ?x0 .\nns:m.026fd ns:influence.influence_node.influenced ns:m.08ghwh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 5174,
    "questionWithBrackets": "Did [Darcy LaPier] marry [Luc Deveraux]'s male actor and marry [Mark R. Hughes] and [Brian Snodgrass]",
    "questionPatternModEntities": "Did M2 marry M0 's male actor and marry M3 and M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0fp_855 .\n?x0 ns:people.person.gender ns:m.05zppz .\nFILTER ( ns:m.02qn2km != ?x0 ) .\nFILTER ( ns:m.02qn2km != ns:m.05yxlwn ) .\nFILTER ( ns:m.02qn2km != ns:m.07wwc0 ) .\nns:m.02qn2km ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.02qn2km ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.05yxlwn .\nns:m.02qn2km ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.07wwc0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M3 ) .\nFILTER ( M2 != M4 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  },
  {
    "questionIdx": 83659,
    "questionWithBrackets": "Was [To Die Like a Man] written by a male person and written by [Sirf Main Aur Tum]'s editor",
    "questionPatternModEntities": "Was M3 written by a male person and written by M2 's editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 ns:film.editor.film ns:m.0h6mjtc .\nns:m.063_wk3 ns:film.film.written_by ?x0 .\nns:m.063_wk3 ns:film.film.written_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\nM3 P2 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 144990,
    "questionWithBrackets": "What did [Magic Magic]'s cinematographer direct, [Ara Katz] executive produce, and [Gurinder Chadha] direct",
    "questionPatternModEntities": "What did M2 's cinematographer direct , M0 executive produce , and M1 direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.03yjtb .\n?x0 ns:film.film.executive_produced_by ns:m.04mv77t .\n?x1 ns:film.cinematographer.film ns:m.0hn914d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Paris, je t'aime",
    "recursionDepth": 35
  },
  {
    "questionIdx": 139232,
    "questionWithBrackets": "What cinematographer did [Mellody Hobson] marry and a film's star's child influence",
    "questionPatternModEntities": "What cinematographer did M1 marry and a film 's star 's child influence",
    "questionTemplate": "What [NP_SIMPLE] did [entity] [VP_SIMPLE] and a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02q3xjl .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.film ?x3 .\n?x3 a ns:film.film .\nFILTER ( ?x0 != ns:m.02q3xjl )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M2 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "George Lucas",
    "recursionDepth": 35
  },
  {
    "questionIdx": 127545,
    "questionWithBrackets": "Were [The Myth], [Police Story 3: Super Cop], [Run Papa Run], [1911], and [Shanghai Noon] executive produced by [Co jsme udelali slep\u00edcim]'s cinematographer and producer",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 executive produced by M0 's cinematographer and producer",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0gwk5hd .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0gwk5hd .\nns:m.01f6x7 ns:film.film.executive_produced_by ?x0 .\nns:m.03_95w ns:film.film.executive_produced_by ?x0 .\nns:m.04q6_z5 ns:film.film.executive_produced_by ?x0 .\nns:m.07yc_w ns:film.film.executive_produced_by ?x0 .\nns:m.0gj967f ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 202201,
    "questionWithBrackets": "Which film director was influenced by a company's founder and was influenced by [Edgar Bergen]",
    "questionPatternModEntities": "Which film director was influenced by a company 's founder and was influenced by M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.011lhy .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Jim Henson",
    "recursionDepth": 35
  },
  {
    "questionIdx": 161649,
    "questionWithBrackets": "What person did a costume designer's sibling's sibling influence and [Mitch Hedberg] influence",
    "questionPatternModEntities": "What person did a costume designer 's sibling 's sibling influence and M1 influence",
    "questionTemplate": "What [NP_SIMPLE] did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.02vzgl .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x3 a ns:film.film_costumer_designer .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P1 ?x3 .\n?x3 a M2 .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "Mikey Mileos; Azhar Usman",
    "recursionDepth": 35
  },
  {
    "questionIdx": 167903,
    "questionWithBrackets": "What was a company that a screenwriter that [Anna Lezhneva] and [Renu Desai] married founded",
    "questionPatternModEntities": "What was a company that a screenwriter that M2 and M3 married founded",
    "questionTemplate": "What was a [NP_SIMPLE] that a [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0_v5vxp .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0g0nfs .\nFILTER ( ?x1 != ns:m.0_v5vxp ) .\nFILTER ( ?x1 != ns:m.0g0nfs )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P1 M3 .\n?x1 a M1 .\nFILTER ( ?x1 != M2 ) .\nFILTER ( ?x1 != M3 )\n}",
    "expectedResponse": "Jana Sena Party",
    "recursionDepth": 35
  },
  {
    "questionIdx": 158732,
    "questionWithBrackets": "What film was distributed by [StudioCanal UK] and [Madman Entertainment] and was produced by a cinematographer",
    "questionPatternModEntities": "What film was distributed by M1 and M2 and was produced by a cinematographer",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [entity] and was [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.058y8m .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.08225h .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.cinematographer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Ponyo",
    "recursionDepth": 35
  },
  {
    "questionIdx": 56163,
    "questionWithBrackets": "Was [Garret Schuelke] influenced by [Erika Cosby]'s parent and influenced by a Mexican screenwriter",
    "questionPatternModEntities": "Was M3 influenced by M0 's parent and influenced by a Mexican screenwriter",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0hpc399 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.0b90_r .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x0 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M2 .\n?x1 a M1 .\nM3 P2 ?x0 .\nM3 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 175349,
    "questionWithBrackets": "What was edited by, written by, and executive produced by [Kit Pennebaker]'s female parent",
    "questionPatternModEntities": "What was edited by , written by , and executive produced by M1 's female parent",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0gxm3d0 .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "Startup.com",
    "recursionDepth": 35
  },
  {
    "questionIdx": 217805,
    "questionWithBrackets": "Who founded a film distributor, founded [World Championship Wrestling], and was employed by [Turner Broadcasting System]",
    "questionPatternModEntities": "Who founded a film distributor , founded M2 , and was employed by M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] , [VP_SIMPLE] [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.019jdn .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.021c6_ .\n?x1 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Ted Turner",
    "recursionDepth": 35
  },
  {
    "questionIdx": 30116,
    "questionWithBrackets": "Did a cinematographer influence a producer of [Darkened Room] and marry [Irene Kane]'s sibling",
    "questionPatternModEntities": "Did a cinematographer influence a producer of M1 and marry M2 's sibling",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.05977w .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0j_gns .\nFILTER ( ?x0 != ?x2 ) .\nFILTER ( ?x2 != ns:m.0j_gns )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x2 P3 M2 .\nFILTER ( ?x0 != ?x2 ) .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 239121,
    "questionWithBrackets": "Who was influenced by, married, and influenced [The Beaches of Agn\u00e8s]'s female producer",
    "questionPatternModEntities": "Who was influenced by , married , and influenced M1 's female producer",
    "questionTemplate": "Who was [VP_SIMPLE] by , [VP_SIMPLE] , and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.04nm0cr .\n?x1 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1 .\n?x1 P4 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 35
  },
  {
    "questionIdx": 99820,
    "questionWithBrackets": "Was a film that was directed by a film producer and starred [Poojappura Radhakrishnan] [Friends with Benefits]",
    "questionPatternModEntities": "Was a film that was directed by a film producer and starred M3 M1",
    "questionTemplate": "Was a [NP_SIMPLE] that was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\nns:m.0c3xw46 a ns:film.film .\nns:m.0c3xw46 ns:film.film.directed_by ?x0 .\nns:m.0c3xw46 ns:film.film.starring/ns:film.performance.actor ns:m.0k693yh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 M3 .\nM1 P1 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 68162,
    "questionWithBrackets": "Was [Moskito Bravo] edited by a Spanish screenwriter's parent and written by [Henri-Fran\u00e7ois Rey]",
    "questionPatternModEntities": "Was M2 edited by a Spanish screenwriter 's parent and written by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.06mkj .\nns:m.0fpp74n ns:film.film.edited_by ?x0 .\nns:m.0fpp74n ns:film.film.written_by ns:m.0n4l1ck\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 M3 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 35
  },
  {
    "questionIdx": 111030,
    "questionWithBrackets": "Was [\u00a1Que seas feliz!] produced by [Sergio Kogan] and directed by a film producer's Mexican sibling",
    "questionPatternModEntities": "Was M2 produced by M3 and directed by a film producer 's Mexican sibling",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.producer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0d7dgk0 ns:film.film.directed_by ?x0 .\nns:m.0d7dgk0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0wgj76y\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 M3 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 35
  }
]