[
  {
    "questionIdx": 125566,
    "questionWithBrackets": "Were [Tetsuo: The Iron Man] and [A Day's Pleasure] edited and directed by an actor's sibling",
    "questionPatternModEntities": "Were M1 and M2 edited and directed by a actor 's sibling",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.actor .\nFILTER ( ?x0 != ?x1 ) .\nns:m.05m0x0 ns:film.film.directed_by ?x0 .\nns:m.05m0x0 ns:film.film.edited_by ?x0 .\nns:m.07mll4 ns:film.film.directed_by ?x0 .\nns:m.07mll4 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 61856,
    "questionWithBrackets": "Was [Johnny Nilsson] a character that edited [The Vanishing Lady] and edited [The Living Playing Cards]",
    "questionPatternModEntities": "Was M0 a character that edited M2 and edited M3",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0z82bl3 a ns:fictional_universe.fictional_character .\nns:m.0z82bl3 ns:film.editor.film ns:g.1pv18zxm .\nns:m.0z82bl3 ns:film.editor.film ns:m.0crhf8m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 210304,
    "questionWithBrackets": "Which screenwriter did [Lady Oscar]'s French executive producer marry and influence",
    "questionPatternModEntities": "Which screenwriter did M1 's French executive producer marry and influence",
    "questionTemplate": "Which [NP_SIMPLE] did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.02qdhzf .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P3 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 30
  },
  {
    "questionIdx": 219998,
    "questionWithBrackets": "Who married [Broadway Melody of 1940]'s male art director and influenced [Diana Dors]",
    "questionPatternModEntities": "Who married M3 's male art director and influenced M1",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.030vnz .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0554ch .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Veronica Lake",
    "recursionDepth": 30
  },
  {
    "questionIdx": 128250,
    "questionWithBrackets": "Were [Three Walls] and [Dor] executive produced by [Iqbal]'s costume designer, executive producer, and star",
    "questionPatternModEntities": "Were M1 and M2 executive produced by M0 's costume designer , executive producer , and star",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0g9k67 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0g9k67 .\n?x0 ns:film.producer.films_executive_produced ns:m.0g9k67 .\nns:m.0f14tc ns:film.film.executive_produced_by ?x0 .\nns:m.0kv3t6 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 172847,
    "questionWithBrackets": "What was edited and directed by a Spanish film producer's parent",
    "questionPatternModEntities": "What was edited and directed by a Spanish film producer 's parent",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.producer .\n?x2 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\n?x2 a M0\n}",
    "expectedResponse": "The Uninhibited",
    "recursionDepth": 30
  },
  {
    "questionIdx": 172645,
    "questionWithBrackets": "What was distributed by [Vampires: Los Muertos]'s cinematographer and produced by [Doing Hard Time]'s editor",
    "questionPatternModEntities": "What was distributed by M0 's cinematographer and produced by M1 's editor",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:film.cinematographer.film ns:m.0frc02 .\n?x2 ns:film.editor.film ns:m.04j1y__\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M0 .\n?x2 P3 M1\n}",
    "expectedResponse": "This Christmas",
    "recursionDepth": 30
  },
  {
    "questionIdx": 39846,
    "questionWithBrackets": "Did a spouse of [Patty Williams]'s spouse and sibling marry [Blake Hayes] and [Veronica Landers]",
    "questionPatternModEntities": "Did a spouse of M2 's spouse and sibling marry M0 and M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.026hgj3 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0271f56 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.02plfl7 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02plfl7 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.026hgj3 ) .\nFILTER ( ?x0 != ns:m.0271f56 ) .\nFILTER ( ?x1 != ns:m.02plfl7 ) .\nFILTER ( ?x1 != ns:m.02plfl7 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x1 P0 M2 .\n?x1 P1 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M0 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != M2 ) .\nFILTER ( ?x1 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 129128,
    "questionWithBrackets": "Were [Virgin Vacations] and [Virgin Group] founded by a founder and employee of a company",
    "questionPatternModEntities": "Were M1 and M2 founded by a founder and employee of a company",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:business.employer .\nns:m.01f9wm ns:organization.organization.founders ?x0 .\nns:m.0264ktc ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 40739,
    "questionWithBrackets": "Did an Italian cinematographer that [The Cyclone] was written by play [Turchi]",
    "questionPatternModEntities": "Did a Italian cinematographer that M1 was written by play M3",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.011lvjk_ .\n?x0 ns:film.writer.film ns:m.0c1kxsc .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 32411,
    "questionWithBrackets": "Did a female person influence [Bob Barr] and influence [Louise Gl\u00fcck]",
    "questionPatternModEntities": "Did a female person influence M1 and influence M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.01fdg8 .\n?x0 ns:influence.influence_node.influenced ns:m.02ls5x .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 237749,
    "questionWithBrackets": "Who was influenced by [Woody Allen] and influenced by [Bamm-Bamm Rubble]'s parent's actor",
    "questionPatternModEntities": "Who was influenced by M1 and influenced by M2 's parent 's actor",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.081lh .\n?x1 ns:film.actor.film/ns:film.performance.character ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.057lc0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M2\n}",
    "expectedResponse": "Dave Chappelle",
    "recursionDepth": 30
  },
  {
    "questionIdx": 28346,
    "questionWithBrackets": "Did a Mexican film director marry [Alix Bailey] and influence [Manoel de Oliveira]",
    "questionPatternModEntities": "Did a Mexican film director marry M3 and influence M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:influence.influence_node.influenced ns:m.04yg98 .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0gxqyrw .\nFILTER ( ?x0 != ns:m.0gxqyrw )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 12826,
    "questionWithBrackets": "Did [Land of the Dead] star [Gary Ugarek] and star a Canadian actor",
    "questionPatternModEntities": "Did M2 star M3 and star a Canadian actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.0d060g .\nns:m.03pkmt ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.03pkmt ns:film.film.starring/ns:film.performance.actor ns:m.0dxfk_t\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P1 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 204559,
    "questionWithBrackets": "Which film producer was influenced by a writer, editor, and art director of [Tetsuo: The Iron Man]",
    "questionPatternModEntities": "Which film producer was influenced by a writer , editor , and art director of M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.editor.film ns:m.05m0x0 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.05m0x0 .\n?x1 ns:film.writer.film ns:m.05m0x0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 30
  },
  {
    "questionIdx": 70077,
    "questionWithBrackets": "Was [One Day in Life] executive produced by, directed by, and edited by a screenwriter",
    "questionPatternModEntities": "Was M1 executive produced by , directed by , and edited by a screenwriter",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\nns:m.0h2mgyl ns:film.film.directed_by ?x0 .\nns:m.0h2mgyl ns:film.film.edited_by ?x0 .\nns:m.0h2mgyl ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 14121,
    "questionWithBrackets": "Did [Mario Morra] and [Kristian Petersen] edit and write a film's sequel",
    "questionPatternModEntities": "Did M1 and M2 edit and write a film 's sequel",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ?x1 .\n?x1 a ns:film.film .\nns:m.0c1dpw4 ns:film.editor.film ?x0 .\nns:m.0c1dpw4 ns:film.writer.film ?x0 .\nns:m.0gx2r5w ns:film.editor.film ?x0 .\nns:m.0gx2r5w ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 220452,
    "questionWithBrackets": "Who married [Jonas Hodges]'s male actor and married [John Trudell]",
    "questionPatternModEntities": "Who married M2 's male actor and married M1",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0265_l .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0h1tjgf .\n?x1 ns:people.person.gender ns:m.05zppz .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0265_l )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Marcheline Bertrand",
    "recursionDepth": 30
  },
  {
    "questionIdx": 24736,
    "questionWithBrackets": "Did [Walt Disney] found [Walt Disney Pictures] and found [Ed Love]'s employer's child",
    "questionPatternModEntities": "Did M1 found M2 and found M0 's employer 's child",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04g1dkd .\nns:m.081nh ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.081nh ns:organization.organization_founder.organizations_founded ns:m.01795t\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 189356,
    "questionWithBrackets": "Which French actor was employed by [International Culinary Center] and employed by [Howard Johnson's]",
    "questionPatternModEntities": "Which French actor was employed by M1 and employed by M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01l0b1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0271qcw .\n?x0 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Jacques P\u00e9pin",
    "recursionDepth": 30
  },
  {
    "questionIdx": 171248,
    "questionWithBrackets": "What was directed by and written by a female costume designer of [Just like Home]",
    "questionPatternModEntities": "What was directed by and written by a female costume designer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0b6gygg .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Csajok; Hotreal",
    "recursionDepth": 30
  },
  {
    "questionIdx": 156159,
    "questionWithBrackets": "What film distributor did [TPG Capital] acquire and a parent of [Comcast of Illinois VI, LLC] acquire",
    "questionPatternModEntities": "What film distributor did M1 acquire and a parent of M2 acquire",
    "questionTemplate": "What [NP_SIMPLE] did [entity] [VP_SIMPLE] and a [ROLE_SIMPLE] of [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03yqpb .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.09mb59b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2\n}",
    "expectedResponse": "Metro-Goldwyn-Mayer",
    "recursionDepth": 30
  },
  {
    "questionIdx": 28702,
    "questionWithBrackets": "Did a Spanish costume designer write [The Devil's Backbone] and direct [Desarrollo humano]",
    "questionPatternModEntities": "Did a Spanish costume designer write M1 and direct M3",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:film.director.film ns:m.0j63xrh .\n?x0 ns:film.writer.film ns:m.0dqvh3 .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 29761,
    "questionWithBrackets": "Did a child of [Werner Herzog Eats His Shoe]'s cinematographer and producer edit [Wild Wheels] and [Automorphosis]",
    "questionPatternModEntities": "Did a child of M2 's cinematographer and producer edit M0 and M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0crsm68 .\n?x0 ns:film.editor.film ns:m.0crvmgd .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.cinematographer.film ns:m.07gc4j .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.07gc4j\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 62858,
    "questionWithBrackets": "Was [Kevin & Perry Go Large] produced by a person's actor and produced by [Jolyon Symonds]",
    "questionPatternModEntities": "Was M1 produced by a person 's actor and produced by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 a ns:people.person .\nns:m.073z_8 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.073z_8 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0h6clfk\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P1 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 73167,
    "questionWithBrackets": "Was [Quick Billy] edited and directed by an American founder of [Rooster Teeth]",
    "questionPatternModEntities": "Was M2 edited and directed by a American founder of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.04y69w .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\nns:m.0jwgs98 ns:film.film.directed_by ?x0 .\nns:m.0jwgs98 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 167882,
    "questionWithBrackets": "What was a company that [Benjamin West] founded and [Francesco Bartolozzi] founded",
    "questionPatternModEntities": "What was a company that M1 founded and M2 founded",
    "questionTemplate": "What was a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ns:m.01g6y5 .\n?x0 ns:organization.organization.founders ns:m.01z6r6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Royal Academy of Arts",
    "recursionDepth": 30
  },
  {
    "questionIdx": 93528,
    "questionWithBrackets": "Was a company founded by a Canadian founder of [Metro-Goldwyn-Mayer]'s child",
    "questionPatternModEntities": "Was a company founded by a Canadian founder of M2 's child",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:business.employer .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x1 ns:people.person.nationality ns:m.0d060g .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0g1rw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 M1 .\n?x2 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 233866,
    "questionWithBrackets": "Who was an art director that [Paperbox] was executive produced by and written by",
    "questionPatternModEntities": "Who was a art director that M2 was executive produced by and written by",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 a ns:people.person .\n?x0 ns:film.producer.films_executive_produced ns:m.0vsj6s2 .\n?x0 ns:film.writer.film ns:m.0vsj6s2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Zbigniew Czapla",
    "recursionDepth": 30
  },
  {
    "questionIdx": 148348,
    "questionWithBrackets": "What did a French costume designer's child direct and write",
    "questionPatternModEntities": "What did a French costume designer 's child direct and write",
    "questionTemplate": "What did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.film_costumer_designer .\n?x2 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\n?x2 a M0\n}",
    "expectedResponse": "The Voice Thief",
    "recursionDepth": 30
  },
  {
    "questionIdx": 229027,
    "questionWithBrackets": "Who was a cinematographer that played [The Devil] and played [L'illusioniste]",
    "questionPatternModEntities": "Who was a cinematographer that played M2 and played M3",
    "questionTemplate": "Who was a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.010q5h45 .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.098fbx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Georges M\u00e9li\u00e8s",
    "recursionDepth": 30
  },
  {
    "questionIdx": 18859,
    "questionWithBrackets": "Did [Scary Movie 4] star [National Banana]'s employee's sibling and star [Cloris Leachman]",
    "questionPatternModEntities": "Did M1 star M0 's employee 's sibling and star M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03f_kks .\nFILTER ( ?x0 != ?x1 ) .\nns:m.07h9gp ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.07h9gp ns:film.film.starring/ns:film.performance.actor ns:m.02l3_5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 19502,
    "questionWithBrackets": "Did [Soulforce] and [Mel White Productions] employ a screenwriter whose employer distributed [Discord and Harmony]",
    "questionPatternModEntities": "Did M2 and M3 employ a screenwriter whose employer distributed M1",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.047rjmk .\nns:m.028151z ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.05hns4y ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 170595,
    "questionWithBrackets": "What was directed by a Dutch film producer and produced by [Claudius Gebele]",
    "questionPatternModEntities": "What was directed by a Dutch film producer and produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0j_xn1s .\n?x1 a ns:film.producer .\n?x1 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "The Monster of Nix",
    "recursionDepth": 30
  },
  {
    "questionIdx": 86241,
    "questionWithBrackets": "Was [Wanderlust] produced by a character and distributed by [Nazif Memedi]'s employer",
    "questionPatternModEntities": "Was M2 produced by a character and distributed by M0 's employer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0fpjkyw .\n?x1 a ns:fictional_universe.fictional_character .\nns:m.0dgr73z ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0dgr73z ns:film.film.produced_by|ns:film.film.production_companies ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 a M1 .\nM2 P1 ?x0 .\nM2 P2 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  }
]