[
  {
    "questionIdx": 65367,
    "questionWithBrackets": "Was [Lumi\u00e8re and Company] executive produced by [Anne Andreu], directed by [Costa-Gavras], and directed by a French writer and cinematographer of [Une Catastrophe]",
    "questionPatternModEntities": "Was M2 executive produced by M3 , directed by M4 , and directed by a French writer and cinematographer of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.07l51nk .\n?x0 ns:film.writer.film ns:m.07l51nk .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.060hk0 ns:film.film.directed_by ?x0 .\nns:m.060hk0 ns:film.film.directed_by ns:m.01q4qv .\nns:m.060hk0 ns:film.film.executive_produced_by ns:m.0gx2zyl\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M0 .\nM2 P3 M3 .\nM2 P4 ?x0 .\nM2 P4 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 49
  },
  {
    "questionIdx": 119607,
    "questionWithBrackets": "Were [Kiki's Delivery Service], [Castle in the Sky], [Princess Mononoke], [Spirited Away], and [Whisper of the Heart] executive produced by a production company's founder and employee and edited by [Takeshi Seyama]",
    "questionPatternModEntities": "Were M1 , M3 , M4 , M5 , and M6 executive produced by a production company 's founder and employee and edited by M2",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.production_company .\nns:m.012x63 ns:film.film.edited_by ns:m.0282qln .\nns:m.012x63 ns:film.film.executive_produced_by ?x0 .\nns:m.02gs6r ns:film.film.edited_by ns:m.0282qln .\nns:m.02gs6r ns:film.film.executive_produced_by ?x0 .\nns:m.0652f ns:film.film.edited_by ns:m.0282qln .\nns:m.0652f ns:film.film.executive_produced_by ?x0 .\nns:m.09k4d3y ns:film.film.edited_by ns:m.0282qln .\nns:m.09k4d3y ns:film.film.executive_produced_by ?x0 .\nns:m.0j6b5 ns:film.film.edited_by ns:m.0282qln .\nns:m.0j6b5 ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 M2 .\nM3 P2 ?x0 .\nM3 P3 M2 .\nM4 P2 ?x0 .\nM4 P3 M2 .\nM5 P2 ?x0 .\nM5 P3 M2 .\nM6 P2 ?x0 .\nM6 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 216924,
    "questionWithBrackets": "Who edited [1988: The Remake] and executive produced a film edited by [Glenn Douglass] and edited by [Christine Corrigan] and [Andrea Ament]",
    "questionPatternModEntities": "Who edited M1 and executive produced a film edited by M3 and edited by M4 and M5",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.0zncdr9 .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x1 a ns:film.film .\n?x1 ns:film.film.edited_by ns:m.0zzv1mt .\n?x1 ns:film.film.edited_by ns:m.0zzv2f_ .\n?x1 ns:film.film.edited_by ns:m.0zzv2jp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P2 M4 .\n?x1 P2 M5 .\n?x1 a M2\n}",
    "expectedResponse": "Rick Schmidt",
    "recursionDepth": 49
  },
  {
    "questionIdx": 183234,
    "questionWithBrackets": "What was produced by, executive produced by, and written by an actor influenced by [Bobcat Goldthwait] and influenced by [Cheech & Chong]",
    "questionPatternModEntities": "What was produced by , executive produced by , and written by a actor influenced by M1 and influenced by M2",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.actor .\n?x1 ns:influence.influence_node.influenced_by ns:m.016pb1 .\n?x1 ns:influence.influence_node.influenced_by ns:m.03kxdw\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\n?x1 P3 M2 .\n?x1 a M0\n}",
    "expectedResponse": "Los Enchiladas!",
    "recursionDepth": 49
  },
  {
    "questionIdx": 112035,
    "questionWithBrackets": "Were [Air Force] and [The Big Sleep] directed by a screenwriter that [Andrew Shearer]'s Canadian child married and executive produced by [Jack L. Warner]",
    "questionPatternModEntities": "Were M3 and M5 directed by a screenwriter that M2 's Canadian child married and executive produced by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.nationality ns:m.0d060g .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0hnsmwy .\nFILTER ( ?x0 != ?x1 ) .\nns:m.05k7xj ns:film.film.directed_by ?x0 .\nns:m.05k7xj ns:film.film.executive_produced_by ns:m.0m593 .\nns:m.0dlwcv ns:film.film.directed_by ?x0 .\nns:m.0dlwcv ns:film.film.executive_produced_by ns:m.0m593\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nM3 P3 M4 .\nM3 P4 ?x0 .\nM5 P3 M4 .\nM5 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 220904,
    "questionWithBrackets": "Who married [Sody Clampett] and was influenced by an actor that directed, produced, and edited [The Kid]",
    "questionPatternModEntities": "Who married M1 and was influenced by a actor that directed , produced , and edited M3",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and was [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0g271mm .\n?x1 a ns:film.actor .\n?x1 ns:film.director.film ns:m.04vl27 .\n?x1 ns:film.editor.film ns:m.04vl27 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.04vl27 .\nFILTER ( ?x0 != ns:m.0g271mm )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3 .\n?x1 a M2 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "Bob Clampett",
    "recursionDepth": 49
  },
  {
    "questionIdx": 39099,
    "questionWithBrackets": "Did a screenwriter influenced by [Roy O. Disney]'s sibling and influenced by [Charlie Chaplin] influence [Justin Timberlake] and influence [Leigh Francis]",
    "questionPatternModEntities": "Did a screenwriter influenced by M4 's sibling and influenced by M3 influence M1 and influence M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ns:m.04rcg1 .\n?x0 ns:influence.influence_node.influenced ns:m.0j1yf .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01lc5 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.015yg9 .\nFILTER ( ?x1 != ns:m.015yg9 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x1 P2 M4 .\nFILTER ( ?x1 != M4 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 236559,
    "questionWithBrackets": "Who was influenced by [La rebeli\u00f3n de los colgados]'s Mexican writer, was influenced by [Gary Snyder] and [Jalal ad-Din Muhammad Rumi], and was influenced by [Hubert Selby, Jr.]",
    "questionPatternModEntities": "Who was influenced by M4 's Mexican writer , was influenced by M1 and M2 , and was influenced by M3",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , was [VP_SIMPLE] by [entity] and [entity] , and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.03bh5 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0461p .\n?x0 ns:influence.influence_node.influenced_by ns:m.0nk02 .\n?x1 ns:film.writer.film ns:m.0z0_1s2 .\n?x1 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 M4 .\n?x1 P2 M5\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 49
  },
  {
    "questionIdx": 184726,
    "questionWithBrackets": "What was written by [Peter Greenaway], edited by [Misch Bervard] and [Luis Villar], and edited by a film producer that [LoveMEATender] was edited by",
    "questionPatternModEntities": "What was written by M0 , edited by M1 and M2 , and edited by a film producer that M4 was edited by",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ns:m.0hpy9gc .\n?x0 ns:film.film.edited_by ns:m.0ndb3g4 .\n?x0 ns:film.film.written_by ns:m.0fdw2 .\n?x1 a ns:film.producer .\n?x1 ns:film.editor.film ns:m.0pdksd4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x1 P2 M4 .\n?x1 a M3\n}",
    "expectedResponse": "Visions of Europe",
    "recursionDepth": 49
  },
  {
    "questionIdx": 118353,
    "questionWithBrackets": "Were [Infernal Affairs II] and [Infernal Affairs III] directed by [Alan Mak], directed by [Young and Dangerous 2]'s producer, director, and cinematographer, and edited by [Danny Pang Phat]",
    "questionPatternModEntities": "Were M1 and M4 directed by M3 , directed by M0 's producer , director , and cinematographer , and edited by M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0cc1tf .\n?x0 ns:film.director.film ns:m.0cc1tf .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0cc1tf .\nns:m.031ldd ns:film.film.directed_by ?x0 .\nns:m.031ldd ns:film.film.directed_by ns:m.02vknxw .\nns:m.031ldd ns:film.film.edited_by ns:m.0k6khk .\nns:m.0432_5 ns:film.film.directed_by ?x0 .\nns:m.0432_5 ns:film.film.directed_by ns:m.02vknxw .\nns:m.0432_5 ns:film.film.edited_by ns:m.0k6khk\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0 .\nM1 P4 M3 .\nM4 P3 M2 .\nM4 P4 ?x0 .\nM4 P4 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 56168,
    "questionWithBrackets": "Was [Garret Schuelke] influenced by [Gary Snyder] and [Dee Dee Ramone], influenced by [Renaldo and Clara]'s American editor, and influenced by [The Spanish Earth]'s writer",
    "questionPatternModEntities": "Was M3 influenced by M4 and M5 , influenced by M2 's American editor , and influenced by M0 's writer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0fn1n5 .\n?x1 ns:film.editor.film ns:m.04w3c6 .\n?x1 ns:people.person.nationality ns:m.09c7w0 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x0 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ?x1 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ns:m.01wcpd4 .\nns:m.066b7gk ns:influence.influence_node.influenced_by ns:m.03bh5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nM3 P3 ?x0 .\nM3 P3 ?x1 .\nM3 P3 M4 .\nM3 P3 M5\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 49
  },
  {
    "questionIdx": 145855,
    "questionWithBrackets": "What did [Planet Utero]'s executive producer, cinematographer, and writer executive produce, edit, direct, produce, and write",
    "questionPatternModEntities": "What did M0 's executive producer , cinematographer , and writer executive produce , edit , direct , produce , and write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0107h0v4 .\n?x1 ns:film.producer.films_executive_produced ns:m.0107h0v4 .\n?x1 ns:film.writer.film ns:m.0107h0v4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0 .\n?x1 P7 M0\n}",
    "expectedResponse": "Baby, I Love You.; Planet Utero",
    "recursionDepth": 50
  },
  {
    "questionIdx": 174318,
    "questionWithBrackets": "What was edited by a film director, edited by a German female sibling of [Gabriel Genschow], and written by [Edgar Reitz]",
    "questionPatternModEntities": "What was edited by a film director , edited by a German female sibling of M1 , and written by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x0 ns:film.film.written_by ns:m.04lsfm .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0mvtb30 .\n?x2 a ns:film.director .\nFILTER ( ?x1 != ns:m.0mvtb30 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x1 P3 M2 .\n?x1 P4 M3 .\n?x2 a M4 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Germany in Autumn",
    "recursionDepth": 50
  },
  {
    "questionIdx": 144668,
    "questionWithBrackets": "What did [Kinefaktura]'s editor, art director, and writer edit, write, direct, produce, and executive produce",
    "questionPatternModEntities": "What did M0 's editor , art director , and writer edit , write , direct , produce , and executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.0vsh_8l .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0vsh_8l .\n?x1 ns:film.writer.film ns:m.0vsh_8l\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0 .\n?x1 P7 M0\n}",
    "expectedResponse": "FFF1",
    "recursionDepth": 50
  },
  {
    "questionIdx": 37965,
    "questionWithBrackets": "Did a person that a film was produced by and [Spy Kids 3-D: Game Over] was produced by edit and executive produce [The Goonies]",
    "questionPatternModEntities": "Did a person that a film was produced by and M2 was produced by edit and executive produce M1",
    "questionTemplate": "Did a [NP_SIMPLE] that a [NP_SIMPLE] was [VP_SIMPLE] by and [entity] was [VP_SIMPLE] by [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.0mbql .\n?x0 ns:film.producer.films_executive_produced ns:m.0mbql .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.025s1wg .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 11788,
    "questionWithBrackets": "Did [Johnny Carson] and [George Carlin] influence [Dennis Miller], influence [Judy Caprio]'s child, and influence a cinematographer's sibling's spouse",
    "questionPatternModEntities": "Did M2 and M4 influence M3 , influence M0 's child , and influence a cinematographer 's sibling 's spouse",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0gz72s2 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x3 a ns:film.cinematographer .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 ) .\nns:m.014z8v ns:influence.influence_node.influenced ?x0 .\nns:m.014z8v ns:influence.influence_node.influenced ?x1 .\nns:m.014z8v ns:influence.influence_node.influenced ns:m.047sg84 .\nns:m.0ph2w ns:influence.influence_node.influenced ?x0 .\nns:m.0ph2w ns:influence.influence_node.influenced ?x1 .\nns:m.0ph2w ns:influence.influence_node.influenced ns:m.047sg84\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 a M1 .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 ) .\nM2 P3 ?x0 .\nM2 P3 ?x1 .\nM2 P3 M3 .\nM4 P3 ?x0 .\nM4 P3 ?x1 .\nM4 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 113440,
    "questionWithBrackets": "Were [Bharthavudyogam] and [Rick's Canoe] produced by, edited by, directed by, executive produced by, and written by a film's editor",
    "questionPatternModEntities": "Were M1 and M2 produced by , edited by , directed by , executive produced by , and written by a film 's editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x1 a ns:film.film .\nns:m.0127xm7h ns:film.film.directed_by ?x0 .\nns:m.0127xm7h ns:film.film.edited_by ?x0 .\nns:m.0127xm7h ns:film.film.executive_produced_by ?x0 .\nns:m.0127xm7h ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0127xm7h ns:film.film.written_by ?x0 .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 121499,
    "questionWithBrackets": "Were [Murder 2] and [Kajraare] written by a production company's employee, written by a screenwriter's sibling, and edited by [Devendra Murdeshwar]",
    "questionPatternModEntities": "Were M2 and M4 written by a production company 's employee , written by a screenwriter 's sibling , and edited by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.writer .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ?x3 .\n?x3 a ns:film.production_company .\nFILTER ( ?x0 != ?x1 ) .\nns:m.03mhjb1 ns:film.film.edited_by ns:m.0h5swhj .\nns:m.03mhjb1 ns:film.film.written_by ?x0 .\nns:m.03mhjb1 ns:film.film.written_by ?x2 .\nns:m.0gvv8q4 ns:film.film.edited_by ns:m.0h5swhj .\nns:m.0gvv8q4 ns:film.film.written_by ?x0 .\nns:m.0gvv8q4 ns:film.film.written_by ?x2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\n?x2 P1 ?x3 .\n?x3 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P2 ?x2 .\nM2 P3 M3 .\nM4 P2 ?x0 .\nM4 P2 ?x2 .\nM4 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 50
  },
  {
    "questionIdx": 33962,
    "questionWithBrackets": "Did a film editor influence [I Am So Proud of You]'s star, writer, and cinematographer, influence a film director, and influence [Christopher Largen]",
    "questionPatternModEntities": "Did a film editor influence M2 's star , writer , and cinematographer , influence a film director , and influence M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced ?x2 .\n?x0 ns:influence.influence_node.influenced ns:m.0bqnky .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.05p793f .\n?x1 ns:film.cinematographer.film ns:m.05p793f .\n?x1 ns:film.writer.film ns:m.05p793f .\n?x2 a ns:film.director\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M2 .\n?x1 P3 M2 .\n?x2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 50
  },
  {
    "questionIdx": 74388,
    "questionWithBrackets": "Was [Robbie Bonham] influenced by a Spanish screenwriter, influenced by an actor, and influenced by an actor's spouse",
    "questionPatternModEntities": "Was M3 influenced by a Spanish screenwriter , influenced by a actor , and influenced by a actor 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.actor .\n?x2 a ns:film.actor .\n?x3 a ns:film.writer .\n?x3 ns:people.person.nationality ns:m.06mkj .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02x988q ns:influence.influence_node.influenced_by ?x0 .\nns:m.02x988q ns:influence.influence_node.influenced_by ?x2 .\nns:m.02x988q ns:influence.influence_node.influenced_by ?x3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\n?x2 a M0 .\n?x3 P1 M2 .\n?x3 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM3 P2 ?x0 .\nM3 P2 ?x2 .\nM3 P2 ?x3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 50
  },
  {
    "questionIdx": 75854,
    "questionWithBrackets": "Was [Sepet] written by and directed by a film director whose employer acquired [MicroMUSE] and [PricewaterhouseCoopers] and acquired [Rational Software]",
    "questionPatternModEntities": "Was M4 written by and directed by a film director whose employer acquired M1 and M2 and acquired M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.012_78 .\n?x1 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.01xtmx .\n?x1 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.0bbqpg .\nns:m.06hl_c ns:film.film.directed_by ?x0 .\nns:m.06hl_c ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P1 M2 .\n?x1 P1 M3 .\nM4 P2 ?x0 .\nM4 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 50
  },
  {
    "questionIdx": 195020,
    "questionWithBrackets": "Which character was influenced by [Dick Gregory], was influenced by [Mort Sahl] and [Dewey 'Pigmeat' Markham], and was influenced by a character's sibling",
    "questionPatternModEntities": "Which character was influenced by M1 , was influenced by M2 and M3 , and was influenced by a character 's sibling",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] , was [VP_SIMPLE] by [entity] and [entity] , and was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01dgtv .\n?x0 ns:influence.influence_node.influenced_by ns:m.01jpwfr .\n?x0 ns:influence.influence_node.influenced_by ns:m.02v2zl .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:fictional_universe.fictional_character .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Chris Rock",
    "recursionDepth": 50
  },
  {
    "questionIdx": 236038,
    "questionWithBrackets": "Who was influenced by [George Carlin] and [Rodney Dangerfield], influenced by a producer, star, and writer of [Norbit], and influenced by [Steve Martin]",
    "questionPatternModEntities": "Who was influenced by M1 and M2 , influenced by a producer , star , and writer of M4 , and influenced by M3",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.014z8v .\n?x0 ns:influence.influence_node.influenced_by ns:m.015b67 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0p_47 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0kv2hv .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0kv2hv .\n?x1 ns:film.writer.film ns:m.0kv2hv\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x1 P1 M4 .\n?x1 P2 M4 .\n?x1 P3 M4\n}",
    "expectedResponse": "Chris Rock; Artie Lange",
    "recursionDepth": 50
  },
  {
    "questionIdx": 48957,
    "questionWithBrackets": "Was [By Way of the Mountains] edited by, executive produced by, written by, produced by, and directed by a French actor of [Parvulesco]",
    "questionPatternModEntities": "Was M2 edited by , executive produced by , written by , produced by , and directed by a French actor of M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.045ncyp .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0_rh8qx ns:film.film.directed_by ?x0 .\nns:m.0_rh8qx ns:film.film.edited_by ?x0 .\nns:m.0_rh8qx ns:film.film.executive_produced_by ?x0 .\nns:m.0_rh8qx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0_rh8qx ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0 .\nM2 P6 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 50
  },
  {
    "questionIdx": 177981,
    "questionWithBrackets": "What was executive produced by a producer and star of [Eight Crazy Nights], executive produced by [Albert S. Ruddy], and written by a director of [By Virtue Fall]",
    "questionPatternModEntities": "What was executive produced by a producer and star of M1 , executive produced by M0 , and written by a director of M2",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.05bdqt .\n?x0 ns:film.film.written_by ?x2 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.02m7tn .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02m7tn .\n?x2 ns:film.director.film ns:m.0gxn0nn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x2 P4 M2\n}",
    "expectedResponse": "The Longest Yard",
    "recursionDepth": 50
  }
]