[
  {
    "questionIdx": 120191,
    "questionWithBrackets": "Were [Let\u2019s Hope It\u2019s a Girl] and [We Want the Colonels] written by a parent of [Bittu Anand]",
    "questionPatternModEntities": "Were M1 and M2 written by a parent of M0",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0jjz5lh .\nns:m.05zntyt ns:film.film.written_by ?x0 .\nns:m.0bntqqq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 67022,
    "questionWithBrackets": "Was [Melinda McGraw] an actor of [James Gordon]'s child and spouse",
    "questionPatternModEntities": "Was M1 a actor of M0 's child and spouse",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.031v20 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.031v20 .\nFILTER ( ?x0 != ns:m.031v20 ) .\nns:m.0443_w ns:film.actor.film/ns:film.performance.character ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nFILTER ( ?x0 != M0 ) .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 197361,
    "questionWithBrackets": "Which costume designer founded [Conceived In Prison]'s distributor and producer",
    "questionPatternModEntities": "Which costume designer founded M1 's distributor and producer",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0644pyf .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0644pyf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "Clint Crisher",
    "recursionDepth": 22
  },
  {
    "questionIdx": 108159,
    "questionWithBrackets": "Was an actor an art director that [Pirosmani] starred",
    "questionPatternModEntities": "Was a actor a art director that M2 starred",
    "questionTemplate": "Was a [NP_SIMPLE] a [NP_SIMPLE] that [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:film.film_art_director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.04svqml\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 71205,
    "questionWithBrackets": "Was [Penny Dixon] a female spouse of [Allen Waterman]'s sibling",
    "questionPatternModEntities": "Was M1 a female spouse of M0 's sibling",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0t_7s7f .\nFILTER ( ?x0 != ns:m.0t_7s7f ) .\nFILTER ( ns:m.0j6glhy != ?x0 ) .\nns:m.0j6glhy ns:people.person.gender ns:m.02zsn .\nns:m.0j6glhy ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P1 M2 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 91899,
    "questionWithBrackets": "Was a child and parent of [Top Speed]'s distributor [Warner Bros.-Seven Arts]",
    "questionPatternModEntities": "Was a child and parent of M0 's distributor M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.02qd47l .\nns:m.03q7q1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.03q7q1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 110903,
    "questionWithBrackets": "Was an executive producer, editor, and cinematographer of [Mohammed To Maya] [Jeff Roy]",
    "questionPatternModEntities": "Was a executive producer , editor , and cinematographer of M1 M0",
    "questionTemplate": "Was a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0jmqd2w ns:film.cinematographer.film ns:m.0q1_vy1 .\nns:m.0jmqd2w ns:film.editor.film ns:m.0q1_vy1 .\nns:m.0jmqd2w ns:film.producer.films_executive_produced ns:m.0q1_vy1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P1 M1 .\nM0 P2 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 59274,
    "questionWithBrackets": "Was [I'm All Right Jack]'s editor's country of nationality a cinematographer's country of nationality",
    "questionPatternModEntities": "Was M1 's editor 's country of nationality a cinematographer 's country of nationality",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ?x1 .\n?x0 ^ns:people.person.nationality ?x2 .\n?x1 a ns:film.cinematographer .\n?x2 ns:film.editor.film ns:m.04l99r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 213670,
    "questionWithBrackets": "Who did [A Vision of Blindness]'s director's parent's country of nationality employ",
    "questionPatternModEntities": "Who did M1 's director 's parent 's country of nationality employ",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x3 .\n?x3 ns:film.director.film ns:m.0hynyfp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 P3 M1\n}",
    "expectedResponse": "Tim Vickery",
    "recursionDepth": 22
  },
  {
    "questionIdx": 30971,
    "questionWithBrackets": "Did a company's employee's employer distribute [The Next Best Thing]",
    "questionPatternModEntities": "Did a company 's employee 's employer distribute M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.09y6pb .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 108321,
    "questionWithBrackets": "Was an actor of [Kyun! Ho Gaya Na...]'s star and writer [mintu]",
    "questionPatternModEntities": "Was a actor of M0 's star and writer M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.064l1n .\n?x0 ns:film.writer.film ns:m.064l1n .\nns:m.0kb5jvq ns:film.actor.film/ns:film.performance.character ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 3723,
    "questionWithBrackets": "Did [Catherine Avgiris]'s employer acquire a film's producer",
    "questionPatternModEntities": "Did M0 's employer acquire a film 's producer",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.04h_9h2 .\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 34366,
    "questionWithBrackets": "Did a film editor's parent's employer distribute [Vemulawada Bheemakavi]",
    "questionPatternModEntities": "Did a film editor 's parent 's employer distribute M0",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.012r3z1w .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.editor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 22
  },
  {
    "questionIdx": 183931,
    "questionWithBrackets": "What was written and produced by [Daggers]'s costume designer",
    "questionPatternModEntities": "What was written and produced by M0 's costume designer",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0dm7t2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0\n}",
    "expectedResponse": "Mother's House",
    "recursionDepth": 22
  },
  {
    "questionIdx": 4166,
    "questionWithBrackets": "Did [Christine Norden] and [Katherine Kath] marry an actor's spouse",
    "questionPatternModEntities": "Did M1 and M2 marry a actor 's spouse",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.actor .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.0gchg4 != ?x0 ) .\nFILTER ( ns:m.0qfngsp != ?x0 ) .\nns:m.0gchg4 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0qfngsp ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M2 != ?x0 ) .\nM1 P0 ?x0 .\nM2 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 221064,
    "questionWithBrackets": "Who married [Training Day]'s executive producer's spouse's sibling",
    "questionPatternModEntities": "Who married M1 's executive producer 's spouse 's sibling",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x3 ns:film.producer.films_executive_produced ns:m.01718w .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P0 ?x3 .\n?x3 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ?x3 )\n}",
    "expectedResponse": "Amy Robach; Jennifer Hageney",
    "recursionDepth": 22
  },
  {
    "questionIdx": 16546,
    "questionWithBrackets": "Did [Patrik Pa\u0161\u0161] edit and produce a film",
    "questionPatternModEntities": "Did M1 edit and produce a film",
    "questionTemplate": "Did [entity] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0bgbwph ns:film.editor.film ?x0 .\nns:m.0bgbwph ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 22
  },
  {
    "questionIdx": 188805,
    "questionWithBrackets": "Which Chinese film producer edited [Time and Tide] and [Angel Warriors]",
    "questionPatternModEntities": "Which Chinese film producer edited M1 and M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.editor.film ns:m.0fh7w7 .\n?x0 ns:film.editor.film ns:m.0ywzr_9 .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Marco Mak",
    "recursionDepth": 22
  },
  {
    "questionIdx": 148961,
    "questionWithBrackets": "What did a cinematographer that [Video Archives] employed found",
    "questionPatternModEntities": "What did a cinematographer that M1 employed found",
    "questionTemplate": "What did a [NP_SIMPLE] that [entity] [VP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 a ns:film.cinematographer .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03phx4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0\n}",
    "expectedResponse": "A Band Apart; Rolling Thunder Pictures",
    "recursionDepth": 22
  },
  {
    "questionIdx": 190565,
    "questionWithBrackets": "Which Italian person did [Blackadder: Back & Forth]'s producer employ",
    "questionPatternModEntities": "Which Italian person did M2 's producer employ",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.028k_g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2\n}",
    "expectedResponse": "Alex Polizzi",
    "recursionDepth": 22
  },
  {
    "questionIdx": 171190,
    "questionWithBrackets": "What was directed by and produced by [Cookie Jar Group]'s founder",
    "questionPatternModEntities": "What was directed by and produced by M0 's founder",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.06_dbm\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0\n}",
    "expectedResponse": "Voulez-vous coucher avec God?",
    "recursionDepth": 23
  },
  {
    "questionIdx": 99557,
    "questionWithBrackets": "Was a film producer's child's child and parent [VG Treasury SAS]",
    "questionPatternModEntities": "Was a film producer 's child 's child and parent M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.producer .\nns:m.09mywzk ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.09mywzk ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 185285,
    "questionWithBrackets": "What was written by a film distributor founded by [Herman Casler]",
    "questionPatternModEntities": "What was written by a film distributor founded by M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.film_distributor .\n?x1 ns:organization.organization.founders ns:m.0dfqtk\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0\n}",
    "expectedResponse": "Arrival of Tongkin Train",
    "recursionDepth": 23
  },
  {
    "questionIdx": 12555,
    "questionWithBrackets": "Did [Knut Hamsun] influence an American person's parent",
    "questionPatternModEntities": "Did M2 influence a American person 's parent",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.nationality ns:m.09c7w0 .\nns:m.04g0m ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 194449,
    "questionWithBrackets": "Which art director was influenced by [Chanel]'s female founder",
    "questionPatternModEntities": "Which art director was influenced by M1 's female founder",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.036rkh .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Karl Lagerfeld",
    "recursionDepth": 23
  },
  {
    "questionIdx": 100984,
    "questionWithBrackets": "Was a film's producer acquired by [TPG Capital] and [APriori Capital Partners]",
    "questionPatternModEntities": "Was a film 's producer acquired by M0 and M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02qb2mr .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.03yqpb .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 18656,
    "questionWithBrackets": "Did [Safari Books Online]'s founder's employer's parent acquire [Vivendi]",
    "questionPatternModEntities": "Did M1 's founder 's employer 's parent acquire M0",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.049ql1 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0220wh3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 98626,
    "questionWithBrackets": "Was a film executive produced and written by [Joseph Nanni]",
    "questionPatternModEntities": "Was a film executive produced and written by M1",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.executive_produced_by ns:m.0g41jck .\n?x0 ns:film.film.written_by ns:m.0g41jck\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 32360,
    "questionWithBrackets": "Did a female person edit [Light of My Eyes] and [The Physics Of Water]",
    "questionPatternModEntities": "Did a female person edit M1 and M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.04j24zx .\n?x0 ns:film.editor.film ns:m.0fpq2w6 .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 99614,
    "questionWithBrackets": "Was a film producer's employer acquired by [Comcast] and [NBCUniversal]",
    "questionPatternModEntities": "Was a film producer 's employer acquired by M0 and M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.01s73z .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.02_l39 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 216654,
    "questionWithBrackets": "Who did [\u00a1Mis abuelitas... nom\u00e1s!]'s Mexican writer's country of nationality employ",
    "questionPatternModEntities": "Who did M1 's Mexican writer 's country of nationality employ",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:film.writer.film ns:m.0ggbnrj .\n?x2 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\n?x2 P3 M2\n}",
    "expectedResponse": "P\u00e1nfilo de Narv\u00e1ez",
    "recursionDepth": 23
  },
  {
    "questionIdx": 111996,
    "questionWithBrackets": "Were [Against All Flags] and [Weird Science] distributed by a person's child",
    "questionPatternModEntities": "Were M1 and M2 distributed by a person 's child",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:people.person .\nns:m.01j_lt ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.027ylsy ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 143808,
    "questionWithBrackets": "What did [Harvard University]'s employee's Dutch spouse produce",
    "questionPatternModEntities": "What did M1 's employee 's Dutch spouse produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.nationality ns:m.059j2 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03ksy .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Submission",
    "recursionDepth": 23
  },
  {
    "questionIdx": 220268,
    "questionWithBrackets": "Who married [Goth Patron]'s actor's female spouse",
    "questionPatternModEntities": "Who married M2 's actor 's female spouse",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:film.actor.film/ns:film.performance.character ns:m.0vp5z0w .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P0 ?x2 .\n?x1 P1 M1 .\n?x2 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Louis E. Rosas; Paul B. Cutler",
    "recursionDepth": 23
  },
  {
    "questionIdx": 106360,
    "questionWithBrackets": "Was a spouse of [Me and My Brother]'s writer a spouse of [Halldor Enard]",
    "questionPatternModEntities": "Was a spouse of M1 's writer a spouse of M0",
    "questionTemplate": "Was a [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j6f091 .\n?x1 ns:film.writer.film ns:m.047mrl2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0j6f091 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 39946,
    "questionWithBrackets": "Did a spouse of a spouse of [Blanche Oelrichs] play [Annie Daly]",
    "questionPatternModEntities": "Did a spouse of a spouse of M1 play M0",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0n3g441 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0830cw .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0830cw )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P1 M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 215104,
    "questionWithBrackets": "Who did [The Cell 2]'s prequel's Japanese costume designer marry",
    "questionPatternModEntities": "Who did M2 's prequel 's Japanese costume designer marry",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x1 ns:people.person.nationality ns:m.03_3d .\n?x2 ns:film.film.sequel ns:m.05sxjk3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 M1 .\n?x2 P3 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Nico Soultanakis",
    "recursionDepth": 23
  }
]