[
  {
    "questionIdx": 93634,
    "questionWithBrackets": "Was a company whose child and parent employed a film producer [Onomichi FM]",
    "questionPatternModEntities": "Was a company whose child and parent employed a film producer M1",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 a ns:film.producer .\nns:m.026_hq6 a ns:business.employer .\nns:m.026_hq6 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.026_hq6 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 176822,
    "questionWithBrackets": "What was executive produced by [Lyndell Hardin]'s male spouse's German spouse",
    "questionPatternModEntities": "What was executive produced by M2 's male spouse 's German spouse",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.gender ns:m.05zppz .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0n4q4k_ .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.0n4q4k_ )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 ?x2 .\n?x2 P2 M2 .\n?x2 P3 M1 .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "Dr. Minx",
    "recursionDepth": 30
  },
  {
    "questionIdx": 238497,
    "questionWithBrackets": "Who was influenced by a person and influenced [Russell Banks] and [Derek Marlowe]",
    "questionPatternModEntities": "Who was influenced by a person and influenced M1 and M2",
    "questionTemplate": "Who was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ns:m.027dr8v .\n?x0 ns:influence.influence_node.influenced ns:m.02p31c .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 a ns:people.person\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M0\n}",
    "expectedResponse": "Ernest Hemingway",
    "recursionDepth": 30
  },
  {
    "questionIdx": 151267,
    "questionWithBrackets": "What did an actor of [Fabious] produce, edit, and direct",
    "questionPatternModEntities": "What did a actor of M0 produce , edit , and direct",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0ghc_dq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "The Broken Tower",
    "recursionDepth": 30
  },
  {
    "questionIdx": 103031,
    "questionWithBrackets": "Was a person a Mexican film editor whose spouse edited [Smokey Bites the Dust]",
    "questionPatternModEntities": "Was a person a Mexican film editor whose spouse edited M3",
    "questionTemplate": "Was a [NP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.editor.film ns:m.0k0kg32 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 147978,
    "questionWithBrackets": "What did [Worshipper #1]'s British actor edit and [Zane Casablanca] write",
    "questionPatternModEntities": "What did M2 's British actor edit and M0 write",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ns:m.011chxq5 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.011chjnb .\n?x1 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Tales of the Supernatural",
    "recursionDepth": 30
  },
  {
    "questionIdx": 118264,
    "questionWithBrackets": "Were [Im Zauber der Kordilleren] and [The Shaper] produced by a German parent of a film editor",
    "questionPatternModEntities": "Were M2 and M3 produced by a German parent of a film editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.nationality ns:m.0345h .\n?x1 a ns:film.editor .\nns:m.0c7536l ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0w9v5r4 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 30
  },
  {
    "questionIdx": 58508,
    "questionWithBrackets": "Was [Hideaki Anno] a producer, executive producer, writer, and director of [Animation vs. Animator 1]'s sequel",
    "questionPatternModEntities": "Was M1 a producer , executive producer , writer , and director of M0 's sequel",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.0108m1yx .\nns:m.01t6lp ns:film.director.film ?x0 .\nns:m.01t6lp ns:film.producer.films_executive_produced ?x0 .\nns:m.01t6lp ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.01t6lp ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 30
  },
  {
    "questionIdx": 170861,
    "questionWithBrackets": "What was directed by a parent of an actor and directed by [Abbas Kiarostami]",
    "questionPatternModEntities": "What was directed by a parent of a actor and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ns:m.023t0q .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Lumi\u00e8re and Company; To Each His Own Cinema",
    "recursionDepth": 31
  },
  {
    "questionIdx": 150823,
    "questionWithBrackets": "What did a spouse of [Chan Ye-cheng] write, direct, and executive produce",
    "questionPatternModEntities": "What did a spouse of M0 write , direct , and executive produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0jz54f .\nFILTER ( ?x1 != ns:m.0jz54f )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Happy Together; Fallen Angels",
    "recursionDepth": 31
  },
  {
    "questionIdx": 169820,
    "questionWithBrackets": "What was directed by [Elijah Drenner] and executive produced by a male person",
    "questionPatternModEntities": "What was directed by M0 and executive produced by a male person",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.03nwz33 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M2 .\n?x1 a M1\n}",
    "expectedResponse": "That Guy Dick Miller",
    "recursionDepth": 31
  },
  {
    "questionIdx": 44979,
    "questionWithBrackets": "Was [Ali al-Naimi] employed by [Saudi Aramco] and employed by [Dineja Agathocleous]'s sibling's country of nationality",
    "questionPatternModEntities": "Was M1 employed by M2 and employed by M0 's sibling 's country of nationality",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0j81x2c .\nFILTER ( ?x1 != ns:m.0j81x2c ) .\nns:m.077cfq ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.077cfq ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01qjg2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nFILTER ( ?x1 != M0 ) .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 128903,
    "questionWithBrackets": "Were [Une sortie du 'Rubis'] and [World Without Sun] directed by a French founder of [Cabela's Retail MO, LLC] and [EarthEcho International]",
    "questionPatternModEntities": "Were M3 and M4 directed by a French founder of M0 and M1",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.09669d .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.09n0s59 .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0bl5w2 ns:film.film.directed_by ?x0 .\nns:m.0v9thzk ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nM3 P2 ?x0 .\nM4 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 40966,
    "questionWithBrackets": "Did an Italian screenwriter executive produce [Sogni mostruosamente proibiti] and produce [Twixt]",
    "questionPatternModEntities": "Did a Italian screenwriter executive produce M1 and produce M3",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.producer.films_executive_produced ns:m.0ztb6hj .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0drytd1 .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 193278,
    "questionWithBrackets": "Which actor was a Canadian screenwriter that [Roy Lichtenstein] and [J. G. Ballard] influenced",
    "questionPatternModEntities": "Which actor was a Canadian screenwriter that M2 and M3 influenced",
    "questionTemplate": "Which [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced_by ns:m.041xl .\n?x0 ns:influence.influence_node.influenced_by ns:m.0gcgd .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Douglas Coupland",
    "recursionDepth": 31
  },
  {
    "questionIdx": 181883,
    "questionWithBrackets": "What was produced by [Yoram Gross] and written by [Shulamit Gross]'s child and spouse",
    "questionPatternModEntities": "What was produced by M0 and written by M1 's child and spouse",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.0bh6hf .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0r934js .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0r934js .\nFILTER ( ?x1 != ns:m.0r934js )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Joseph the Dreamer",
    "recursionDepth": 31
  },
  {
    "questionIdx": 149806,
    "questionWithBrackets": "What did a film distributor's founder and employee edit and executive produce",
    "questionPatternModEntities": "What did a film distributor 's founder and employee edit and executive produce",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x2 a M0\n}",
    "expectedResponse": "The Goonies",
    "recursionDepth": 31
  },
  {
    "questionIdx": 10132,
    "questionWithBrackets": "Did [Igor] star [Jennifer Coolidge] and star [Man in white suit]'s British actor",
    "questionPatternModEntities": "Did M2 star M3 and star M1 's British actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0w4ct6c .\n?x0 ns:people.person.nationality ns:m.07ssc .\nns:m.0kvc0h ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0kvc0h ns:film.film.starring/ns:film.performance.actor ns:m.073749\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 4119,
    "questionWithBrackets": "Did [Chow Yun-Fat] marry [Jasmine Tan] and marry [Love Is a Many Stupid Thing]'s Chinese costume designer",
    "questionPatternModEntities": "Did M2 marry M3 and marry M0 's Chinese costume designer",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.0glrcd_ .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nFILTER ( ns:m.0m9v7 != ?x0 ) .\nFILTER ( ns:m.0m9v7 != ns:m.02kkpfq ) .\nns:m.0m9v7 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0m9v7 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02kkpfq\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M3 ) .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 121217,
    "questionWithBrackets": "Were [Mimic] and [The Devil's Backbone] directed by a Mexican executive producer of [Kung Fu Panda 2]'s sequel",
    "questionPatternModEntities": "Were M2 and M3 directed by a Mexican executive producer of M1 's sequel",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x1 ns:film.film.prequel ns:m.06ztvyx .\nns:m.04d0ng ns:film.film.directed_by ?x0 .\nns:m.0dqvh3 ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 150311,
    "questionWithBrackets": "What did a parent of [Bruce A. Taylor] write, produce, and executive produce",
    "questionPatternModEntities": "What did a parent of M0 write , produce , and executive produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0b_vcz2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "At Any Cost",
    "recursionDepth": 31
  },
  {
    "questionIdx": 156067,
    "questionWithBrackets": "What film director whose spouse was influenced by [Groucho Marx] and [Cole Porter] played [Daphne Wilder]",
    "questionPatternModEntities": "What film director whose spouse was influenced by M2 and M3 played M1",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] was [VP_SIMPLE] by [entity] and [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.09qmxvf .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:influence.influence_node.influenced_by ns:m.01jrvr6 .\n?x1 ns:influence.influence_node.influenced_by ns:m.01wj9y9 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Diane Keaton",
    "recursionDepth": 31
  },
  {
    "questionIdx": 125110,
    "questionWithBrackets": "Were [StudentsFirst] and [The New Teacher Project] founded by a female spouse of [The ChubbChubbs!]'s cinematographer",
    "questionPatternModEntities": "Were M2 and M3 founded by a female spouse of M1 's cinematographer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.08sk48 .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0271f5x ns:organization.organization.founders ?x0 .\nns:m.0gvtxcb ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P3 ?x0 .\nM3 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 217368,
    "questionWithBrackets": "Who executive produced, wrote, and edited a sequel of [Tetsuo: The Iron Man]",
    "questionPatternModEntities": "Who executive produced , wrote , and edited a sequel of M1",
    "questionTemplate": "Who [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x1 ns:film.film.prequel ns:m.05m0x0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Shinya Tsukamoto",
    "recursionDepth": 31
  },
  {
    "questionIdx": 41025,
    "questionWithBrackets": "Did an actor direct [Out from the Shadow] and write a sequel of [The Scorpion King]",
    "questionPatternModEntities": "Did a actor direct M1 and write a sequel of M2",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.director.film ns:m.04f0m1c .\n?x0 ns:film.writer.film ?x1 .\n?x1 ns:film.film.prequel ns:m.03t95n\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 31
  },
  {
    "questionIdx": 168515,
    "questionWithBrackets": "What was a film whose executive producer, costume designer, and star played [Hordak]",
    "questionPatternModEntities": "What was a film whose executive producer , costume designer , and star played M1",
    "questionTemplate": "What was a [NP_SIMPLE] whose [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.costume_design_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.05sdvf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "The Trials of Darksmoke",
    "recursionDepth": 31
  },
  {
    "questionIdx": 9440,
    "questionWithBrackets": "Did [Harvard University]'s Mexican employee influence [Eliot Weinberger] and influence [Juan Goytisolo]",
    "questionPatternModEntities": "Did M2 's Mexican employee influence M0 and influence M1",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.01vk6b .\n?x0 ns:influence.influence_node.influenced ns:m.026xrqz .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03ksy .\n?x0 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 9381,
    "questionWithBrackets": "Did [Harvard University] employ [Mark Tobey Abroad]'s cinematographer and producer and employ [Increase Mather]",
    "questionPatternModEntities": "Did M1 employ M0 's cinematographer and producer and employ M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.02q50sq .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.02q50sq .\nns:m.03ksy ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.03ksy ns:business.employer.employees/ns:business.employment_tenure.person ns:m.01p1y5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 6450,
    "questionWithBrackets": "Did [Elizabeth Barrett Browning] influence and marry a female person's sibling",
    "questionPatternModEntities": "Did M2 influence and marry a female person 's sibling",
    "questionTemplate": "Did [entity] [VP_SIMPLE] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.gender ns:m.02zsn .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.02mfq != ?x0 ) .\nns:m.02mfq ns:influence.influence_node.influenced ?x0 .\nns:m.02mfq ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M2 != ?x0 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 173266,
    "questionWithBrackets": "What was edited by [Days of Being Wild]'s sequel's costume designer and executive produced by [Tsai Sung-lin]",
    "questionPatternModEntities": "What was edited by M1 's sequel 's costume designer and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0jts03 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x2 ns:film.film.prequel ns:m.027m67\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 P3 M1\n}",
    "expectedResponse": "Ashes of Time",
    "recursionDepth": 31
  },
  {
    "questionIdx": 185799,
    "questionWithBrackets": "What was written by, directed by, and edited by an art director of [Vne igry]",
    "questionPatternModEntities": "What was written by , directed by , and edited by a art director of M0",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0k3db90\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "Pishto Goes Away",
    "recursionDepth": 31
  },
  {
    "questionIdx": 33367,
    "questionWithBrackets": "Did a film director's spouse executive produce [Wait Until Spring, Bandini] and executive produce [The Bling Ring]",
    "questionPatternModEntities": "Did a film director 's spouse executive produce M0 and executive produce M1",
    "questionTemplate": "Did a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.09ghhks .\n?x0 ns:film.producer.films_executive_produced ns:m.0kbj11v .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.director .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  },
  {
    "questionIdx": 169458,
    "questionWithBrackets": "What was directed and executive produced by an actor's Japanese sibling",
    "questionPatternModEntities": "What was directed and executive produced by a actor 's Japanese sibling",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.nationality ns:m.03_3d .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.actor .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 M0 .\n?x2 a M1 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Tetsuo II: Body Hammer",
    "recursionDepth": 31
  },
  {
    "questionIdx": 36879,
    "questionWithBrackets": "Did a male actor of [Juke-A-Tron] executive produce and edit [An Okay Place to Eat]",
    "questionPatternModEntities": "Did a male actor of M1 executive produce and edit M0",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0hgcjgq .\n?x0 ns:film.editor.film ns:m.0h36wgt .\n?x0 ns:film.producer.films_executive_produced ns:m.0h36wgt .\n?x0 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M1 .\n?x0 P3 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 31
  }
]