[
  {
    "questionIdx": 181992,
    "questionWithBrackets": "What was produced by a Japanese cinematographer's sibling",
    "questionPatternModEntities": "What was produced by a Japanese cinematographer 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.cinematographer .\n?x2 ns:people.person.nationality ns:m.03_3d .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 P2 M1 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Zhuangzi Tests His Wife",
    "recursionDepth": 23
  },
  {
    "questionIdx": 97401,
    "questionWithBrackets": "Was a film distributor that acquired [Tivoli Systems, Inc.] and [CommQuest] [SK Telecom]",
    "questionPatternModEntities": "Was a film distributor that acquired M2 and M3 M0",
    "questionTemplate": "Was a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02fz1t a ns:film.film_distributor .\nns:m.02fz1t ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.03f6r9_ .\nns:m.02fz1t ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.09rpsc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 204519,
    "questionWithBrackets": "Which film producer was influenced by [Mario Calvino]'s Italian child",
    "questionPatternModEntities": "Which film producer was influenced by M2 's Italian child",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.nationality ns:m.03rjj .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0ndp_9s\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "Salman Rushdie; Daniel Wallace",
    "recursionDepth": 23
  },
  {
    "questionIdx": 147700,
    "questionWithBrackets": "What did [Tung]'s editor, cinematographer, and director found",
    "questionPatternModEntities": "What did M0 's editor , cinematographer , and director found",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0jwgypf .\n?x1 ns:film.director.film ns:m.0jwgypf .\n?x1 ns:film.editor.film ns:m.0jwgypf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Canyon Cinema",
    "recursionDepth": 23
  },
  {
    "questionIdx": 59495,
    "questionWithBrackets": "Was [Improper Conduct] directed by a Spanish cinematographer of [Made in Milan]",
    "questionPatternModEntities": "Was M2 directed by a Spanish cinematographer of M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0dgf3f1 .\n?x0 ns:people.person.nationality ns:m.06mkj .\nns:m.06sg2t ns:film.film.directed_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 205093,
    "questionWithBrackets": "Which film was edited by and starred [Bill Hinzman]",
    "questionPatternModEntities": "Which film was edited by and starred M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ns:m.0d_w7n .\n?x0 ns:film.film.starring/ns:film.performance.actor ns:m.0d_w7n\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Flesheater",
    "recursionDepth": 23
  },
  {
    "questionIdx": 26855,
    "questionWithBrackets": "Did a Chinese screenwriter edit [The Midnight After] and [Z Storm]",
    "questionPatternModEntities": "Did a Chinese screenwriter edit M1 and M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.editor.film ns:m.0_frhk5 .\n?x0 ns:film.editor.film ns:m.0_gzspc .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 50957,
    "questionWithBrackets": "Was [Cora\u00e7\u00e3o de Ga\u00facho] edited by a producer and editor of [Math Test]",
    "questionPatternModEntities": "Was M1 edited by a producer and editor of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0j2mycj .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0j2mycj .\nns:m.03cmx6l ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 5220,
    "questionWithBrackets": "Did [David Borowich]'s male spouse influence a character",
    "questionPatternModEntities": "Did M1 's male spouse influence a character",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0520w6x .\n?x1 a ns:fictional_universe.fictional_character .\nFILTER ( ?x0 != ns:m.0520w6x )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 M1 .\n?x1 a M2 .\nFILTER ( ?x0 != M1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 158466,
    "questionWithBrackets": "What film that [Severin Frei] wrote was directed by [Jonas Frei]",
    "questionPatternModEntities": "What film that M1 wrote was directed by M2",
    "questionTemplate": "What [NP_SIMPLE] that [entity] [VP_SIMPLE] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ns:m.0118tzvp .\n?x0 ns:film.film.written_by ns:g.1269ny6r5\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Panamericana",
    "recursionDepth": 23
  },
  {
    "questionIdx": 10033,
    "questionWithBrackets": "Did [I Are You, You Am Me]'s Mexican costume designer edit a film",
    "questionPatternModEntities": "Did M0 's Mexican costume designer edit a film",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.09v8y7h .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 M1 .\n?x1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 174660,
    "questionWithBrackets": "What was edited by and directed by [The Hustler of Muscle Beach]'s director",
    "questionPatternModEntities": "What was edited by and directed by M0 's director",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.director.film ns:m.04q1x6g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0\n}",
    "expectedResponse": "Night Call Nurses",
    "recursionDepth": 23
  },
  {
    "questionIdx": 220225,
    "questionWithBrackets": "Who married [Fudgy Wudgy Fudge Face]'s director, executive producer, and costume designer",
    "questionPatternModEntities": "Who married M1 's director , executive producer , and costume designer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.0h1pp81 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0h1pp81 .\n?x1 ns:film.producer.films_executive_produced ns:m.0h1pp81 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Wendi Kenya",
    "recursionDepth": 23
  },
  {
    "questionIdx": 52277,
    "questionWithBrackets": "Was [Denmark] a costume designer's female sibling's country of nationality",
    "questionPatternModEntities": "Was M2 a costume designer 's female sibling 's country of nationality",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ?x1 ) .\nns:m.0k6nt ^ns:people.person.nationality ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 86309,
    "questionWithBrackets": "Was [Warner Bros.-Seven Arts] a screenwriter's employer's parent and child",
    "questionPatternModEntities": "Was M1 a screenwriter 's employer 's parent and child",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 a ns:film.writer .\nns:m.03q7q1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.03q7q1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 230855,
    "questionWithBrackets": "Who was a film producer that [Amrita Singh] and [Kareena Kapoor] married",
    "questionPatternModEntities": "Who was a film producer that M2 and M3 married",
    "questionTemplate": "Who was a [NP_SIMPLE] that [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02756j .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.07f49g .\nFILTER ( ?x0 != ns:m.02756j ) .\nFILTER ( ?x0 != ns:m.07f49g )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 a M0 .\n?x0 a M1 .\nFILTER ( ?x0 != M2 ) .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Saif Ali Khan",
    "recursionDepth": 23
  },
  {
    "questionIdx": 154006,
    "questionWithBrackets": "What female Chinese screenwriter wrote [Once Upon a Mirage]",
    "questionPatternModEntities": "What female Chinese screenwriter wrote M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:film.writer.film ns:m.0ncxnzv .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Lilian Lee",
    "recursionDepth": 23
  },
  {
    "questionIdx": 220344,
    "questionWithBrackets": "Who married [Idiots and Angels]'s writer, art director, and producer",
    "questionPatternModEntities": "Who married M1 's writer , art director , and producer",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.04mwpx4 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.04mwpx4 .\n?x1 ns:film.writer.film ns:m.04mwpx4 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Sandrine Plympton",
    "recursionDepth": 23
  },
  {
    "questionIdx": 157073,
    "questionWithBrackets": "What film editor was employed by [Action Blue Sky Campaign]'s founder's country of nationality",
    "questionPatternModEntities": "What film editor was employed by M1 's founder 's country of nationality",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:organization.organization_founder.organizations_founded ns:m.0gqjlp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M1\n}",
    "expectedResponse": "Mark Aitchison Young",
    "recursionDepth": 23
  },
  {
    "questionIdx": 105380,
    "questionWithBrackets": "Was a screenwriter's American actor's parent [R. Ravindran]",
    "questionPatternModEntities": "Was a screenwriter 's American actor 's parent M2",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x1 a ns:film.writer .\nns:m.0xmnz9d ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 34753,
    "questionWithBrackets": "Did a film producer marry [Down Argentine Way]'s Italian star",
    "questionPatternModEntities": "Did a film producer marry M2 's Italian star",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0kv9dx .\n?x1 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 159989,
    "questionWithBrackets": "What male Japanese art director played [Seitaro Tanaka]",
    "questionPatternModEntities": "What male Japanese art director played M2",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_art_director .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0hz_bjw .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Shinya Tsukamoto",
    "recursionDepth": 23
  },
  {
    "questionIdx": 86895,
    "questionWithBrackets": "Was [Will Ryder] a film's art director, producer, and director",
    "questionPatternModEntities": "Was M1 a film 's art director , producer , and director",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0jzffrt ns:film.director.film ?x0 .\nns:m.0jzffrt ns:film.film_art_director.films_art_directed ?x0 .\nns:m.0jzffrt ns:film.producer.film|ns:film.production_company.films ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 22715,
    "questionWithBrackets": "Did [The Secret of Delft] and [Heilig recht] star a Dutch actor",
    "questionPatternModEntities": "Did M2 and M3 star a Dutch actor",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:people.person.nationality ns:m.059j2 .\nns:m.05zk17l ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.05zmwd7 ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 28518,
    "questionWithBrackets": "Did a Mexican sibling of [Dario Yazbek Bernal] executive produce [Just Walking]",
    "questionPatternModEntities": "Did a Mexican sibling of M0 executive produce M1",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.05mwmpg .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gc2jzk .\nFILTER ( ?x0 != ns:m.0gc2jzk )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 M2 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 147484,
    "questionWithBrackets": "What did [The Trials of Darksmoke]'s writer, costume designer, and star direct",
    "questionPatternModEntities": "What did M0 's writer , costume designer , and star direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0pb84n3 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.0pb84n3 .\n?x1 ns:film.writer.film ns:m.0pb84n3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "The Fountain of Life; The Trials of Darksmoke",
    "recursionDepth": 23
  },
  {
    "questionIdx": 218417,
    "questionWithBrackets": "Who influenced [Joe Dallet]'s spouse's German spouse",
    "questionPatternModEntities": "Who influenced M2 's spouse 's German spouse",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0k10wpl .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.0k10wpl )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 ?x2 .\n?x2 P2 M2 .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "Riazuddin",
    "recursionDepth": 23
  },
  {
    "questionIdx": 206184,
    "questionWithBrackets": "Which male Chinese film director did [Kung Fu Chefs] star",
    "questionPatternModEntities": "Which male Chinese film director did M2 star",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0b6dgxl .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Ku Feng; Lam Chi-chung",
    "recursionDepth": 23
  },
  {
    "questionIdx": 17462,
    "questionWithBrackets": "Did [Rahavalta!]'s American cinematographer marry a costume designer",
    "questionPatternModEntities": "Did M1 's American cinematographer marry a costume designer",
    "questionTemplate": "Did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0kfb18c .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\n?x0 P2 ?x1 .\n?x1 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 159998,
    "questionWithBrackets": "What male Japanese film producer wrote [Shito no densetsu]",
    "questionPatternModEntities": "What male Japanese film producer wrote M1",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.writer.film ns:g.1q54w5y9_ .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Keisuke Kinoshita",
    "recursionDepth": 23
  },
  {
    "questionIdx": 94787,
    "questionWithBrackets": "Was a costume designer's sibling's female spouse [Nicole Bettencourt Coelho]",
    "questionPatternModEntities": "Was a costume designer 's sibling 's female spouse M1",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.0yhlcps != ?x0 ) .\nns:m.0yhlcps ns:people.person.gender ns:m.02zsn .\nns:m.0yhlcps ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P1 M2 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 31236,
    "questionWithBrackets": "Did a costume designer influence [Avakai Biryani]'s producer and cinematographer",
    "questionPatternModEntities": "Did a costume designer influence M1 's producer and cinematographer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:film.cinematographer.film ns:m.080mkf2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.080mkf2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 23
  },
  {
    "questionIdx": 101035,
    "questionWithBrackets": "Was a film's producer's child employed by [Sanjay Leela Bhansali]",
    "questionPatternModEntities": "Was a film 's producer 's child employed by M0",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.05xdjl .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 142697,
    "questionWithBrackets": "What did [Clay Pigeon]'s cinematographer, director, and star write",
    "questionPatternModEntities": "What did M0 's cinematographer , director , and star write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0gj4xgx .\n?x1 ns:film.cinematographer.film ns:m.0gj4xgx .\n?x1 ns:film.director.film ns:m.0gj4xgx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Plastic Bags; Clay Pigeon",
    "recursionDepth": 23
  },
  {
    "questionIdx": 56323,
    "questionWithBrackets": "Was [Gary Stanfield] a film director's actor's male parent",
    "questionPatternModEntities": "Was M1 a film director 's actor 's male parent",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 a ns:film.director .\nns:m.0z40vx_ ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.0z40vx_ ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 M2 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 95436,
    "questionWithBrackets": "Was a female American sibling of [Jimmy McNichol] [Kristy McNichol]",
    "questionPatternModEntities": "Was a female American sibling of M1 M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.02_wgp != ns:m.0gygrn ) .\nns:m.02_wgp ns:people.person.gender ns:m.02zsn .\nns:m.02_wgp ns:people.person.nationality ns:m.09c7w0 .\nns:m.02_wgp ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0gygrn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M1 ) .\nM0 P0 M1 .\nM0 P1 M2 .\nM0 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 23
  },
  {
    "questionIdx": 116218,
    "questionWithBrackets": "Were [Eddie Izzard] and [Jerry Seinfeld] influenced by [Jesus - The Christ ]'s parent's actor",
    "questionPatternModEntities": "Were M1 and M2 influenced by M0 's parent 's actor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.042g53r .\nns:m.0126rp ns:influence.influence_node.influenced_by ?x0 .\nns:m.0q5hw ns:influence.influence_node.influenced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  },
  {
    "questionIdx": 14664,
    "questionWithBrackets": "Did [Meshes of the Afternoon]'s writer influence [Water for Maya]'s editor and cinematographer",
    "questionPatternModEntities": "Did M0 's writer influence M1 's editor and cinematographer",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0jy_t .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0_lvrp8 .\n?x1 ns:film.editor.film ns:m.0_lvrp8\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 24
  }
]