[
  {
    "questionIdx": 12239,
    "questionWithBrackets": "Did [Karl Marx] and [Friedrich Engels] influence [Cornel West] and influence a Chinese parent of [Mao Anqing]",
    "questionPatternModEntities": "Did M2 and M4 influence M3 and influence a Chinese parent of M1",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.02q6kjb .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nns:m.048cl ns:influence.influence_node.influenced ?x0 .\nns:m.048cl ns:influence.influence_node.influenced ns:m.02szmg .\nns:m.0cp8j ns:influence.influence_node.influenced ?x0 .\nns:m.0cp8j ns:influence.influence_node.influenced ns:m.02szmg\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM4 P2 ?x0 .\nM4 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 215928,
    "questionWithBrackets": "Who did a film distributor's child's child and parent employ and [Momentum Pictures] employ",
    "questionPatternModEntities": "Who did a film distributor 's child 's child and parent employ and M1 employ",
    "questionTemplate": "Who did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.04ggdyk .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x3 .\n?x3 a ns:film.film_distributor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 P1 ?x3 .\n?x3 a M2\n}",
    "expectedResponse": "Daniel Jewel",
    "recursionDepth": 37
  },
  {
    "questionIdx": 84123,
    "questionWithBrackets": "Was [Train Stops for Five Minutes] edited by, written by, and directed by a female spouse of [Jacques Demy]",
    "questionPatternModEntities": "Was M2 edited by , written by , and directed by a female spouse of M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.046dxx .\nFILTER ( ?x0 != ns:m.046dxx ) .\nns:m.0z46z1_ ns:film.film.directed_by ?x0 .\nns:m.0z46z1_ ns:film.film.edited_by ?x0 .\nns:m.0z46z1_ ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 183756,
    "questionWithBrackets": "What was produced, written, edited, and directed by [The Days After]'s Japanese writer",
    "questionPatternModEntities": "What was produced , written , edited , and directed by M0 's Japanese writer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.writer.film ns:m.0hp7svn .\n?x1 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x1 P4 M0 .\n?x1 P5 M1\n}",
    "expectedResponse": "Nobody Knows; Air Doll",
    "recursionDepth": 37
  },
  {
    "questionIdx": 174497,
    "questionWithBrackets": "What was edited by a star of [Boltneck] and [Dead Man on Campus] and executive produced by [Kyra Mitchell]'s sibling",
    "questionPatternModEntities": "What was edited by a star of M1 and M2 and executive produced by M0 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x2 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.04j309s .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.07yr62 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0sgw386 .\nFILTER ( ?x2 != ns:m.0sgw386 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M0 .\n?x2 P3 M1 .\n?x2 P3 M2 .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Ganked",
    "recursionDepth": 37
  },
  {
    "questionIdx": 125802,
    "questionWithBrackets": "Were [The Beaches of Agn\u00e8s], [Der Viennale '04-Trailer], [Lion\u2019s Love], [The World of Jacques Demy], [Mural Murals], and [Ydessa, the Bears and etc.] produced by [The Gleaners and I]'s director and producer",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , M5 , and M6 produced by M0 's director and producer",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.09m9v4 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09m9v4 .\nns:m.04nm0cr ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0b_j8b_ ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bxl979 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bysl53 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0hz1xxj ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0z6mj21 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0 .\nM6 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 221902,
    "questionWithBrackets": "Who married, influenced, and was influenced by a writer and cinematographer of [The Young Girls Turn 25]",
    "questionPatternModEntities": "Who married , influenced , and was influenced by a writer and cinematographer of M1",
    "questionTemplate": "Who [VP_SIMPLE] , [VP_SIMPLE] , and was [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.07k4vg8 .\n?x1 ns:film.writer.film ns:m.07k4vg8 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M1 .\n?x1 P4 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 37
  },
  {
    "questionIdx": 147423,
    "questionWithBrackets": "What did [The Presumption of Justice]'s cinematographer, executive producer, and producer edit, produce, and direct",
    "questionPatternModEntities": "What did M0 's cinematographer , executive producer , and producer edit , produce , and direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0sgg1l9 .\n?x1 ns:film.producer.films_executive_produced ns:m.0sgg1l9 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0sgg1l9\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M0 .\n?x1 P5 M0\n}",
    "expectedResponse": "The Weight of Chains; The Presumption of Justice",
    "recursionDepth": 37
  },
  {
    "questionIdx": 147412,
    "questionWithBrackets": "What did [The Orchid Gardener]'s star, editor, and producer found and an actor found",
    "questionPatternModEntities": "What did M1 's star , editor , and producer found and a actor found",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:film.actor.film/ns:film.performance.film ns:m.04yfqxn .\n?x2 ns:film.editor.film ns:m.04yfqxn .\n?x2 ns:film.producer.film|ns:film.production_company.films ns:m.04yfqxn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1 .\n?x2 P2 M1 .\n?x2 P3 M1\n}",
    "expectedResponse": "Zentropa",
    "recursionDepth": 37
  },
  {
    "questionIdx": 82100,
    "questionWithBrackets": "Was [The Pawnshop] written by [Maverick Terrell] and [Vincent P. Bryan] and edited by an actor of [An old steward] and [The Lone Prospector]",
    "questionPatternModEntities": "Was M2 written by M3 and M4 and edited by a actor of M0 and M1",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0nd97n7 .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0v3z9_r .\nns:m.07m2js ns:film.film.edited_by ?x0 .\nns:m.07m2js ns:film.film.written_by ns:m.02xt55 .\nns:m.07m2js ns:film.film.written_by ns:m.0jv6bd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 M3 .\nM2 P1 M4 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 77212,
    "questionWithBrackets": "Was [Stalking Hotline] directed by [Home Shoppin' wit da Mob]'s producer, editor, and executive producer and executive produced by [Virginia Constantinescu]",
    "questionPatternModEntities": "Was M1 directed by M0 's producer , editor , and executive producer and executive produced by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.09_405z .\n?x0 ns:film.producer.films_executive_produced ns:m.09_405z .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09_405z .\nns:m.09_405h ns:film.film.directed_by ?x0 .\nns:m.09_405h ns:film.film.executive_produced_by ns:m.0fq9rhf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 M2 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 37
  },
  {
    "questionIdx": 141505,
    "questionWithBrackets": "What costume designer was influenced by an Italian parent of [Manuel De Sica] and influenced [Raghubir Singh]",
    "questionPatternModEntities": "What costume designer was influenced by a Italian parent of M3 and influenced M1",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:influence.influence_node.influenced ns:m.027fdff .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0jx4r7 .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3\n}",
    "expectedResponse": "Satyajit Ray",
    "recursionDepth": 37
  },
  {
    "questionIdx": 226276,
    "questionWithBrackets": "Who was a Dutch film producer that [Submission] was edited by and [De Witte Waan] starred",
    "questionPatternModEntities": "Who was a Dutch film producer that M2 was edited by and M4 starred",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.05z_1kg .\n?x0 ns:film.editor.film ns:m.04b5hv .\n?x0 ns:people.person.nationality ns:m.059j2\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Theo van Gogh",
    "recursionDepth": 37
  },
  {
    "questionIdx": 49922,
    "questionWithBrackets": "Was [Charlie Chaplin] a British film director that [A Burlesque on Carmen] starred and [A Busy Day] was edited by",
    "questionPatternModEntities": "Was M0 a British film director that M4 starred and M2 was edited by",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE] and [entity] was [VP_SIMPLE] by",
    "sparql": "SELECT count(*) WHERE {\nns:m.01lc5 a ns:film.director .\nns:m.01lc5 ns:film.actor.film/ns:film.performance.film ns:m.07n2_l .\nns:m.01lc5 ns:film.editor.film ns:m.05c3b2 .\nns:m.01lc5 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 P2 M4 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 127752,
    "questionWithBrackets": "Were [The Roller Blade Seven], [9mm Sunrise], [Guns of El Chupacabra], [Super Hero Central], and [Interview: The Documentary] edited by and produced by [Undercover X]'s star",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 edited by and produced by M0 's star",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.07grly .\nns:m.074s65 ns:film.film.edited_by ?x0 .\nns:m.074s65 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.07gqs2 ns:film.film.edited_by ?x0 .\nns:m.07gqs2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.07gr38 ns:film.film.edited_by ?x0 .\nns:m.07gr38 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.08c8xx ns:film.film.edited_by ?x0 .\nns:m.08c8xx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0f2fxg ns:film.film.edited_by ?x0 .\nns:m.0f2fxg ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM3 P1 ?x0 .\nM3 P2 ?x0 .\nM4 P1 ?x0 .\nM4 P2 ?x0 .\nM5 P1 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 37
  },
  {
    "questionIdx": 73856,
    "questionWithBrackets": "Was [Revenge of the Green Dragons] directed by [Motel Cactus]'s cinematographer, executive produced by [Alan Pao], and executive produced by [Corey Large]",
    "questionPatternModEntities": "Was M1 directed by M0 's cinematographer , executive produced by M2 , and executive produced by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.0bggpnj .\nns:m.0w7n1f4 ns:film.film.directed_by ?x0 .\nns:m.0w7n1f4 ns:film.film.executive_produced_by ns:m.0k78q_ .\nns:m.0w7n1f4 ns:film.film.executive_produced_by ns:m.0k78r6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 226234,
    "questionWithBrackets": "Who was a Dutch film director whose spouse wrote [Mis\u00e8re au Borinage] and edited [Songs of Heroes]",
    "questionPatternModEntities": "Who was a Dutch film director whose spouse wrote M4 and edited M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.editor.film ns:m.0j5ygwz .\n?x1 ns:film.writer.film ns:m.07kg9ww .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\n?x1 P3 M4 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Helen van Dongen",
    "recursionDepth": 38
  },
  {
    "questionIdx": 24236,
    "questionWithBrackets": "Did [Valeria Golino] marry [Andrea Di Stefano] and [Fabrizio Bentivoglio] and marry a film's Italian director",
    "questionPatternModEntities": "Did M2 marry M3 and M4 and marry a film 's Italian director",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ?x1 .\n?x0 ns:people.person.nationality ns:m.03rjj .\n?x1 a ns:film.film .\nFILTER ( ns:m.06x4nd != ?x0 ) .\nFILTER ( ns:m.06x4nd != ns:m.02x0lh_ ) .\nFILTER ( ns:m.06x4nd != ns:m.0d22w7 ) .\nns:m.06x4nd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.06x4nd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.02x0lh_ .\nns:m.06x4nd ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0d22w7\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M3 ) .\nFILTER ( M2 != M4 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 10214,
    "questionWithBrackets": "Did [Indian Premier League] and [Dreamz Unlimited] employ a film producer that [Aatank Hi Aatank] starred and [Kabhi Haan Kabhi Naa] starred",
    "questionPatternModEntities": "Did M3 and M4 employ a film producer that M1 starred and M2 starred",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.07l415 .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0ffvrt .\nns:m.03b_lm1 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.043m_x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nM3 P1 ?x0 .\nM4 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 45455,
    "questionWithBrackets": "Was [Amy Irving] a person whose spouse directed [War of the Worlds] and executive produced [Harry and the Hendersons] and [Batteries Not Included]",
    "questionPatternModEntities": "Was M3 a person whose spouse directed M2 and executive produced M0 and M1",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.02mmwk .\n?x0 ns:film.producer.films_executive_produced ns:m.06gvqz .\n?x0 ns:film.producer.films_executive_produced ns:m.09zn92 .\nFILTER ( ns:m.030h95 != ?x0 ) .\nns:m.030h95 a ns:people.person .\nns:m.030h95 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 M2 .\nFILTER ( M3 != ?x0 ) .\nM3 P2 ?x0 .\nM3 a M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 52812,
    "questionWithBrackets": "Was [Don Hopkins] influenced by a screenwriter's spouse's sibling and influenced by [Hayao Miyazaki] and [Buddy Holly]",
    "questionPatternModEntities": "Was M1 influenced by a screenwriter 's spouse 's sibling and influenced by M2 and M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nns:m.04jvqg ns:influence.influence_node.influenced_by ?x0 .\nns:m.04jvqg ns:influence.influence_node.influenced_by ns:m.01vs_yt .\nns:m.04jvqg ns:influence.influence_node.influenced_by ns:m.0534v\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  },
  {
    "questionIdx": 70468,
    "questionWithBrackets": "Was [Paisan] directed by, produced by, and written by an Italian screenwriter's spouse",
    "questionPatternModEntities": "Was M2 directed by , produced by , and written by a Italian screenwriter 's spouse",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ?x0 != ?x1 ) .\nns:m.02pmn09 ns:film.film.directed_by ?x0 .\nns:m.02pmn09 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.02pmn09 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 213850,
    "questionWithBrackets": "Who did [Brandi Milbradt] marry, [Alan Moore] influence, and a Japanese film editor influence",
    "questionPatternModEntities": "Who did M2 marry , M1 influence , and a Japanese film editor influence",
    "questionTemplate": "Who did [entity] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0yxl .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.04nm39j .\n?x1 a ns:film.editor .\n?x1 ns:people.person.nationality ns:m.03_3d .\nFILTER ( ?x0 != ns:m.04nm39j )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M4 .\n?x1 a M3 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Darren Aronofsky",
    "recursionDepth": 38
  },
  {
    "questionIdx": 225189,
    "questionWithBrackets": "Who was a British screenwriter that was influenced by and influenced [Digital Village, The]'s employee",
    "questionPatternModEntities": "Who was a British screenwriter that was influenced by and influenced M3 's employee",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that was [VP_SIMPLE] by and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.012_vh\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P3 M3\n}",
    "expectedResponse": "Richard Dawkins; Neil Gaiman",
    "recursionDepth": 38
  },
  {
    "questionIdx": 215451,
    "questionWithBrackets": "Who did a French person whose spouse influenced and married [Jacques Demy] marry",
    "questionPatternModEntities": "Who did a French person whose spouse influenced and married M2 marry",
    "questionTemplate": "Who did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:people.person .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 ns:influence.influence_node.influenced ns:m.046dxx .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.046dxx .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != ns:m.046dxx )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P0 ?x2 .\n?x1 P1 M1 .\n?x1 a M0 .\n?x2 P0 M2 .\n?x2 P2 M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ?x2 ) .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "Agn\u00e8s Varda; Chantal Darget",
    "recursionDepth": 38
  },
  {
    "questionIdx": 133770,
    "questionWithBrackets": "What Italian costume designer was a film director that [Promises Written in Water] was executive produced by and starred",
    "questionPatternModEntities": "What Italian costume designer was a film director that M2 was executive produced by and starred",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] was a [NP_SIMPLE] that [entity] was [VP_SIMPLE] by and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.director .\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0bh9qf1 .\n?x0 ns:film.producer.films_executive_produced ns:m.0bh9qf1 .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Vincent Gallo",
    "recursionDepth": 38
  },
  {
    "questionIdx": 68407,
    "questionWithBrackets": "Was [Muse Watson] a male person that played [Jerimiah Shuman] and played a film",
    "questionPatternModEntities": "Was M1 a male person that played M3 and played a film",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.032kpr a ns:people.person .\nns:m.032kpr ns:film.actor.film/ns:film.performance.character ?x0 .\nns:m.032kpr ns:film.actor.film/ns:film.performance.character ns:m.0q5bkz4 .\nns:m.032kpr ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P0 M3 .\nM1 P1 M4 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 38
  },
  {
    "questionIdx": 144793,
    "questionWithBrackets": "What did [Le Naufrag\u00e9]'s writer produce and [The French Minister]'s French star's sibling produce",
    "questionPatternModEntities": "What did M2 's writer produce and M1 's French star 's sibling produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x3 .\n?x2 ns:film.writer.film ns:m.0_f3rjc .\n?x3 ns:film.actor.film/ns:film.performance.film ns:m.0wxsyyt .\n?x3 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ?x1 != ?x3 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 P1 ?x3 .\n?x2 P2 M2 .\n?x3 P3 M0 .\n?x3 P4 M1 .\nFILTER ( ?x1 != ?x3 )\n}",
    "expectedResponse": "Le Naufrag\u00e9; A World Without Women",
    "recursionDepth": 38
  },
  {
    "questionIdx": 18682,
    "questionWithBrackets": "Did [Saludos Amigos] star a production company's parent's founder and employee and star [Clarence Nash]",
    "questionPatternModEntities": "Did M1 star a production company 's parent 's founder and employee and star M2",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.production_company .\nns:m.0k5j9 ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0k5j9 ns:film.film.starring/ns:film.performance.actor ns:m.0phh6\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x2 a M0 .\nM1 P3 ?x0 .\nM1 P3 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 38
  }
]