[
  {
    "questionIdx": 112428,
    "questionWithBrackets": "Were [Animator vs Animation 2] and [Taprobana] produced by, written by, executive produced by, directed by, and edited by an actor",
    "questionPatternModEntities": "Were M1 and M2 produced by , written by , executive produced by , directed by , and edited by a actor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\nns:m.0107y6nl ns:film.film.directed_by ?x0 .\nns:m.0107y6nl ns:film.film.edited_by ?x0 .\nns:m.0107y6nl ns:film.film.executive_produced_by ?x0 .\nns:m.0107y6nl ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0107y6nl ns:film.film.written_by ?x0 .\nns:m.0108mkjq ns:film.film.directed_by ?x0 .\nns:m.0108mkjq ns:film.film.edited_by ?x0 .\nns:m.0108mkjq ns:film.film.executive_produced_by ?x0 .\nns:m.0108mkjq ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0108mkjq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 46
  },
  {
    "questionIdx": 116082,
    "questionWithBrackets": "Were [DreamWorks Studios] and [DreamWorks Animation] founded by [David Geffen], founded by a director of [Amazing Stories: Book One] and [Catch Me If You Can], and founded by [Jeffrey Katzenberg]",
    "questionPatternModEntities": "Were M2 and M5 founded by M3 , founded by a director of M0 and M1 , and founded by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity] and [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.01flv_ .\n?x0 ns:film.director.film ns:m.02ww_d1 .\nns:m.01gb54 ns:organization.organization.founders ?x0 .\nns:m.01gb54 ns:organization.organization.founders ns:m.01vhrz .\nns:m.01gb54 ns:organization.organization.founders ns:m.02rq9n .\nns:m.056ws9 ns:organization.organization.founders ?x0 .\nns:m.056ws9 ns:organization.organization.founders ns:m.01vhrz .\nns:m.056ws9 ns:organization.organization.founders ns:m.02rq9n\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P1 M3 .\nM2 P1 M4 .\nM5 P1 ?x0 .\nM5 P1 M3 .\nM5 P1 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 46
  },
  {
    "questionIdx": 181993,
    "questionWithBrackets": "What was produced by a Japanese costume designer, edited by a person, and written by [Anne-Marie Mackay] and [Michel Comte]",
    "questionPatternModEntities": "What was produced by a Japanese costume designer , edited by a person , and written by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x0 ns:film.film.written_by ns:m.0bnthf0 .\n?x0 ns:film.film.written_by ns:m.0h22dgg .\n?x1 a ns:people.person .\n?x2 a ns:film.film_costumer_designer .\n?x2 ns:people.person.nationality ns:m.03_3d\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x2 .\n?x1 P3 M3 .\n?x1 a M2 .\n?x2 a M4\n}",
    "expectedResponse": "The Girl from Nagasaki",
    "recursionDepth": 46
  },
  {
    "questionIdx": 147391,
    "questionWithBrackets": "What did [The Miners' Hymns]'s writer and editor edit, produce, direct, write, and executive produce",
    "questionPatternModEntities": "What did M0 's writer and editor edit , produce , direct , write , and executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.0gkg41j .\n?x1 ns:film.writer.film ns:m.0gkg41j\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Just Ancient Loops",
    "recursionDepth": 46
  },
  {
    "questionIdx": 41221,
    "questionWithBrackets": "Did an actor influenced by [Albert Camus] and influenced by [Rainer Maria Rilke] influence and marry [Sylvie Le Bon-de Beauvoir]'s parent",
    "questionPatternModEntities": "Did a actor influenced by M1 and influenced by M2 influence and marry M3 's parent",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.06l0f .\n?x0 ns:influence.influence_node.influenced_by ns:m.0lcx .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.03mf5g2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 46
  },
  {
    "questionIdx": 17172,
    "questionWithBrackets": "Did [Princeton University] employ [Banesh Hoffmann] and [Lisa Randall], employ a cinematographer and executive producer of [Black Bareback Riders 4], and employ [Gigliola Staffilani]",
    "questionPatternModEntities": "Did M1 employ M2 and M3 , employ a cinematographer and executive producer of M0 , and employ M4",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [entity] , [VP_SIMPLE] a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ns:m.063tqk8 .\n?x0 ns:film.producer.films_executive_produced ns:m.063tqk8 .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.031mp0 .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.09r8d1 .\nns:m.05zl0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0fpphbt\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM1 P2 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 46
  },
  {
    "questionIdx": 144653,
    "questionWithBrackets": "What did [Kinefaktura]'s art director and writer produce, executive produce, edit, direct, and write",
    "questionPatternModEntities": "What did M0 's art director and writer produce , executive produce , edit , direct , and write",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0vsh_8l .\n?x1 ns:film.writer.film ns:m.0vsh_8l\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "FFF1",
    "recursionDepth": 46
  },
  {
    "questionIdx": 145996,
    "questionWithBrackets": "What did [Rangga Maya Barack-Evans] and [Robin Cowie] executive produce, a British screenwriter edit, and a film editor edit",
    "questionPatternModEntities": "What did M0 and M1 executive produce , a British screenwriter edit , and a film editor edit",
    "questionTemplate": "What did [entity] and [entity] [VP_SIMPLE] , a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] , and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.edited_by ?x2 .\n?x0 ns:film.film.executive_produced_by ns:m.0b69svf .\n?x0 ns:film.film.executive_produced_by ns:m.0hls1rq .\n?x1 a ns:film.writer .\n?x1 ns:people.person.nationality ns:m.07ssc .\n?x2 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 ?x2 .\n?x1 P2 M3 .\n?x1 a M2 .\n?x2 a M4\n}",
    "expectedResponse": "V/H/S/2",
    "recursionDepth": 46
  },
  {
    "questionIdx": 123381,
    "questionWithBrackets": "Were [Rick's Canoe] and [It's Not About the Shawerma] edited, directed, executive produced, written, and produced by a film's director",
    "questionPatternModEntities": "Were M1 and M2 edited , directed , executive produced , written , and produced by a film 's director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ?x1 .\n?x1 a ns:film.film .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0 .\nns:m.0zztylq ns:film.film.directed_by ?x0 .\nns:m.0zztylq ns:film.film.edited_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zztylq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 46
  },
  {
    "questionIdx": 113249,
    "questionWithBrackets": "Were [Beck \u2013 Den svaga l\u00e4nken] and [Beck \u2013 Advokaten] edited by [Closet Cases of the Nerd Kind]'s editor, executive produced by [\u00c5sa Sj\u00f6berg], and executive produced by [Niva Westlin Dahl] and [B\u00f6rje Hansson]",
    "questionPatternModEntities": "Were M1 and M5 edited by M0 's editor , executive produced by M2 , and executive produced by M3 and M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0blbpl .\nns:m.06zkfq5 ns:film.film.edited_by ?x0 .\nns:m.06zkfq5 ns:film.film.executive_produced_by ns:m.0j3q6js .\nns:m.06zkfq5 ns:film.film.executive_produced_by ns:m.0tk9tbd .\nns:m.06zkfq5 ns:film.film.executive_produced_by ns:m.0y7nr8b .\nns:m.06zsf3m ns:film.film.edited_by ?x0 .\nns:m.06zsf3m ns:film.film.executive_produced_by ns:m.0j3q6js .\nns:m.06zsf3m ns:film.film.executive_produced_by ns:m.0tk9tbd .\nns:m.06zsf3m ns:film.film.executive_produced_by ns:m.0y7nr8b\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P1 M4 .\nM1 P2 ?x0 .\nM5 P1 M2 .\nM5 P1 M3 .\nM5 P1 M4 .\nM5 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 46
  },
  {
    "questionIdx": 174398,
    "questionWithBrackets": "What was edited by a film's writer, producer, cinematographer, and costume designer and written by [Herv\u00e9-Pierre Gustave] and [Thomas Wallon]",
    "questionPatternModEntities": "What was edited by a film 's writer , producer , cinematographer , and costume designer and written by M0 and M1",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0kfb9td .\n?x0 ns:film.film.written_by ns:m.0pz72ms .\n?x1 ns:film.cinematographer.film ?x2 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x1 ns:film.writer.film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x1 P4 ?x2 .\n?x1 P5 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Hip Moves",
    "recursionDepth": 46
  },
  {
    "questionIdx": 182239,
    "questionWithBrackets": "What was produced by a film director's sibling's spouse, written by [Charlotte and Her Boyfriend]'s editor, and directed by [Luigi Comencini]",
    "questionPatternModEntities": "What was produced by a film director 's sibling 's spouse , written by M1 's editor , and directed by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ns:m.02qg0gn .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x2 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x2 ns:film.editor.film ns:m.0bfx8h .\n?x3 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x4 .\n?x4 a ns:film.director .\nFILTER ( ?x1 != ?x3 ) .\nFILTER ( ?x3 != ?x4 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P2 M0 .\n?x1 P3 M1 .\n?x2 P4 ?x3 .\n?x3 P5 ?x4 .\n?x4 a M2 .\nFILTER ( ?x2 != ?x3 ) .\nFILTER ( ?x3 != ?x4 )\n}",
    "expectedResponse": "The French as Seen By...",
    "recursionDepth": 46
  },
  {
    "questionIdx": 159384,
    "questionWithBrackets": "What film whose cinematographer and star executive produced [Freedom's Fury] and [Killing Zoe] did [Gaiam Vivendi Entertainment] distribute and [The Weinstein Company] distribute",
    "questionPatternModEntities": "What film whose cinematographer and star executive produced M3 and M4 did M1 distribute and M2 distribute",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity] did [entity] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.cinematography ?x1 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.061dn_ .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.080cdty .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.030xp1 .\n?x1 ns:film.producer.films_executive_produced ns:m.0bwkmrt\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P1 M2 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 P3 M3 .\n?x1 P3 M4\n}",
    "expectedResponse": "Grindhouse",
    "recursionDepth": 46
  },
  {
    "questionIdx": 143643,
    "questionWithBrackets": "What did [Goat Story 2]'s editor and art director edit, direct, write, executive produce, and produce",
    "questionPatternModEntities": "What did M0 's editor and art director edit , direct , write , executive produce , and produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.0nbtt_1 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0nbtt_1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Goat Story",
    "recursionDepth": 46
  },
  {
    "questionIdx": 113368,
    "questionWithBrackets": "Were [Bella Loves Jenna] and [Krystal Method] directed by an art director, editor, and star of [Kurulus] and executive produced by a film director",
    "questionPatternModEntities": "Were M2 and M3 directed by a art director , editor , and star of M1 and executive produced by a film director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0vmvxy4 .\n?x1 ns:film.editor.film ns:m.0vmvxy4 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0vmvxy4 .\nns:m.05wv_m1 ns:film.film.directed_by ?x1 .\nns:m.05wv_m1 ns:film.film.executive_produced_by ?x0 .\nns:m.0w15yfn ns:film.film.directed_by ?x1 .\nns:m.0w15yfn ns:film.film.executive_produced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M1 .\n?x1 P1 M1 .\n?x1 P2 M1 .\nM2 P3 ?x0 .\nM2 P4 ?x1 .\nM3 P3 ?x0 .\nM3 P4 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 46
  },
  {
    "questionIdx": 55234,
    "questionWithBrackets": "Was [Flywheel] executive produced by, written by, directed by, edited by, and produced by a company's founder",
    "questionPatternModEntities": "Was M1 executive produced by , written by , directed by , edited by , and produced by a company 's founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x1 a ns:business.employer .\nns:m.0kvgt0 ns:film.film.directed_by ?x0 .\nns:m.0kvgt0 ns:film.film.edited_by ?x0 .\nns:m.0kvgt0 ns:film.film.executive_produced_by ?x0 .\nns:m.0kvgt0 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0kvgt0 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 46
  },
  {
    "questionIdx": 142517,
    "questionWithBrackets": "What did [Carancho]'s star and director produce, edit, write, executive produce, and direct",
    "questionPatternModEntities": "What did M0 's star and director produce , edit , write , executive produce , and direct",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0bv8qsf .\n?x1 ns:film.director.film ns:m.0bv8qsf\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "White Elephant",
    "recursionDepth": 46
  },
  {
    "questionIdx": 57153,
    "questionWithBrackets": "Was [Gorgeous] produced by a film's sequel's art director, written by [Troublesome Night 3]'s star, and written by [Yiu Fai Lo]",
    "questionPatternModEntities": "Was M2 produced by a film 's sequel 's art director , written by M0 's star , and written by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0b6kpxt .\n?x1 ns:film.film_art_director.films_art_directed ?x2 .\n?x2 ns:film.film.prequel ?x3 .\n?x3 a ns:film.film .\nns:m.03r2rh ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\nns:m.03r2rh ns:film.film.written_by ?x0 .\nns:m.03r2rh ns:film.film.written_by ns:m.0jxln4\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x2 P2 ?x3 .\n?x3 a M1 .\nM2 P3 ?x0 .\nM2 P3 M3 .\nM2 P4 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 137056,
    "questionWithBrackets": "What actor whose sibling executive produced [Luck by Chance] and wrote [Talaash] founded and was employed by [Excel Entertainment]",
    "questionPatternModEntities": "What actor whose sibling executive produced M3 and wrote M2 founded and was employed by M1",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] [VP_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.03cm8f6 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.03cm8f6 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.producer.films_executive_produced ns:m.0kvfhx .\n?x1 ns:film.writer.film ns:m.0gx3rq1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P2 M1 .\n?x0 a M0 .\n?x1 P3 M2 .\n?x1 P4 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Farhan Akhtar",
    "recursionDepth": 47
  },
  {
    "questionIdx": 4428,
    "questionWithBrackets": "Did [Columbia University] employ [Anthony Burgess], employ an art director, and employ [Lauder William Jones]'s employer's Chinese employee",
    "questionPatternModEntities": "Did M3 employ M4 , employ a art director , and employ M1 's employer 's Chinese employee",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] a [NP_SIMPLE] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03ckwmq .\n?x2 a ns:film.film_art_director .\nns:m.01w5m ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.01w5m ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\nns:m.01w5m ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0d4jl\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x2 a M2 .\nM3 P2 ?x0 .\nM3 P2 ?x2 .\nM3 P2 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 115864,
    "questionWithBrackets": "Were [Don't Give Up on Us] and [For The First Time] executive produced by [Cesar Concio]'s female spouse, directed by [Wenn V. Deramas], and executive produced by [Malou N. Santos]",
    "questionPatternModEntities": "Were M2 and M5 executive produced by M1 's female spouse , directed by M4 , and executive produced by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0hnjrz3 .\nFILTER ( ?x0 != ns:m.0hnjrz3 ) .\nns:m.0288xlr ns:film.film.directed_by ns:m.07kbxg8 .\nns:m.0288xlr ns:film.film.executive_produced_by ?x0 .\nns:m.0288xlr ns:film.film.executive_produced_by ns:m.0bffb2d .\nns:m.04gtq5h ns:film.film.directed_by ns:m.07kbxg8 .\nns:m.04gtq5h ns:film.film.executive_produced_by ?x0 .\nns:m.04gtq5h ns:film.film.executive_produced_by ns:m.0bffb2d\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P3 M4 .\nM5 P2 ?x0 .\nM5 P2 M3 .\nM5 P3 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  },
  {
    "questionIdx": 129799,
    "questionWithBrackets": "Were [White Stork Is Coming] and [Rick's Canoe] written by, edited by, directed by, executive produced by, and produced by [The Higden Man]'s editor",
    "questionPatternModEntities": "Were M1 and M2 written by , edited by , directed by , executive produced by , and produced by M0 's editor",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0_g0qr6 .\nns:m.0zvz2b2 ns:film.film.directed_by ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.written_by ?x0 .\nns:m.0zxyz5j ns:film.film.directed_by ?x0 .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.executive_produced_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zxyz5j ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 183781,
    "questionWithBrackets": "What was produced, written, executive produced, directed, and edited by [The Brown Bunny]'s costume designer, cinematographer, and producer",
    "questionPatternModEntities": "What was produced , written , executive produced , directed , and edited by M0 's costume designer , cinematographer , and producer",
    "questionTemplate": "What was [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0 .\n?x1 P7 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 47
  },
  {
    "questionIdx": 107512,
    "questionWithBrackets": "Was an American person that married [Mrs. Kalman]'s actor and influenced a Japanese cinematographer [David Lynch]",
    "questionPatternModEntities": "Was a American person that married M2 's actor and influenced a Japanese cinematographer M3",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x1 ns:film.actor.film/ns:film.performance.character ns:m.0gz5ly_ .\nFILTER ( ns:m.026dx != ?x1 ) .\nns:m.026dx a ns:people.person .\nns:m.026dx ns:influence.influence_node.influenced ?x0 .\nns:m.026dx ns:people.person.nationality ns:m.09c7w0 .\nns:m.026dx ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\nFILTER ( M3 != ?x1 ) .\nM3 P0 M5 .\nM3 P2 ?x0 .\nM3 P3 ?x1 .\nM3 a M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 126391,
    "questionWithBrackets": "Were [The Fifth Wall] and [It's Not About the Shawerma] executive produced by, produced by, directed by, written by, and edited by [Anatomie des Weggehens]'s writer",
    "questionPatternModEntities": "Were M1 and M2 executive produced by , produced by , directed by , written by , and edited by M0 's writer",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.writer.film ns:m.0xn160y .\nns:m.0_2zrgs ns:film.film.directed_by ?x0 .\nns:m.0_2zrgs ns:film.film.edited_by ?x0 .\nns:m.0_2zrgs ns:film.film.executive_produced_by ?x0 .\nns:m.0_2zrgs ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0_2zrgs ns:film.film.written_by ?x0 .\nns:m.0zztylq ns:film.film.directed_by ?x0 .\nns:m.0zztylq ns:film.film.edited_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zztylq ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  }
]