[
  {
    "questionIdx": 181708,
    "questionWithBrackets": "What was produced by [South from Granada]'s female executive producer's Spanish spouse and produced by a costume designer's sibling",
    "questionPatternModEntities": "What was produced by M1 's female executive producer 's Spanish spouse and produced by a costume designer 's sibling",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:people.person.nationality ns:m.06mkj .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x3 .\n?x2 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x4 .\n?x3 ns:film.producer.films_executive_produced ns:m.02z31k3 .\n?x3 ns:people.person.gender ns:m.02zsn .\n?x4 a ns:film.film_costumer_designer .\nFILTER ( ?x1 != ?x3 ) .\nFILTER ( ?x2 != ?x4 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 P1 M0 .\n?x1 P2 ?x3 .\n?x2 P3 ?x4 .\n?x3 P4 M1 .\n?x3 P5 M2 .\n?x4 a M3 .\nFILTER ( ?x1 != ?x3 ) .\nFILTER ( ?x2 != ?x4 )\n}",
    "expectedResponse": "La vida alegre",
    "recursionDepth": 47
  },
  {
    "questionIdx": 122664,
    "questionWithBrackets": "Were [Planet Terror] and [Harmonica's Howl] edited by a cinematographer and star of [Road To Ythaca], edited by [Guto Parente], and produced by [Rita Toledo]",
    "questionPatternModEntities": "Were M1 and M4 edited by a cinematographer and star of M0 , edited by M3 , and produced by M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0g4trsz .\n?x0 ns:film.cinematographer.film ns:m.0g4trsz .\nns:m.03bxrfz ns:film.film.edited_by ?x0 .\nns:m.03bxrfz ns:film.film.edited_by ns:m.0g4trt7 .\nns:m.03bxrfz ns:film.film.produced_by|ns:film.film.production_companies ns:m.07469m5 .\nns:m.0rh87h_ ns:film.film.edited_by ?x0 .\nns:m.0rh87h_ ns:film.film.edited_by ns:m.0g4trt7 .\nns:m.0rh87h_ ns:film.film.produced_by|ns:film.film.production_companies ns:m.07469m5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 M2 .\nM1 P3 ?x0 .\nM1 P3 M3 .\nM4 P2 M2 .\nM4 P3 ?x0 .\nM4 P3 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  },
  {
    "questionIdx": 178832,
    "questionWithBrackets": "What was executive produced by, produced by, written by, edited by, and directed by [The Brown Bunny]'s editor and costume designer",
    "questionPatternModEntities": "What was executive produced by , produced by , written by , edited by , and directed by M0 's editor and costume designer",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Promises Written in Water",
    "recursionDepth": 47
  },
  {
    "questionIdx": 52318,
    "questionWithBrackets": "Was [Derek Wayne Johnson] influenced by a film's star and costume designer, influenced by [John Huston], and influenced by a costume designer",
    "questionPatternModEntities": "Was M2 influenced by a film 's star and costume designer , influenced by M3 , and influenced by a costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x2 a ns:film.film .\nns:m.0v9clzh ns:influence.influence_node.influenced_by ?x0 .\nns:m.0v9clzh ns:influence.influence_node.influenced_by ?x1 .\nns:m.0v9clzh ns:influence.influence_node.influenced_by ns:m.0c12h\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 ?x2 .\n?x1 P1 ?x2 .\n?x2 a M1 .\nM2 P2 ?x0 .\nM2 P2 ?x1 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  },
  {
    "questionIdx": 186003,
    "questionWithBrackets": "What was written by, edited by, directed by, executive produced by, and produced by [Far West: A True Western]'s art director and director",
    "questionPatternModEntities": "What was written by , edited by , directed by , executive produced by , and produced by M0 's art director and director",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.director.film ns:m.0107hywx .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0107hywx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Viagem na Chuva",
    "recursionDepth": 47
  },
  {
    "questionIdx": 16244,
    "questionWithBrackets": "Did [Osmosis Jones] star [Ben Stein], star [Head of State]'s director and star, and star a film producer's founder",
    "questionPatternModEntities": "Did M2 star M3 , star M0 's director and star , and star a film producer 's founder",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , and [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.039lgd .\n?x0 ns:film.director.film ns:m.039lgd .\n?x1 ns:organization.organization_founder.organizations_founded ?x2 .\n?x2 a ns:film.producer .\nns:m.0dqwvw ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0dqwvw ns:film.film.starring/ns:film.performance.actor ?x1 .\nns:m.0dqwvw ns:film.film.starring/ns:film.performance.actor ns:m.01n1gc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1 .\nM2 P3 ?x0 .\nM2 P3 ?x1 .\nM2 P3 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 116684,
    "questionWithBrackets": "Were [Fighting Elegy], [It's Not About the Shawerma], [Blues for the Avatar], [White Stork Is Coming], and [Rick's Canoe] edited by, produced by, and executive produced by an actor's parent",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 edited by , produced by , and executive produced by a actor 's parent",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x1 a ns:film.actor .\nns:m.09sgzr ns:film.film.edited_by ?x0 .\nns:m.09sgzr ns:film.film.executive_produced_by ?x0 .\nns:m.09sgzr ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0znn7j_ ns:film.film.edited_by ?x0 .\nns:m.0znn7j_ ns:film.film.executive_produced_by ?x0 .\nns:m.0znn7j_ ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zvz2b2 ns:film.film.edited_by ?x0 .\nns:m.0zvz2b2 ns:film.film.executive_produced_by ?x0 .\nns:m.0zvz2b2 ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zxyz5j ns:film.film.edited_by ?x0 .\nns:m.0zxyz5j ns:film.film.executive_produced_by ?x0 .\nns:m.0zxyz5j ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0zztylq ns:film.film.edited_by ?x0 .\nns:m.0zztylq ns:film.film.executive_produced_by ?x0 .\nns:m.0zztylq ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM3 P1 ?x0 .\nM3 P2 ?x0 .\nM3 P3 ?x0 .\nM4 P1 ?x0 .\nM4 P2 ?x0 .\nM4 P3 ?x0 .\nM5 P1 ?x0 .\nM5 P2 ?x0 .\nM5 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  },
  {
    "questionIdx": 184754,
    "questionWithBrackets": "What was written by [Raining in the Mountain]'s writer, executive producer, and art director, directed by a film director, and produced by [Run Run Shaw]",
    "questionPatternModEntities": "What was written by M1 's writer , executive producer , and art director , directed by a film director , and produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ns:m.01d_fv .\n?x0 ns:film.film.written_by ?x2 .\n?x1 a ns:film.director .\n?x2 ns:film.film_art_director.films_art_directed ns:m.02q6mzs .\n?x2 ns:film.producer.films_executive_produced ns:m.02q6mzs .\n?x2 ns:film.writer.film ns:m.02q6mzs\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x2 .\n?x1 P3 M1 .\n?x1 P4 M1 .\n?x1 P5 M1 .\n?x2 a M2\n}",
    "expectedResponse": "Come Drink with Me",
    "recursionDepth": 47
  },
  {
    "questionIdx": 171358,
    "questionWithBrackets": "What was directed by, edited by, produced by, executive produced by, and written by [Methel Island]'s executive producer and editor",
    "questionPatternModEntities": "What was directed by , edited by , produced by , executive produced by , and written by M0 's executive producer and editor",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.editor.film ns:m.0_skg56 .\n?x1 ns:film.producer.films_executive_produced ns:m.0_skg56\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P6 M0\n}",
    "expectedResponse": "Methel Island; Gender Games",
    "recursionDepth": 47
  },
  {
    "questionIdx": 151035,
    "questionWithBrackets": "What did a writer of [Samad Goes to the City] and [Maslakh] produce, write, edit, direct, and executive produce",
    "questionPatternModEntities": "What did a writer of M0 and M1 produce , write , edit , direct , and executive produce",
    "questionTemplate": "What did a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.writer.film ns:g.12qhk7m8r .\n?x1 ns:film.writer.film ns:g.12qhkd1dp\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 P3 ?x1 .\n?x0 P4 ?x1 .\n?x1 P5 M0 .\n?x1 P5 M1\n}",
    "expectedResponse": "Samad dar rah ejdeha",
    "recursionDepth": 47
  },
  {
    "questionIdx": 235615,
    "questionWithBrackets": "Who was influenced by [Chaz Bufe] and [Sarah Vowell], influenced by a film editor, and influenced by [Studio Ghibli]'s founder and employee",
    "questionPatternModEntities": "Who was influenced by M1 and M2 , influenced by a film editor , and influenced by M3 's founder and employee",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.02mwnp .\n?x0 ns:influence.influence_node.influenced_by ns:m.0586l6 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.0130kc .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0130kc .\n?x2 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M3 .\n?x2 a M4\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 47
  },
  {
    "questionIdx": 218045,
    "questionWithBrackets": "Who influenced [Busboy Productions]'s male founder, was influenced by [Robert Benchley], and was influenced by [The Touch]'s director",
    "questionPatternModEntities": "Who influenced M2 's male founder , was influenced by M1 , and was influenced by M4 's director",
    "questionTemplate": "Who [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x0 ns:influence.influence_node.influenced_by ns:m.03gph9 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.08jsny .\n?x1 ns:people.person.gender ns:m.05zppz .\n?x2 ns:film.director.film ns:m.05tt3_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3 .\n?x2 P4 M4\n}",
    "expectedResponse": "Woody Allen",
    "recursionDepth": 47
  },
  {
    "questionIdx": 127458,
    "questionWithBrackets": "Were [The Matrix] and [Speed Racer] produced by [Silver Pictures], written by a female executive producer of [Bound], and directed by [Andy Wachowski]",
    "questionPatternModEntities": "Were M2 and M5 produced by M3 , written by a female executive producer of M0 , and directed by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.01l25p .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.027gy0k ns:film.film.directed_by ns:m.03nzd5h .\nns:m.027gy0k ns:film.film.produced_by|ns:film.film.production_companies ns:m.05h4t7 .\nns:m.027gy0k ns:film.film.written_by ?x0 .\nns:m.07cz2 ns:film.film.directed_by ns:m.03nzd5h .\nns:m.07cz2 ns:film.film.produced_by|ns:film.film.production_companies ns:m.05h4t7 .\nns:m.07cz2 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 M3 .\nM2 P4 M4 .\nM5 P2 ?x0 .\nM5 P3 M3 .\nM5 P4 M4\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 47
  },
  {
    "questionIdx": 220864,
    "questionWithBrackets": "Who married [Sarah Parkinson], was influenced by [Buster Keaton], and was influenced by [The Gold Rush]'s producer, writer, and star",
    "questionPatternModEntities": "Who married M2 , was influenced by M1 , and was influenced by M3 's producer , writer , and star",
    "questionTemplate": "Who [VP_SIMPLE] [entity] , was [VP_SIMPLE] by [entity] , and was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0btj0 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0288p4q .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.0jsfp .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0jsfp .\n?x1 ns:film.writer.film ns:m.0jsfp .\nFILTER ( ?x0 != ns:m.0288p4q )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Paul Merton",
    "recursionDepth": 47
  },
  {
    "questionIdx": 122344,
    "questionWithBrackets": "Were [PT Golden Energy Mines] and [Apple Corps] founded by [Paul McCartney], founded by a film's cinematographer, and founded by [John Lennon] and [George Harrison]",
    "questionPatternModEntities": "Were M1 and M5 founded by M2 , founded by a film 's cinematographer , and founded by M3 and M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , and [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.cinematographer.film ?x1 .\n?x1 a ns:film.film .\nns:m.02_7z_ ns:organization.organization.founders ?x0 .\nns:m.02_7z_ ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.02_7z_ ns:organization.organization.founders ns:m.03bnv .\nns:m.02_7z_ ns:organization.organization.founders ns:m.03j24kf .\nns:m.0gtpjxs ns:organization.organization.founders ?x0 .\nns:m.0gtpjxs ns:organization.organization.founders ns:m.01vsl3_ .\nns:m.0gtpjxs ns:organization.organization.founders ns:m.03bnv .\nns:m.0gtpjxs ns:organization.organization.founders ns:m.03j24kf\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 a M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P1 M3 .\nM1 P1 M4 .\nM5 P1 ?x0 .\nM5 P1 M2 .\nM5 P1 M3 .\nM5 P1 M4\n}",
    "expectedResponse": "No",
    "recursionDepth": 47
  },
  {
    "questionIdx": 176649,
    "questionWithBrackets": "What was executive produced by [Jeff Sackman] and [Michael Paseornek] and directed by a film's costume designer, star, producer, and art director",
    "questionPatternModEntities": "What was executive produced by M0 and M1 and directed by a film 's costume designer , star , producer , and art director",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0jtw4c .\n?x0 ns:film.film.executive_produced_by ns:m.0jz4vz .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.film_art_director.films_art_directed ?x2 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 ?x2 .\n?x1 P3 ?x2 .\n?x1 P4 ?x2 .\n?x1 P5 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Buffalo '66",
    "recursionDepth": 47
  },
  {
    "questionIdx": 125431,
    "questionWithBrackets": "Were [Temporary Release] and [Frihed p\u00e5 pr\u00f8ve.(2010)] edited by a costume designer that [Vibeke Winding] married, written by [Erik Clausen], and produced by [Peter Ingemann]",
    "questionPatternModEntities": "Were M2 and M5 edited by a costume designer that M1 married , written by M3 , and produced by M4",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [entity] [VP_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_costumer_designer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j48d86 .\nFILTER ( ?x0 != ns:m.0j48d86 ) .\nns:m.09jyt90 ns:film.film.edited_by ?x0 .\nns:m.09jyt90 ns:film.film.produced_by|ns:film.film.production_companies ns:m.09gqy1_ .\nns:m.09jyt90 ns:film.film.written_by ns:m.09fc2zg .\nns:m.09jyt93 ns:film.film.edited_by ?x0 .\nns:m.09jyt93 ns:film.film.produced_by|ns:film.film.production_companies ns:m.09gqy1_ .\nns:m.09jyt93 ns:film.film.written_by ns:m.09fc2zg\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( ?x0 != M1 ) .\nM2 P1 M3 .\nM2 P2 M4 .\nM2 P3 ?x0 .\nM5 P1 M3 .\nM5 P2 M4 .\nM5 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 82453,
    "questionWithBrackets": "Was [The Silence of the Sea] written by, produced by, edited by, executive produced by, and directed by [Un flic]'s French director",
    "questionPatternModEntities": "Was M2 written by , produced by , edited by , executive produced by , and directed by M1 's French director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0b1lwc .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0bgspt ns:film.film.directed_by ?x0 .\nns:m.0bgspt ns:film.film.edited_by ?x0 .\nns:m.0bgspt ns:film.film.executive_produced_by ?x0 .\nns:m.0bgspt ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bgspt ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0 .\nM2 P6 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 56975,
    "questionWithBrackets": "Was [Goat Story] executive produced by, written by, directed by, edited by, and produced by [Goat Story 2]'s art director and editor",
    "questionPatternModEntities": "Was M1 executive produced by , written by , directed by , edited by , and produced by M0 's art director and editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ns:m.0nbtt_1 .\n?x0 ns:film.film_art_director.films_art_directed ns:m.0nbtt_1 .\nns:m.02qvsld ns:film.film.directed_by ?x0 .\nns:m.02qvsld ns:film.film.edited_by ?x0 .\nns:m.02qvsld ns:film.film.executive_produced_by ?x0 .\nns:m.02qvsld ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.02qvsld ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 48
  },
  {
    "questionIdx": 181620,
    "questionWithBrackets": "What was produced by [Recount]'s producer, executive producer, and director, distributed by [Universal Studios] and [FilmFlex], and distributed by [DreamWorks Studios]",
    "questionPatternModEntities": "What was produced by M3 's producer , executive producer , and director , distributed by M0 and M1 , and distributed by M2",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] and [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.016tw3 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.01gb54 .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.03xq0f .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:film.director.film ns:m.043mk4y .\n?x1 ns:film.producer.films_executive_produced ns:m.043mk4y .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.043mk4y\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x1 P2 M3 .\n?x1 P3 M3 .\n?x1 P4 M3\n}",
    "expectedResponse": "Meet the Fockers",
    "recursionDepth": 48
  },
  {
    "questionIdx": 164708,
    "questionWithBrackets": "What screenwriter was influenced by [Louis C.K.: Chewed Up]'s Mexican executive producer and influenced [Inside the CIA]'s executive producer, director, and star",
    "questionPatternModEntities": "What screenwriter was influenced by M2 's Mexican executive producer and influenced M1 's executive producer , director , and star",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x2 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.099m9s .\n?x1 ns:film.director.film ns:m.099m9s .\n?x1 ns:film.producer.films_executive_produced ns:m.099m9s .\n?x2 ns:film.producer.films_executive_produced ns:m.0cr_ltd .\n?x2 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 P4 M1 .\n?x2 P2 M2 .\n?x2 P5 M3\n}",
    "expectedResponse": "Ricky Gervais",
    "recursionDepth": 48
  },
  {
    "questionIdx": 80555,
    "questionWithBrackets": "Was [The Fifth Wall] directed, produced, edited, written, and executive produced by [The Private Life Of Fenfen]'s producer, director, and editor",
    "questionPatternModEntities": "Was M1 directed , produced , edited , written , and executive produced by M0 's producer , director , and editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.0_zb30t .\n?x0 ns:film.editor.film ns:m.0_zb30t .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.0_zb30t .\nns:m.0_2zrgs ns:film.film.directed_by ?x0 .\nns:m.0_2zrgs ns:film.film.edited_by ?x0 .\nns:m.0_2zrgs ns:film.film.executive_produced_by ?x0 .\nns:m.0_2zrgs ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0_2zrgs ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0 .\nM1 P5 ?x0 .\nM1 P6 ?x0 .\nM1 P7 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 44471,
    "questionWithBrackets": "Was [African Independence] executive produced by, written by, produced by, directed by, and edited by [Rhode Island School of Design]'s male employee",
    "questionPatternModEntities": "Was M2 executive produced by , written by , produced by , directed by , and edited by M0 's male employee",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.02s62q .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.0qftyqj ns:film.film.directed_by ?x0 .\nns:m.0qftyqj ns:film.film.edited_by ?x0 .\nns:m.0qftyqj ns:film.film.executive_produced_by ?x0 .\nns:m.0qftyqj ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0qftyqj ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0 .\nM2 P4 ?x0 .\nM2 P5 ?x0 .\nM2 P6 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 124359,
    "questionWithBrackets": "Were [Senseless] and [Mimic] produced by a film distributor's founder and employee, distributed by [Universal Studios], and distributed by [Miramax]",
    "questionPatternModEntities": "Were M1 and M4 produced by a film distributor 's founder and employee , distributed by M2 , and distributed by M3",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] , [VP_SIMPLE] by [entity] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.film_distributor .\nns:m.04d0ng ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.016tw3 .\nns:m.04d0ng ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0jz9f .\nns:m.04d0ng ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0bnxck ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.016tw3 .\nns:m.0bnxck ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0jz9f .\nns:m.0bnxck ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 M2 .\nM1 P2 M3 .\nM1 P3 ?x0 .\nM4 P2 M2 .\nM4 P2 M3 .\nM4 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  },
  {
    "questionIdx": 9817,
    "questionWithBrackets": "Did [Home Makeover] and [Despicable Me 2] star [Dana Gaier], star [Steve Carell] and [Russell Brand], and star [Amblimation]'s French employee",
    "questionPatternModEntities": "Did M2 and M6 star M3 , star M4 and M5 , and star M0 's French employee",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] and [entity] , and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.052_rb .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.0gwn31_ ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0gwn31_ ns:film.film.starring/ns:film.performance.actor ns:m.04t2l2 .\nns:m.0gwn31_ ns:film.film.starring/ns:film.performance.actor ns:m.06crng .\nns:m.0gwn31_ ns:film.film.starring/ns:film.performance.actor ns:m.084jxb2 .\nns:m.0h2clfr ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0h2clfr ns:film.film.starring/ns:film.performance.actor ns:m.04t2l2 .\nns:m.0h2clfr ns:film.film.starring/ns:film.performance.actor ns:m.06crng .\nns:m.0h2clfr ns:film.film.starring/ns:film.performance.actor ns:m.084jxb2\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3 .\nM2 P2 M4 .\nM2 P2 M5 .\nM6 P2 ?x0 .\nM6 P2 M3 .\nM6 P2 M4 .\nM6 P2 M5\n}",
    "expectedResponse": "No",
    "recursionDepth": 48
  }
]