[
  {
    "questionIdx": 226152,
    "questionWithBrackets": "Who was a Dutch cinematographer whose sibling married [Fons Rademakers]",
    "questionPatternModEntities": "Who was a Dutch cinematographer whose sibling married M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.059j2 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0k4c4h .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != ns:m.0k4c4h )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x1 != M3 )\n}",
    "expectedResponse": "Louis van Gasteren",
    "recursionDepth": 27
  },
  {
    "questionIdx": 156177,
    "questionWithBrackets": "What film distributor did a film producer found and [Jack L. Warner] found",
    "questionPatternModEntities": "What film distributor did a film producer found and M1 found",
    "questionTemplate": "What [NP_SIMPLE] did a [NP_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.0m593 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Warner Bros. Entertainment",
    "recursionDepth": 27
  },
  {
    "questionIdx": 89617,
    "questionWithBrackets": "Was a French film producer that [Irina Martynova] married a film director",
    "questionPatternModEntities": "Was a French film producer that M3 married a film director",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\n?x0 a ns:film.producer .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0j10qq6 .\nFILTER ( ?x0 != ns:m.0j10qq6 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 a M0 .\n?x0 a M1 .\nFILTER ( ?x0 != M3 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 127898,
    "questionWithBrackets": "Were [The Tale of Little Puppetboy] and [Mass for the Dakota Sioux] edited by and directed by a film director",
    "questionPatternModEntities": "Were M1 and M2 edited by and directed by a film director",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\nns:m.0fq6nlz ns:film.film.directed_by ?x0 .\nns:m.0fq6nlz ns:film.film.edited_by ?x0 .\nns:m.0jwgnr_ ns:film.film.directed_by ?x0 .\nns:m.0jwgnr_ ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM2 P0 ?x0 .\nM2 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 158788,
    "questionWithBrackets": "What film was edited by [Grandmother Mambo]'s cinematographer, art director, and director",
    "questionPatternModEntities": "What film was edited by M1 's cinematographer , art director , and director",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0rhnj3b .\n?x1 ns:film.director.film ns:m.0rhnj3b .\n?x1 ns:film.film_art_director.films_art_directed ns:m.0rhnj3b\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Grandmother Mambo; \u00a1Dest\u00e1palo!",
    "recursionDepth": 27
  },
  {
    "questionIdx": 62938,
    "questionWithBrackets": "Was [Kiefer Sutherland] a Canadian person whose parent played [Archbishop Hume]",
    "questionPatternModEntities": "Was M1 a Canadian person whose parent played M0",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0h1yqd9 .\nns:m.01rzqj a ns:people.person .\nns:m.01rzqj ns:people.person.nationality ns:m.0d060g .\nns:m.01rzqj ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 M3 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 142267,
    "questionWithBrackets": "What did [Beacon Pictures]'s founder executive produce and [Eric Newman] executive produce",
    "questionPatternModEntities": "What did M1 's founder executive produce and M0 executive produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0jx077 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.07htd_\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1\n}",
    "expectedResponse": "The Emperor's Club",
    "recursionDepth": 27
  },
  {
    "questionIdx": 37790,
    "questionWithBrackets": "Did a person influence [Louis C.K.: Chewed Up]'s director, editor, and executive producer",
    "questionPatternModEntities": "Did a person influence M1 's director , editor , and executive producer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:film.director.film ns:m.0cr_ltd .\n?x1 ns:film.editor.film ns:m.0cr_ltd .\n?x1 ns:film.producer.films_executive_produced ns:m.0cr_ltd\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 161615,
    "questionWithBrackets": "What person did [Lupe Fiasco] influence and a film producer influence",
    "questionPatternModEntities": "What person did M1 influence and a film producer influence",
    "questionTemplate": "What [NP_SIMPLE] did [entity] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.01wn718 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 27
  },
  {
    "questionIdx": 146531,
    "questionWithBrackets": "What did [Stefan G\u00e4rtner] executive produce and [Prisca Waldleitner]'s sibling executive produce",
    "questionPatternModEntities": "What did M0 executive produce and M1 's sibling executive produce",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0p9pgyh .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0hn_lt0 .\nFILTER ( ?x1 != ns:m.0hn_lt0 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 M1 .\nFILTER ( ?x1 != M1 )\n}",
    "expectedResponse": "Der Schuh des Manitu",
    "recursionDepth": 27
  },
  {
    "questionIdx": 22651,
    "questionWithBrackets": "Did [The Radical Romantic] and [Bunker 6] star a Canadian costume designer's child",
    "questionPatternModEntities": "Did M2 and M3 star a Canadian costume designer 's child",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x1 a ns:film.film_costumer_designer .\n?x1 ns:people.person.nationality ns:m.0d060g .\nns:m.010bxf_k ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.0zrgtjz ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M1 .\n?x1 a M0 .\nM2 P2 ?x0 .\nM3 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 177856,
    "questionWithBrackets": "What was executive produced by a film producer and executive produced by [Jonathan Shestack]",
    "questionPatternModEntities": "What was executive produced by a film producer and executive produced by M0",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.0jt49g .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 a M1\n}",
    "expectedResponse": "Waiting...; Open Grave",
    "recursionDepth": 27
  },
  {
    "questionIdx": 191130,
    "questionWithBrackets": "Which Japanese screenwriter did [Kusuo Yamada]'s female child marry",
    "questionPatternModEntities": "Which Japanese screenwriter did M3 's female child marry",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.gender ns:m.02zsn .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0hn_jqh .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Teinosuke Kinugasa",
    "recursionDepth": 27
  },
  {
    "questionIdx": 114237,
    "questionWithBrackets": "Were [Bret Easton Ellis] and [William Styron] influenced by [Gustave Flaubert] and influenced by [James Joyce]",
    "questionPatternModEntities": "Were M0 and M3 influenced by M1 and influenced by M2",
    "questionTemplate": "Were [entity] and [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.01306d ns:influence.influence_node.influenced_by ns:m.0379s .\nns:m.01306d ns:influence.influence_node.influenced_by ns:m.03_87 .\nns:m.018slq ns:influence.influence_node.influenced_by ns:m.0379s .\nns:m.018slq ns:influence.influence_node.influenced_by ns:m.03_87\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M1 .\nM0 P0 M2 .\nM3 P0 M1 .\nM3 P0 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 41360,
    "questionWithBrackets": "Did an actor of a sibling of [Tweedledum] influence [Tim Young] and [Robin Williams]",
    "questionPatternModEntities": "Did a actor of a sibling of M2 influence M0 and M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:influence.influence_node.influenced ns:m.0dzf_ .\n?x0 ns:influence.influence_node.influenced ns:m.0h_b2sk .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.024gz2 .\nFILTER ( ?x1 != ns:m.024gz2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 P2 M2 .\nFILTER ( ?x1 != M2 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 17413,
    "questionWithBrackets": "Did [R. R. Reeder]'s sibling write and executive produce a film",
    "questionPatternModEntities": "Did M0 's sibling write and executive produce a film",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ?x1 .\n?x0 ns:film.writer.film ?x1 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0c4jhqs .\n?x1 a ns:film.film .\nFILTER ( ?x0 != ns:m.0c4jhqs )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M1 .\nFILTER ( ?x0 != M0 )\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 13197,
    "questionWithBrackets": "Did [Lightstorm Entertainment]'s founder produce and edit [Avatar 4]'s prequel",
    "questionPatternModEntities": "Did M0 's founder produce and edit M1 's prequel",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.editor.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:organization.organization_founder.organizations_founded ns:m.080p6vg .\n?x1 ns:film.film.sequel ns:m.0_hb181\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x1 .\n?x1 P3 M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 206894,
    "questionWithBrackets": "Which male person that wrote [Weekend Cowgirls] did [Kaufman Astoria Studios] employ",
    "questionPatternModEntities": "Which male person that wrote M1 did M2 employ",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] did [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.writer.film ns:m.05bkp52 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0bnpwv .\n?x0 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M3 .\n?x0 a M0\n}",
    "expectedResponse": "Ray Dennis Steckler",
    "recursionDepth": 27
  },
  {
    "questionIdx": 20446,
    "questionWithBrackets": "Did [Tatsunoko Production] and [Kansas City Film Ad Company] employ a film producer's employee and founder",
    "questionPatternModEntities": "Did M1 and M2 employ a film producer 's employee and founder",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.producer .\nns:m.03wdks ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0gy7412 ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 48569,
    "questionWithBrackets": "Was [Bright Leaves] written by a cinematographer, executive producer, and star of [Photographic Memory]",
    "questionPatternModEntities": "Was M1 written by a cinematographer , executive producer , and star of M0",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ns:m.0h1gnyv .\n?x0 ns:film.cinematographer.film ns:m.0h1gnyv .\n?x0 ns:film.producer.films_executive_produced ns:m.0h1gnyv .\nns:m.07ndds ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 93138,
    "questionWithBrackets": "Was a cinematographer's employer's Japanese employee's spouse [Anuradha Bhat]",
    "questionPatternModEntities": "Was a cinematographer 's employer 's Japanese employee 's spouse M2",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x1 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x2 a ns:film.cinematographer .\nFILTER ( ns:m.0pb8j56 != ?x0 ) .\nns:m.0pb8j56 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 ?x2 .\n?x2 a M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 24925,
    "questionWithBrackets": "Did [Wendi Kenya] marry a film's star, producer, and art director",
    "questionPatternModEntities": "Did M1 marry a film 's star , producer , and art director",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.film ?x1 .\n?x0 ns:film.film_art_director.films_art_directed ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 a ns:film.film .\nFILTER ( ns:m.0qfyxcc != ?x0 ) .\nns:m.0qfyxcc ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 180925,
    "questionWithBrackets": "What was produced and written by [Butterfly L'Attesa]'s producer and cinematographer",
    "questionPatternModEntities": "What was produced and written by M0 's producer and cinematographer",
    "questionTemplate": "What was [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0ght9gt .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0ght9gt\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0\n}",
    "expectedResponse": "Medea Miracle",
    "recursionDepth": 27
  },
  {
    "questionIdx": 60796,
    "questionWithBrackets": "Was [James Broughton] a film director that [Agn\u00e8s Varda] influenced and married",
    "questionPatternModEntities": "Was M0 a film director that M2 influenced and married",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.05lmdy != ns:m.01vylt ) .\nns:m.05lmdy a ns:film.director .\nns:m.05lmdy ns:influence.influence_node.influenced_by ns:m.01vylt .\nns:m.05lmdy ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.01vylt\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M2 ) .\nM0 P0 M2 .\nM0 P1 M2 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 219127,
    "questionWithBrackets": "Who influenced a French film editor's German spouse",
    "questionPatternModEntities": "Who influenced a French film editor 's German spouse",
    "questionTemplate": "Who [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:film.editor .\n?x2 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 ?x2 .\n?x2 P1 M3 .\n?x2 a M2 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Andy Warhol",
    "recursionDepth": 27
  },
  {
    "questionIdx": 135433,
    "questionWithBrackets": "What Spanish person influenced [Hard Work on the River Douro]'s director and producer",
    "questionPatternModEntities": "What Spanish person influenced M2 's director and producer",
    "questionTemplate": "What [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.nationality ns:m.06mkj .\n?x1 ns:film.director.film ns:m.0bhgyh3 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0bhgyh3\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M2\n}",
    "expectedResponse": "Luis Bu\u00f1uel",
    "recursionDepth": 27
  },
  {
    "questionIdx": 200652,
    "questionWithBrackets": "Which female person directed and executive produced [Mwansa the Great]",
    "questionPatternModEntities": "Which female person directed and executive produced M1",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.0hzg5l0 .\n?x0 ns:film.producer.films_executive_produced ns:m.0hzg5l0 .\n?x0 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P2 M1 .\n?x0 a M0\n}",
    "expectedResponse": "Rungano Nyoni",
    "recursionDepth": 27
  },
  {
    "questionIdx": 187513,
    "questionWithBrackets": "Which British Canadian actor did [Dan Aykroyd] and [Chevy Chase] influence",
    "questionPatternModEntities": "Which British Canadian actor did M1 and M2 influence",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] did [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 ns:influence.influence_node.influenced_by ns:m.0d608 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0p_jc .\n?x0 ns:people.person.nationality ns:m.07ssc .\n?x0 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P1 M4 .\n?x0 a M0\n}",
    "expectedResponse": "Mike Myers",
    "recursionDepth": 27
  },
  {
    "questionIdx": 55485,
    "questionWithBrackets": "Was [Franco Zeffirelli] an Italian art director that married a film director",
    "questionPatternModEntities": "Was M1 a Italian art director that married a film director",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\nFILTER ( ns:m.0b_c7 != ?x0 ) .\nns:m.0b_c7 a ns:film.film_art_director .\nns:m.0b_c7 ns:people.person.nationality ns:m.03rjj .\nns:m.0b_c7 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nFILTER ( M1 != ?x0 ) .\nM1 P0 M3 .\nM1 P1 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 19367,
    "questionWithBrackets": "Did [Sloane Herz]'s parent direct and produce [Hope and Glory]'s sequel",
    "questionPatternModEntities": "Did M0 's parent direct and produce M1 's sequel",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ?x1 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0k4vc95 .\n?x1 ns:film.film.prequel ns:m.0yxf4\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x1 .\n?x1 P3 M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 19409,
    "questionWithBrackets": "Did [Sof\u00eda Boz\u00e1n] influence and marry a French film editor",
    "questionPatternModEntities": "Did M2 influence and marry a French film editor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nFILTER ( ns:m.02ptywn != ?x0 ) .\nns:m.02ptywn ns:influence.influence_node.influenced ?x0 .\nns:m.02ptywn ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nFILTER ( M2 != ?x0 ) .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 73627,
    "questionWithBrackets": "Was [Regina Debora Freud] a person whose male sibling influenced [Arnold Schoenberg]",
    "questionPatternModEntities": "Was M2 a person whose male sibling influenced M0",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.0hnlx .\n?x0 ns:people.person.gender ns:m.05zppz .\nFILTER ( ns:m.0w42hjc != ?x0 ) .\nns:m.0w42hjc a ns:people.person .\nns:m.0w42hjc ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( M2 != ?x0 ) .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  },
  {
    "questionIdx": 93622,
    "questionWithBrackets": "Was a company whose Chinese founder produced [The Crimson Charm] [Tianyi Film Company]",
    "questionPatternModEntities": "Was a company whose Chinese founder produced M1 M2",
    "questionTemplate": "Was a [NP_SIMPLE] whose [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] [entity] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.03c_vc1 .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nns:m.0_1lf9q a ns:business.employer .\nns:m.0_1lf9q ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 37834,
    "questionWithBrackets": "Did a person marry [Bloodthirsty Butchers]'s director, editor, and costume designer",
    "questionPatternModEntities": "Did a person marry M1 's director , editor , and costume designer",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.director.film ns:m.03mb2h6 .\n?x1 ns:film.editor.film ns:m.03mb2h6 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.03mb2h6 .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 75787,
    "questionWithBrackets": "Was [Seductio] written, produced, and edited by a film editor",
    "questionPatternModEntities": "Was M1 written , produced , and edited by a film editor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.editor .\nns:m.0w2zn5s ns:film.film.edited_by ?x0 .\nns:m.0w2zn5s ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0w2zn5s ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 27
  },
  {
    "questionIdx": 88830,
    "questionWithBrackets": "Was a Chinese film director that [Kung Fu Mahjong] was executive produced by [Han Sanping]",
    "questionPatternModEntities": "Was a Chinese film director that M2 was executive produced by M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.04182k6 a ns:film.director .\nns:m.04182k6 ns:film.producer.films_executive_produced ns:m.07hgp8 .\nns:m.04182k6 ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 27
  }
]