[
  {
    "questionIdx": 7250,
    "questionWithBrackets": "Did [Fantasy Chamber] and [Shut Up And Blow Me 1] star [Hayabusa: Harukanaru kikan]'s cinematographer's child and spouse",
    "questionPatternModEntities": "Did M1 and M2 star M0 's cinematographer 's child and spouse",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.cinematographer.film ns:m.0h335wh .\nFILTER ( ?x0 != ?x1 ) .\nns:m.05khfsk ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.05nthh7 ns:film.film.starring/ns:film.performance.actor ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\nFILTER ( ?x0 != ?x1 ) .\nM1 P3 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 182648,
    "questionWithBrackets": "What was produced by and directed by [Nary Hem]'s spouse and sibling",
    "questionPatternModEntities": "What was produced by and directed by M0 's spouse and sibling",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.011k737t .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.011k737t .\nFILTER ( ?x1 != ns:m.011k737t ) .\nFILTER ( ?x1 != ns:m.011k737t )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0 .\nFILTER ( ?x1 != M0 ) .\nFILTER ( ?x1 != M0 )\n}",
    "expectedResponse": "Sovann Pancha; Chek Deth",
    "recursionDepth": 28
  },
  {
    "questionIdx": 97836,
    "questionWithBrackets": "Was a film edited, executive produced, and directed by [Horace Edward Stockbridge]",
    "questionPatternModEntities": "Was a film edited , executive produced , and directed by M1",
    "questionTemplate": "Was a [NP_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ns:m.0br9r6t .\n?x0 ns:film.film.edited_by ns:m.0br9r6t .\n?x0 ns:film.film.executive_produced_by ns:m.0br9r6t\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P1 M1 .\n?x0 P2 M1 .\n?x0 a M0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 8341,
    "questionWithBrackets": "Did [George Lucas] executive produce and edit [Shake, Rattle & Roll 9]'s prequel's prequel",
    "questionPatternModEntities": "Did M1 executive produce and edit M0 's prequel 's prequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ?x1 .\n?x1 ns:film.film.sequel ns:m.03gzgdg .\nns:m.0343h ns:film.editor.film ?x0 .\nns:m.0343h ns:film.producer.films_executive_produced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 180289,
    "questionWithBrackets": "What was founded by a German person's spouse and parent",
    "questionPatternModEntities": "What was founded by a German person 's spouse and parent",
    "questionTemplate": "What was [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x2 a ns:people.person .\n?x2 ns:people.person.nationality ns:m.0345h .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 P3 M1 .\n?x2 a M0 .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Okapia-Film Productions",
    "recursionDepth": 28
  },
  {
    "questionIdx": 81084,
    "questionWithBrackets": "Was [The Holy Mountain] written and edited by [El Topo]'s French costume designer",
    "questionPatternModEntities": "Was M2 written and edited by M0 's French costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.060dpr .\n?x0 ns:people.person.nationality ns:m.0f8l9c .\nns:m.09qgls ns:film.film.edited_by ?x0 .\nns:m.09qgls ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 77394,
    "questionWithBrackets": "Was [Stepfather of the Bride] produced by and directed by a female person",
    "questionPatternModEntities": "Was M2 produced by and directed by a female person",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.0n4n_hx ns:film.film.directed_by ?x0 .\nns:m.0n4n_hx ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 142083,
    "questionWithBrackets": "What did [Anna Lubitsch]'s German child direct and executive produce",
    "questionPatternModEntities": "What did M1 's German child direct and executive produce",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x1 ns:people.person.nationality ns:m.0345h .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0n4k8f1\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M1\n}",
    "expectedResponse": "Ninotchka",
    "recursionDepth": 28
  },
  {
    "questionIdx": 77239,
    "questionWithBrackets": "Was [Stanford University]'s employee's American sibling influenced by a person",
    "questionPatternModEntities": "Was M1 's employee 's American sibling influenced by a person",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.nationality ns:m.09c7w0 .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x1 a ns:people.person .\n?x2 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.06pwq .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x0 P2 M0 .\n?x1 P3 M1 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 163912,
    "questionWithBrackets": "What production company was founded by [Joel Silver] and was founded by [Robert Zemeckis]",
    "questionPatternModEntities": "What production company was founded by M1 and was founded by M2",
    "questionTemplate": "What [NP_SIMPLE] was [VP_SIMPLE] by [entity] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.production_company .\n?x0 ns:organization.organization.founders ns:m.01f7j9 .\n?x0 ns:organization.organization.founders ns:m.03ktjq\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0\n}",
    "expectedResponse": "Dark Castle Entertainment",
    "recursionDepth": 28
  },
  {
    "questionIdx": 112081,
    "questionWithBrackets": "Were [Alex Agnew], [George Lopez], [Dave Chappelle], [Cheech Marin], and [Kenan Thompson] influenced by a film director",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 influenced by a film director",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.director .\nns:m.01xwv7 ns:influence.influence_node.influenced_by ?x0 .\nns:m.027z073 ns:influence.influence_node.influenced_by ?x0 .\nns:m.029k55 ns:influence.influence_node.influenced_by ?x0 .\nns:m.02xfj0 ns:influence.influence_node.influenced_by ?x0 .\nns:m.030wkp ns:influence.influence_node.influenced_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM2 P0 ?x0 .\nM3 P0 ?x0 .\nM4 P0 ?x0 .\nM5 P0 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 221561,
    "questionWithBrackets": "Who married a person's sibling and married [Eli Roth]",
    "questionPatternModEntities": "Who married a person 's sibling and married M1",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.058kqy .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:people.person .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.058kqy ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Peaches Geldof; Rosario Dawson",
    "recursionDepth": 28
  },
  {
    "questionIdx": 219905,
    "questionWithBrackets": "Who married [Annabella] and [Linda Christian] and married a film editor",
    "questionPatternModEntities": "Who married M1 and M2 and married a film editor",
    "questionTemplate": "Who [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.06tbs8 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.074pgd .\n?x1 a ns:film.editor .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.06tbs8 ) .\nFILTER ( ?x0 != ns:m.074pgd )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 a M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Tyrone Power",
    "recursionDepth": 28
  },
  {
    "questionIdx": 145180,
    "questionWithBrackets": "What did [Matthew Mailer]'s parent direct, produce, and edit",
    "questionPatternModEntities": "What did M0 's parent direct , produce , and edit",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ns:m.0kx97wx\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0\n}",
    "expectedResponse": "Wild 90",
    "recursionDepth": 28
  },
  {
    "questionIdx": 24591,
    "questionWithBrackets": "Did [WWJK], [WJRR], [WIYY], [KMYZ-FM], and [KEZO-FM] employ [Larry Guthrie]'s actor",
    "questionPatternModEntities": "Did M1 , M2 , M3 , M4 , and M5 employ M0 's actor",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0gyd5cr .\nns:m.025xl1p ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.06309g ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.09fjj8 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0dbch6 ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0fck3l ns:business.employer.employees/ns:business.employment_tenure.person ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM2 P1 ?x0 .\nM3 P1 ?x0 .\nM4 P1 ?x0 .\nM5 P1 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 62568,
    "questionWithBrackets": "Was [Karl Linn] a Spanish character's male sibling's sibling",
    "questionPatternModEntities": "Was M3 a Spanish character 's male sibling 's sibling",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.05zppz .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 a ns:fictional_universe.fictional_character .\n?x1 ns:people.person.nationality ns:m.06mkj .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ns:m.03crq_n != ?x0 ) .\nns:m.03crq_n ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M2 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( M3 != ?x0 ) .\nM3 P0 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 28
  },
  {
    "questionIdx": 43474,
    "questionWithBrackets": "Was [8 Mile] distributed by and produced by [Artist Management Group]'s founder's employer",
    "questionPatternModEntities": "Was M1 distributed by and produced by M0 's founder 's employer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.03cz6xx .\nns:m.017d93 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.017d93 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 227873,
    "questionWithBrackets": "Who was a Mexican film producer that edited [The Waterwheel] and [Only God Knows]",
    "questionPatternModEntities": "Who was a Mexican film producer that edited M2 and M3",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:film.editor.film ns:m.04j1498 .\n?x0 ns:film.editor.film ns:m.0pc4658 .\n?x0 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Carlos Bolado",
    "recursionDepth": 28
  },
  {
    "questionIdx": 94724,
    "questionWithBrackets": "Was a costume designer's female parent's male child [Sergio Armani]",
    "questionPatternModEntities": "Was a costume designer 's female parent 's male child M2",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x1 .\n?x0 ns:people.person.gender ns:m.02zsn .\n?x1 a ns:film.film_costumer_designer .\nns:m.0lpyn_s ns:people.person.gender ns:m.05zppz .\nns:m.0lpyn_s ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 a M1 .\nM2 P0 M3 .\nM2 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 28
  },
  {
    "questionIdx": 94870,
    "questionWithBrackets": "Was a costume designer, editor, star, and cinematographer of a film [Peter Jackson]",
    "questionPatternModEntities": "Was a costume designer , editor , star , and cinematographer of a film M1",
    "questionTemplate": "Was a [ROLE_SIMPLE] , [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of a [NP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\nns:m.0js9s ns:film.actor.film/ns:film.performance.film ?x0 .\nns:m.0js9s ns:film.cinematographer.film ?x0 .\nns:m.0js9s ns:film.editor.film ?x0 .\nns:m.0js9s ns:film.film_costumer_designer.costume_design_for_film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 219819,
    "questionWithBrackets": "Who influenced, was influenced by, and married a cinematographer",
    "questionPatternModEntities": "Who influenced , was influenced by , and married a cinematographer",
    "questionTemplate": "Who [VP_SIMPLE] , was [VP_SIMPLE] by , and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 a ns:film.cinematographer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 29
  },
  {
    "questionIdx": 238977,
    "questionWithBrackets": "Who was influenced by and influenced [The World of Jacques Demy]'s French producer",
    "questionPatternModEntities": "Who was influenced by and influenced M2 's French producer",
    "questionTemplate": "Who was [VP_SIMPLE] by and [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0bysl53 .\n?x1 ns:people.person.nationality ns:m.0f8l9c\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 29
  },
  {
    "questionIdx": 6322,
    "questionWithBrackets": "Did [Edwin S. Porter] edit, write, and produce [Don't Play Us Cheap]'s prequel",
    "questionPatternModEntities": "Did M1 edit , write , and produce M0 's prequel",
    "questionTemplate": "Did [entity] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.sequel ns:m.0cc2x89 .\nns:m.03rg1j ns:film.editor.film ?x0 .\nns:m.03rg1j ns:film.producer.film|ns:film.production_company.films ?x0 .\nns:m.03rg1j ns:film.writer.film ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 214011,
    "questionWithBrackets": "Who did [Edward Butler]'s child's country of nationality employ and [Simcyp] employ",
    "questionPatternModEntities": "Who did M2 's child 's country of nationality employ and M1 employ",
    "questionTemplate": "Who did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.043kcnl .\n?x1 ^ns:people.person.nationality ?x2 .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0hhmcrk\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 P2 M2\n}",
    "expectedResponse": "Janak Wedagedera",
    "recursionDepth": 29
  },
  {
    "questionIdx": 205073,
    "questionWithBrackets": "Which film was edited by a film editor and starred [Grazyna Staniszewska]",
    "questionPatternModEntities": "Which film was edited by a film editor and starred M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.starring/ns:film.performance.actor ns:m.0wqgh_c .\n?x1 a ns:film.editor\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "Zazdrosc i medycyna; Knights of the Teutonic Order",
    "recursionDepth": 29
  },
  {
    "questionIdx": 215693,
    "questionWithBrackets": "Who did a company's child's employee influence and marry",
    "questionPatternModEntities": "Who did a company 's child 's employee influence and marry",
    "questionTemplate": "Who did a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x2 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x3 .\n?x3 a ns:business.employer .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 P3 ?x3 .\n?x3 a M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Beth Ostrosky Stern; Gwendolyn Knight",
    "recursionDepth": 29
  },
  {
    "questionIdx": 69495,
    "questionWithBrackets": "Was [Ning Ying] a female Chinese cinematographer that produced [Born in Beijing]",
    "questionPatternModEntities": "Was M0 a female Chinese cinematographer that produced M3",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.03yjwvx a ns:film.cinematographer .\nns:m.03yjwvx ns:film.producer.film|ns:film.production_company.films ns:m.0jqy2xv .\nns:m.03yjwvx ns:people.person.gender ns:m.02zsn .\nns:m.03yjwvx ns:people.person.nationality ns:m.0d05w3\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M3 .\nM0 P2 M4 .\nM0 a M1\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 210491,
    "questionWithBrackets": "Which screenwriter influenced and was influenced by a producer of [The Gleaners and I]",
    "questionPatternModEntities": "Which screenwriter influenced and was influenced by a producer of M1",
    "questionTemplate": "Which [NP_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.09m9v4\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M1\n}",
    "expectedResponse": "Jacques Demy",
    "recursionDepth": 29
  },
  {
    "questionIdx": 63951,
    "questionWithBrackets": "Was [Law for Tombstone] written by, directed by, and produced by an art director",
    "questionPatternModEntities": "Was M1 written by , directed by , and produced by a art director",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_art_director .\nns:m.0gfqydx ns:film.film.directed_by ?x0 .\nns:m.0gfqydx ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0gfqydx ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 5729,
    "questionWithBrackets": "Did [Devesh Rawal] direct a film and executive produce a film",
    "questionPatternModEntities": "Did M1 direct a film and executive produce a film",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film .\n?x1 a ns:film.film .\nns:m.0y5vp5q ns:film.director.film ?x1 .\nns:m.0y5vp5q ns:film.producer.films_executive_produced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M0 .\nM1 P0 ?x0 .\nM1 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 17529,
    "questionWithBrackets": "Did [Raymond Demy]'s child influence and marry a writer of [The Beaches of Agn\u00e8s]",
    "questionPatternModEntities": "Did M0 's child influence and marry a writer of M1",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] a [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0n3h7qn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.writer.film ns:m.04nm0cr .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  },
  {
    "questionIdx": 238988,
    "questionWithBrackets": "Who was influenced by and influenced a costume designer of a film",
    "questionPatternModEntities": "Who was influenced by and influenced a costume designer of a film",
    "questionTemplate": "Who was [VP_SIMPLE] by and [VP_SIMPLE] a [ROLE_SIMPLE] of a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "Federico Garc\u00eda Lorca",
    "recursionDepth": 29
  },
  {
    "questionIdx": 82996,
    "questionWithBrackets": "Was [The Weinstein Company] founded by an actor that executive produced [Deadfall] and [Silver Linings Playbook]",
    "questionPatternModEntities": "Was M3 founded by a actor that executive produced M1 and M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.actor .\n?x0 ns:film.producer.films_executive_produced ns:m.0gx0plf .\n?x0 ns:film.producer.films_executive_produced ns:m.0h95927 .\nns:m.061dn_ ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\nM3 P1 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 29
  },
  {
    "questionIdx": 77736,
    "questionWithBrackets": "Was [Submission] edited by and produced by [Religious Maniac]'s Dutch actor",
    "questionPatternModEntities": "Was M2 edited by and produced by M1 's Dutch actor",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0wqdw51 .\n?x0 ns:people.person.nationality ns:m.059j2 .\nns:m.04b5hv ns:film.film.edited_by ?x0 .\nns:m.04b5hv ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 29
  }
]