[
  {
    "questionIdx": 10586,
    "questionWithBrackets": "Did [Italy] found a country of nationality of [Hans Blom] and found [UNESCO] and [World Trade Organization]",
    "questionPatternModEntities": "Did M1 found a country of nationality of M0 and found M2 and M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ns:m.03x_ncc .\nns:m.03rjj ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.03rjj ns:organization.organization_founder.organizations_founded ns:m.05yg8kx .\nns:m.03rjj ns:organization.organization_founder.organizations_founded ns:m.085h1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P1 M2 .\nM1 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 34539,
    "questionWithBrackets": "Did a film producer employ [Mickey's Revue]'s producer and employ an actor",
    "questionPatternModEntities": "Did a film producer employ M1 's producer and employ a actor",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x2 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.01pf2d .\n?x2 a ns:film.actor\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 a M0 .\n?x1 P1 M1 .\n?x2 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 71204,
    "questionWithBrackets": "Was [Pennin Perumai] written by and directed by a production company's founder and employee",
    "questionPatternModEntities": "Was M1 written by and directed by a production company 's founder and employee",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x1 a ns:film.production_company .\nns:m.0h_f0w9 ns:film.film.directed_by ?x0 .\nns:m.0h_f0w9 ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 a M0 .\nM1 P2 ?x0 .\nM1 P3 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 32
  },
  {
    "questionIdx": 14217,
    "questionWithBrackets": "Did [Martin Scorsese] and [David Lynch] marry a film director and influence a film producer",
    "questionPatternModEntities": "Did M2 and M3 marry a film director and influence a film producer",
    "questionTemplate": "Did [entity] and [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x1 a ns:film.director .\nFILTER ( ns:m.026dx != ?x1 ) .\nFILTER ( ns:m.04sry != ?x1 ) .\nns:m.026dx ns:influence.influence_node.influenced ?x0 .\nns:m.026dx ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\nns:m.04sry ns:influence.influence_node.influenced ?x0 .\nns:m.04sry ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 a M1 .\nFILTER ( M2 != ?x1 ) .\nFILTER ( M3 != ?x1 ) .\nM2 P0 ?x0 .\nM2 P1 ?x1 .\nM3 P0 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 204871,
    "questionWithBrackets": "Which film was directed by a film director and was executive produced by [Jung-soo Suh]",
    "questionPatternModEntities": "Which film was directed by a film director and was executive produced by M1",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by a [NP_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.film .\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.executive_produced_by ns:m.011r8s87 .\n?x1 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M2\n}",
    "expectedResponse": "The Traffickers",
    "recursionDepth": 32
  },
  {
    "questionIdx": 34786,
    "questionWithBrackets": "Did a film producer marry a costume designer's sibling and marry [Peter Getty]",
    "questionPatternModEntities": "Did a film producer marry a costume designer 's sibling and marry M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.producer .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0qjc774 .\n?x1 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x2 .\n?x2 a ns:film.film_costumer_designer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0qjc774 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M1 ) .\nFILTER ( ?x1 != ?x2 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 59638,
    "questionWithBrackets": "Was [Infernal Affairs] directed by [Alan Mak] and directed by [Basic Pictures]'s Chinese founder",
    "questionPatternModEntities": "Was M2 directed by M3 and directed by M0 's Chinese founder",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.02rv39k .\n?x0 ns:people.person.nationality ns:m.0d05w3 .\nns:m.0233bn ns:film.film.directed_by ?x0 .\nns:m.0233bn ns:film.film.directed_by ns:m.02vknxw\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 225012,
    "questionWithBrackets": "Who was a British cinematographer that edited and directed [Poised]",
    "questionPatternModEntities": "Who was a British cinematographer that edited and directed M2",
    "questionTemplate": "Who was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.0rh893d .\n?x0 ns:film.editor.film ns:m.0rh893d .\n?x0 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Dryden Goodwin",
    "recursionDepth": 32
  },
  {
    "questionIdx": 43227,
    "questionWithBrackets": "Was [2 Guns] distributed by [Batteries Not Included]'s producer and distributor and distributed by [TriStar Pictures]",
    "questionPatternModEntities": "Was M1 distributed by M0 's producer and distributor and distributed by M2",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.09zn92 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.09zn92 .\nns:m.0nb2hgq ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ?x0 .\nns:m.0nb2hgq ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.030_1m\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 32
  },
  {
    "questionIdx": 184437,
    "questionWithBrackets": "What was written by [Jason Richman] and executive produced by [Three Men and a Baby]'s male producer",
    "questionPatternModEntities": "What was written by M0 and executive produced by M1 's male producer",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.written_by ns:m.0jtyny .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02ttcy .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M2\n}",
    "expectedResponse": "Swing Vote",
    "recursionDepth": 32
  },
  {
    "questionIdx": 150070,
    "questionWithBrackets": "What did a film's cinematographer and star found and [Albert Yeung] found",
    "questionPatternModEntities": "What did a film 's cinematographer and star found and M0 found",
    "questionTemplate": "What did a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:organization.organization.founders ?x1 .\n?x0 ns:organization.organization.founders ns:m.06f72t .\n?x1 ns:film.actor.film/ns:film.performance.film ?x2 .\n?x1 ns:film.cinematographer.film ?x2 .\n?x2 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 a M1\n}",
    "expectedResponse": "JCE Movies Limited",
    "recursionDepth": 33
  },
  {
    "questionIdx": 233588,
    "questionWithBrackets": "Who was an actor employed by [Vitagraph Studios] and employed by a film producer",
    "questionPatternModEntities": "Who was a actor employed by M2 and employed by a film producer",
    "questionTemplate": "Who was a [NP_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.actor .\n?x0 a ns:people.person .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.01wwf0 .\n?x1 a ns:film.producer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 a M3\n}",
    "expectedResponse": "Rex Ingram",
    "recursionDepth": 33
  },
  {
    "questionIdx": 63851,
    "questionWithBrackets": "Was [Laurence Anyways] directed by and edited by [The Wizard of Speed and Time]'s director, producer, and costume designer",
    "questionPatternModEntities": "Was M1 directed by and edited by M0 's director , producer , and costume designer",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.083y0 .\n?x0 ns:film.film_costumer_designer.costume_design_for_film ns:m.083y0 .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.083y0 .\nns:m.0jkypf1 ns:film.film.directed_by ?x0 .\nns:m.0jkypf1 ns:film.film.edited_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x0 P2 M0 .\nM1 P3 ?x0 .\nM1 P4 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 157553,
    "questionWithBrackets": "What film producer employed an art director and was founded by [Roy O. Disney] and [Walt Disney]",
    "questionPatternModEntities": "What film producer employed a art director and was founded by M1 and M2",
    "questionTemplate": "What [NP_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ns:m.015yg9 .\n?x0 ns:organization.organization.founders ns:m.081nh .\n?x1 a ns:film.film_art_director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Walt Disney Animation Studios",
    "recursionDepth": 33
  },
  {
    "questionIdx": 68087,
    "questionWithBrackets": "Was [Mont Pelerin Society] a company whose founder married [Helene Bitterlich] and influenced [Nassim Nicholas Taleb]",
    "questionPatternModEntities": "Was M2 a company whose founder married M1 and influenced M0",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.045dtq .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.010hw6vl .\nFILTER ( ?x0 != ns:m.010hw6vl ) .\nns:m.02vf9y a ns:business.employer .\nns:m.02vf9y ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M1 ) .\nM2 P2 ?x0 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 28166,
    "questionWithBrackets": "Did a Japanese screenwriter influence a person and marry [Matsuko Morita]",
    "questionPatternModEntities": "Did a Japanese screenwriter influence a person and marry M2",
    "questionTemplate": "Did a [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:influence.influence_node.influenced ?x1 .\n?x0 ns:people.person.nationality ns:m.03_3d .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0m2m8jx .\n?x1 a ns:people.person .\nFILTER ( ?x0 != ns:m.0m2m8jx )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x1 a M3 .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 33534,
    "questionWithBrackets": "Did a film distributor that a producer of [Over the Hills] and [Where's Elmer?] founded distribute [Blood in the Water]",
    "questionPatternModEntities": "Did a film distributor that a producer of M2 and M3 founded distribute M1",
    "questionTemplate": "Did a [NP_SIMPLE] that a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE] [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0c407c0 .\n?x0 ns:organization.organization.founders ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0b6scr6 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.0hy_zqq\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 151482,
    "questionWithBrackets": "What did an art director produce and [Mr W\u00fcrfel]'s director and writer edit",
    "questionPatternModEntities": "What did a art director produce and M1 's director and writer edit",
    "questionTemplate": "What did a [NP_SIMPLE] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:film.director.film ns:m.0fq6l88 .\n?x1 ns:film.writer.film ns:m.0fq6l88 .\n?x2 a ns:film.film_art_director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 a M0 .\n?x2 P2 M1 .\n?x2 P3 M1\n}",
    "expectedResponse": "Room 69",
    "recursionDepth": 33
  },
  {
    "questionIdx": 93563,
    "questionWithBrackets": "Was a company that [Presidential Reunion]'s executive producer founded and was employed by [Funny or Die]",
    "questionPatternModEntities": "Was a company that M0 's executive producer founded and was employed by M1",
    "questionTemplate": "Was a [NP_SIMPLE] that [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.0gmdpnm .\nns:m.02qp3m_ a ns:business.employer .\nns:m.02qp3m_ ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.02qp3m_ ns:organization.organization.founders ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\nM1 P1 ?x0 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 142906,
    "questionWithBrackets": "What did [Davis Entertainment]'s founder and employee direct and a company produce",
    "questionPatternModEntities": "What did M1 's founder and employee direct and a company produce",
    "questionTemplate": "What did [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] [VP_SIMPLE] and a [NP_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x2 .\n?x1 ns:organization.organization_founder.organizations_founded ns:m.05nn2c .\n?x1 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.05nn2c .\n?x2 a ns:business.employer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x2 .\n?x1 a M0 .\n?x2 P2 M1 .\n?x2 P3 M1\n}",
    "expectedResponse": "Shady Talez",
    "recursionDepth": 33
  },
  {
    "questionIdx": 23314,
    "questionWithBrackets": "Did [Tom Palumbo] marry [Anne St. Marie] and marry a female sibling of [Lady Jane Grey]",
    "questionPatternModEntities": "Did M2 marry M3 and marry a female sibling of M0",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.gender ns:m.02zsn .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0b_58l .\nFILTER ( ?x0 != ns:m.0b_58l ) .\nFILTER ( ns:m.025vbkj != ?x0 ) .\nFILTER ( ns:m.025vbkj != ns:m.0_0kcb7 ) .\nns:m.025vbkj ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.025vbkj ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0_0kcb7\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M2 != ?x0 ) .\nFILTER ( M2 != M3 ) .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 215982,
    "questionWithBrackets": "Who did a film producer marry, [Virginia Nicolson] marry, and [G. K. Chesterton] influence",
    "questionPatternModEntities": "Who did a film producer marry , M2 marry , and M1 influence",
    "questionTemplate": "Who did a [NP_SIMPLE] [VP_SIMPLE] , [entity] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.037jz .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0jz8kp .\n?x1 a ns:film.producer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ns:m.0jz8kp )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x1 a M3 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != M2 )\n}",
    "expectedResponse": "Orson Welles",
    "recursionDepth": 33
  },
  {
    "questionIdx": 1338,
    "questionWithBrackets": "Did [Andy Warhol], [Talitha Getty], [Christian Dior], [Henri Matisse], and [Coco Chanel] influence [America's Best Comics]'s founder and employee",
    "questionPatternModEntities": "Did M1 , M2 , M3 , M4 , and M5 influence M0 's founder and employee",
    "questionTemplate": "Did [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ns:m.08fyv6 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.08fyv6 .\nns:m.012t9m ns:influence.influence_node.influenced ?x0 .\nns:m.037g0 ns:influence.influence_node.influenced ?x0 .\nns:m.0dxf99 ns:influence.influence_node.influenced ?x0 .\nns:m.0gct_ ns:influence.influence_node.influenced ?x0 .\nns:m.0kc6 ns:influence.influence_node.influenced ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 15753,
    "questionWithBrackets": "Did [New York: A Documentary Film]'s director's sibling influence [Daryl F. Mallett] and marry a screenwriter",
    "questionPatternModEntities": "Did M1 's director 's sibling influence M0 and marry a screenwriter",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:influence.influence_node.influenced ns:m.02xlgt .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x2 .\n?x1 ns:film.director.film ns:m.02vxlc .\n?x2 a ns:film.writer .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ?x2 )\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P2 ?x2 .\n?x1 P3 M1 .\n?x2 a M2 .\nFILTER ( ?x0 != ?x1 ) .\nFILTER ( ?x0 != ?x2 )\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 81664,
    "questionWithBrackets": "Was [The Matrix Revolutions]'s prequel written and executive produced by [Ca-bau-kan]'s female producer",
    "questionPatternModEntities": "Was M0 's prequel written and executive produced by M1 's female producer",
    "questionTemplate": "Was [entity] 's [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.sequel ns:m.01dyvs .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.02q0s1h .\n?x1 ns:people.person.gender ns:m.02zsn\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\n?x1 P4 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 147386,
    "questionWithBrackets": "What did [The Memories of Dogs]'s Italian producer produce, edit, and write",
    "questionPatternModEntities": "What did M1 's Italian producer produce , edit , and write",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ns:m.08625_4 .\n?x1 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "About Killing The Pig; Tengo la posizione",
    "recursionDepth": 33
  },
  {
    "questionIdx": 15571,
    "questionWithBrackets": "Did [Nancy Brilli] marry a screenwriter and marry an Italian actor",
    "questionPatternModEntities": "Did M3 marry a screenwriter and marry a Italian actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x1 a ns:film.actor .\n?x1 ns:people.person.nationality ns:m.03rjj .\nFILTER ( ns:m.0c1kxw0 != ?x0 ) .\nFILTER ( ns:m.0c1kxw0 != ?x1 ) .\nns:m.0c1kxw0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0 .\nns:m.0c1kxw0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M2 .\n?x1 a M1 .\nFILTER ( M3 != ?x0 ) .\nFILTER ( M3 != ?x1 ) .\nM3 P1 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 156772,
    "questionWithBrackets": "What film editor that [She Killed in Ecstasy] and [Killer Barbys] were written by was a Spanish person",
    "questionPatternModEntities": "What film editor that M2 and M3 were written by was a Spanish person",
    "questionTemplate": "What [NP_SIMPLE] that [entity] and [entity] were [VP_SIMPLE] by was a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.editor .\n?x0 a ns:people.person .\n?x0 ns:film.writer.film ns:m.02q0rsk .\n?x0 ns:film.writer.film ns:m.04j289y .\n?x0 ns:people.person.nationality ns:m.06mkj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M2 .\n?x0 P0 M3 .\n?x0 P1 M4 .\n?x0 a M0 .\n?x0 a M1\n}",
    "expectedResponse": "Jesu\u0301s Franco",
    "recursionDepth": 33
  },
  {
    "questionIdx": 66634,
    "questionWithBrackets": "Was [Massimo Marone] a parent, sibling, and spouse of a spouse and sibling of [Sharon Newman]",
    "questionPatternModEntities": "Was M1 a parent , sibling , and spouse of a spouse and sibling of M0",
    "questionTemplate": "Was [entity] a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of a [ROLE_SIMPLE] and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ns:m.0f22zn .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0f22zn .\nFILTER ( ?x0 != ns:m.0f22zn ) .\nFILTER ( ?x0 != ns:m.0f22zn ) .\nFILTER ( ns:m.0dywnh != ?x0 ) .\nFILTER ( ns:m.0dywnh != ?x0 ) .\nns:m.0dywnh ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x0 .\nns:m.0dywnh ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x0 .\nns:m.0dywnh ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nFILTER ( ?x0 != M0 ) .\nFILTER ( ?x0 != M0 ) .\nFILTER ( M1 != ?x0 ) .\nFILTER ( M1 != ?x0 ) .\nM1 P0 ?x0 .\nM1 P1 ?x0 .\nM1 P2 ?x0\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  },
  {
    "questionIdx": 140476,
    "questionWithBrackets": "What company that distributed [Danielle Steel's Kaleidoscope] and distributed [Crash Course] employed [Garrick Utley]",
    "questionPatternModEntities": "What company that distributed M2 and distributed M3 employed M1",
    "questionTemplate": "What [NP_SIMPLE] that [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:business.employer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.05y6ww .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.02rd2vg .\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.0crt42p\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 M2 .\n?x0 P1 M3 .\n?x0 a M0\n}",
    "expectedResponse": "NBC",
    "recursionDepth": 33
  },
  {
    "questionIdx": 80945,
    "questionWithBrackets": "Was [The Green Hornet] executive produced by [George W. Trendle Jr.] and executive produced by a Canadian screenwriter",
    "questionPatternModEntities": "Was M2 executive produced by M3 and executive produced by a Canadian screenwriter",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.writer .\n?x0 ns:people.person.nationality ns:m.0d060g .\nns:m.07k8rt4 ns:film.film.executive_produced_by ?x0 .\nns:m.07k8rt4 ns:film.film.executive_produced_by ns:m.083hl7l\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P1 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 33
  },
  {
    "questionIdx": 2604,
    "questionWithBrackets": "Did [Black Mambas F.C.] employ a character and employ a Dutch person",
    "questionPatternModEntities": "Did M3 employ a character and employ a Dutch person",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:fictional_universe.fictional_character .\n?x1 a ns:people.person .\n?x1 ns:people.person.nationality ns:m.059j2 .\nns:m.0crgkxr ns:business.employer.employees/ns:business.employment_tenure.person ?x0 .\nns:m.0crgkxr ns:business.employer.employees/ns:business.employment_tenure.person ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 a M0 .\n?x1 P0 M2 .\n?x1 a M1 .\nM3 P1 ?x0 .\nM3 P1 ?x1\n}",
    "expectedResponse": "No",
    "recursionDepth": 33
  }
]