[
  {
    "questionIdx": 214046,
    "questionWithBrackets": "Who did [Eraserhead]'s male art director influence and [Billy Childish] and [Chuck Munson] influence",
    "questionPatternModEntities": "Who did M4 's male art director influence and M1 and M2 influence",
    "questionTemplate": "Who did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] and [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.03f6jyw .\n?x0 ns:influence.influence_node.influenced_by ns:m.053cl_ .\n?x1 ns:film.film_art_director.films_art_directed ns:m.027jhb .\n?x1 ns:people.person.gender ns:m.05zppz\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 a M0 .\n?x1 P1 M3 .\n?x1 P2 M4\n}",
    "expectedResponse": "Garret Schuelke",
    "recursionDepth": 34
  },
  {
    "questionIdx": 104745,
    "questionWithBrackets": "Was a production company's founder employed by [Midway Games] and employed by [The Hi-Lo Country]'s distributor",
    "questionPatternModEntities": "Was a production company 's founder employed by M0 and employed by M1 's distributor",
    "questionTemplate": "Was a [NP_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:organization.organization_founder.organizations_founded ?x1 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ?x2 .\n?x0 ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.027lf1 .\n?x1 a ns:film.production_company .\n?x2 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.02w97lh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M0 .\n?x0 P1 ?x2 .\n?x1 P2 M1 .\n?x2 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 128379,
    "questionWithBrackets": "Were [To the Last Day], [Wichul], [Prince Yeonsan], [A Tender Heart], and [The Three-Day Reign] produced by [Deaf Sam-yong]'s director and producer",
    "questionPatternModEntities": "Were M1 , M2 , M3 , M4 , and M5 produced by M0 's director and producer",
    "questionTemplate": "Were [entity] , [entity] , [entity] , [entity] , and [entity] [VP_SIMPLE] by [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.director.film ns:m.05zwphf .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.05zwphf .\nns:m.05zvjxt ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.06zt4qw ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0b6mstp ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0gksxc_ ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.0gkt9g1 ns:film.film.produced_by|ns:film.film.production_companies ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM2 P2 ?x0 .\nM3 P2 ?x0 .\nM4 P2 ?x0 .\nM5 P2 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 66050,
    "questionWithBrackets": "Was [Manuel De Landa] a Mexican film editor that an employer of [Kenneth Koch] and [Hideki Yukawa] employed",
    "questionPatternModEntities": "Was M2 a Mexican film editor that a employer of M0 and M1 employed",
    "questionTemplate": "Was [entity] a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that a [ROLE_SIMPLE] of [entity] and [entity] [VP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.019p07 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.02ttr7 .\nns:m.021ql3 a ns:film.editor .\nns:m.021ql3 ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.021ql3 ns:people.person.nationality ns:m.0b90_r\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\nM2 P1 ?x0 .\nM2 P2 M4 .\nM2 a M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 85573,
    "questionWithBrackets": "Was [Virgin Group] founded by a male executive producer of [Absolute Beginners] and founded by [Richard Branson]",
    "questionPatternModEntities": "Was M2 founded by a male executive producer of M0 and founded by M3",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] of [entity] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.producer.films_executive_produced ns:m.076zs0 .\n?x0 ns:people.person.gender ns:m.05zppz .\nns:m.01f9wm ns:organization.organization.founders ?x0 .\nns:m.01f9wm ns:organization.organization.founders ns:m.0n839\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 86312,
    "questionWithBrackets": "Was [Warner Music Group] a film producer that employed [Kevin Liles] and [Alejandro Zubillaga] and employed [Edgar Bronfman, Jr.]",
    "questionPatternModEntities": "Was M0 a film producer that employed M2 and M3 and employed M4",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.02bh8z a ns:film.producer .\nns:m.02bh8z ns:business.employer.employees/ns:business.employment_tenure.person ns:m.02h4qc .\nns:m.02bh8z ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03wwrg9 .\nns:m.02bh8z ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03y914q\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P0 M3 .\nM0 P0 M4 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 221478,
    "questionWithBrackets": "Who married a film's producer and was influenced by [Philip K. Dick] and [Philip Roth]",
    "questionPatternModEntities": "Who married a film 's producer and was influenced by M1 and M2",
    "questionTemplate": "Who [VP_SIMPLE] a [NP_SIMPLE] 's [ROLE_SIMPLE] and was [VP_SIMPLE] by [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ns:m.013pp3 .\n?x0 ns:influence.influence_node.influenced_by ns:m.05qzv .\n?x0 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ?x1 .\n?x1 ns:film.producer.film|ns:film.production_company.films ?x2 .\n?x2 a ns:film.film .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 ?x2 .\n?x2 a M3 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Jonathan Lethem",
    "recursionDepth": 34
  },
  {
    "questionIdx": 140159,
    "questionWithBrackets": "What cinematographer whose sibling executive produced and edited [Machines of the Working Class] played [Student Playing Facemash #2]",
    "questionPatternModEntities": "What cinematographer whose sibling executive produced and edited M2 played M1",
    "questionTemplate": "What [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] and [VP_SIMPLE] [entity] [VP_SIMPLE] [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.cinematographer .\n?x0 ns:film.actor.film/ns:film.performance.character ns:m.0pbxdyv .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.editor.film ns:m.0gkw0fz .\n?x1 ns:film.producer.films_executive_produced ns:m.0gkw0fz .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M1 .\n?x0 a M0 .\n?x1 P2 M2 .\n?x1 P3 M2 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "James Dastoli",
    "recursionDepth": 34
  },
  {
    "questionIdx": 204407,
    "questionWithBrackets": "Which film producer was founded by [Jens Theander] and [Peter Theander] and employed [Vivi Berens Private]'s writer",
    "questionPatternModEntities": "Which film producer was founded by M1 and M2 and employed M3 's writer",
    "questionTemplate": "Which [NP_SIMPLE] was [VP_SIMPLE] by [entity] and [entity] and [VP_SIMPLE] [entity] 's [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.founders ns:g.121kwn_n .\n?x0 ns:organization.organization.founders ns:m.0bdr5k8 .\n?x1 ns:film.writer.film ns:m.0cn9qtg\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x0 a M0 .\n?x1 P2 M3\n}",
    "expectedResponse": "Rodox Trading",
    "recursionDepth": 34
  },
  {
    "questionIdx": 88488,
    "questionWithBrackets": "Was a Canadian film editor that [The Environmentalist] was written and executive produced by [Jacob Bond]",
    "questionPatternModEntities": "Was a Canadian film editor that M2 was written and executive produced by M0",
    "questionTemplate": "Was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] that [entity] was [VP_SIMPLE] and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\nns:m.0q204cc a ns:film.editor .\nns:m.0q204cc ns:film.producer.films_executive_produced ns:m.0q204bx .\nns:m.0q204cc ns:film.writer.film ns:m.0q204bx .\nns:m.0q204cc ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nM0 P0 M2 .\nM0 P1 M2 .\nM0 P2 M3 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 62613,
    "questionWithBrackets": "Was [Kate Allen] employed by [Amnesty International UK] and employed by an art director's parent's country of nationality",
    "questionPatternModEntities": "Was M1 employed by M2 and employed by a art director 's parent 's country of nationality",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ?x1 .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x2 a ns:film.film_art_director .\nns:m.025ylhs ns:people.person.employment_history/ns:business.employment_tenure.company ?x0 .\nns:m.025ylhs ns:people.person.employment_history/ns:business.employment_tenure.company ns:m.0120g5fq\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x1 P1 ?x2 .\n?x2 a M0 .\nM1 P2 ?x0 .\nM1 P2 M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 183357,
    "questionWithBrackets": "What was produced by, written by, and executive produced by a Canadian costume designer",
    "questionPatternModEntities": "What was produced by , written by , and executive produced by a Canadian costume designer",
    "questionTemplate": "What was [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 a ns:film.film_costumer_designer .\n?x1 ns:people.person.nationality ns:m.0d060g\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M1 .\n?x1 a M0\n}",
    "expectedResponse": "Fudgy Wudgy Fudge Face",
    "recursionDepth": 34
  },
  {
    "questionIdx": 64138,
    "questionWithBrackets": "Was [Leonor Fini] a costume designer that married [Stanislao Lepri] and [Andr\u00e9 Pieyre de Mandiargues] and married [Federico Veneziani]",
    "questionPatternModEntities": "Was M0 a costume designer that married M2 and M3 and married M4",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] that [VP_SIMPLE] [entity] and [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\nFILTER ( ns:m.04c6v9 != ns:m.010qxtzx ) .\nFILTER ( ns:m.04c6v9 != ns:m.06myq2 ) .\nFILTER ( ns:m.04c6v9 != ns:m.0wpbmcj ) .\nns:m.04c6v9 a ns:film.film_costumer_designer .\nns:m.04c6v9 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.010qxtzx .\nns:m.04c6v9 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.06myq2 .\nns:m.04c6v9 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0wpbmcj\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\nFILTER ( M0 != M2 ) .\nFILTER ( M0 != M3 ) .\nFILTER ( M0 != M4 ) .\nM0 P0 M2 .\nM0 P0 M3 .\nM0 P0 M4 .\nM0 a M1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 170956,
    "questionWithBrackets": "What was directed by an actor and directed by [Anne Estonilo Charles]'s British spouse",
    "questionPatternModEntities": "What was directed by a actor and directed by M2 's British spouse",
    "questionTemplate": "What was [VP_SIMPLE] by a [NP_SIMPLE] and [VP_SIMPLE] by [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.directed_by ?x2 .\n?x1 a ns:film.actor .\n?x2 ns:people.person.nationality ns:m.07ssc .\n?x2 ns:people.person.spouse_s/ns:people.marriage.spouse|ns:fictional_universe.fictional_character.married_to/ns:fictional_universe.marriage_of_fictional_characters.spouses ns:m.0jwybdh .\nFILTER ( ?x2 != ns:m.0jwybdh )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x1 a M0 .\n?x2 P1 M1 .\n?x2 P2 M2 .\nFILTER ( ?x2 != M2 )\n}",
    "expectedResponse": "Concert For New York City",
    "recursionDepth": 34
  },
  {
    "questionIdx": 39529,
    "questionWithBrackets": "Did a sequel of [The Godfather] star a film editor and star a screenwriter",
    "questionPatternModEntities": "Did a sequel of M0 star a film editor and star a screenwriter",
    "questionTemplate": "Did a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] a [NP_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.prequel ns:m.07g1sm .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x1 .\n?x0 ns:film.film.starring/ns:film.performance.actor ?x2 .\n?x1 a ns:film.editor .\n?x2 a ns:film.writer\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 ?x2 .\n?x0 P1 M0 .\n?x1 a M1 .\n?x2 a M2\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 143481,
    "questionWithBrackets": "What did [Fredrik Abrahamsen] edit and [A Hole in My Heart]'s art director, costume designer, and cinematographer write",
    "questionPatternModEntities": "What did M0 edit and M1 's art director , costume designer , and cinematographer write",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0gm0gzr .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:film.cinematographer.film ns:m.03xkr6 .\n?x1 ns:film.film_art_director.films_art_directed ns:m.03xkr6 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.03xkr6\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 P4 M1\n}",
    "expectedResponse": "Together",
    "recursionDepth": 34
  },
  {
    "questionIdx": 75180,
    "questionWithBrackets": "Was [Saimir] a film whose sequel was written by and was directed by [Mitchell Klebanoff]",
    "questionPatternModEntities": "Was M1 a film whose sequel was written by and was directed by M0",
    "questionTemplate": "Was [entity] a [NP_SIMPLE] whose [ROLE_SIMPLE] was [VP_SIMPLE] by and was [VP_SIMPLE] by [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film.directed_by ns:m.0jv92k .\n?x0 ns:film.film.written_by ns:m.0jv92k .\nns:m.0c4d4zw a ns:film.film .\nns:m.0c4d4zw ns:film.film.sequel ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\nM1 P2 ?x0 .\nM1 a M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 85338,
    "questionWithBrackets": "Was [Victory of the Faith] produced by, edited by, and written by a female person",
    "questionPatternModEntities": "Was M2 produced by , edited by , and written by a female person",
    "questionTemplate": "Was [entity] [VP_SIMPLE] by , [VP_SIMPLE] by , and [VP_SIMPLE] by a [ADJECTIVE_SIMPLE] [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:people.person .\n?x0 ns:people.person.gender ns:m.02zsn .\nns:m.08fpbz ns:film.film.edited_by ?x0 .\nns:m.08fpbz ns:film.film.produced_by|ns:film.film.production_companies ?x0 .\nns:m.08fpbz ns:film.film.written_by ?x0\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P2 ?x0 .\nM2 P3 ?x0\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 4669,
    "questionWithBrackets": "Did [Comcast] acquire a film distributor that [Carte Postale Records] acquired and acquire [United Artists]",
    "questionPatternModEntities": "Did M2 acquire a film distributor that M1 acquired and acquire M3",
    "questionTemplate": "Did [entity] [VP_SIMPLE] a [NP_SIMPLE] that [entity] [VP_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:organization.organization.acquired_by/ns:business.acquisition.acquiring_company ns:m.0f9lxzw .\nns:m.01s73z ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ?x0 .\nns:m.01s73z ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.017jv5\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M1 .\n?x0 a M0 .\nM2 P1 ?x0 .\nM2 P1 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 172422,
    "questionWithBrackets": "What was distributed by [Miramax], produced by a production company, and distributed by [eOne Films]",
    "questionPatternModEntities": "What was distributed by M0 , produced by a production company , and distributed by M1",
    "questionTemplate": "What was [VP_SIMPLE] by [entity] , [VP_SIMPLE] by a [NP_SIMPLE] , and [VP_SIMPLE] by [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0f12prt .\n?x0 ns:film.film.distributors/ns:film.film_film_distributor_relationship.distributor ns:m.0jz9f .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.production_company\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x1 a M2\n}",
    "expectedResponse": "Last Night",
    "recursionDepth": 34
  },
  {
    "questionIdx": 3079,
    "questionWithBrackets": "Did [Buddha Assassinator]'s writer's country of nationality employ [Sandra Brand] and employ [Reginald Edward Stubbs] and [Matthew Nathan]",
    "questionPatternModEntities": "Did M3 's writer 's country of nationality employ M0 and employ M1 and M2",
    "questionTemplate": "Did [entity] 's [ROLE_SIMPLE] 's [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ^ns:people.person.nationality ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.0399vv .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03d8bw .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.05yhw4h .\n?x1 ns:film.writer.film ns:m.02qqxvh\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 ?x1 .\n?x1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 190500,
    "questionWithBrackets": "Which Italian film producer executive produced [After Death] and edited [99 Women] and [Shocking Dark]",
    "questionPatternModEntities": "Which Italian film producer executive produced M3 and edited M1 and M2",
    "questionTemplate": "Which [ADJECTIVE_SIMPLE] [NP_SIMPLE] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 ns:film.editor.film ns:m.04dhp6f .\n?x0 ns:film.editor.film ns:m.09gg4mp .\n?x0 ns:film.producer.films_executive_produced ns:m.0b90lk .\n?x0 ns:people.person.nationality ns:m.03rjj\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P0 M2 .\n?x0 P1 M3 .\n?x0 P2 M4 .\n?x0 a M0\n}",
    "expectedResponse": "Bruno Mattei",
    "recursionDepth": 34
  },
  {
    "questionIdx": 142312,
    "questionWithBrackets": "What did [Berthe Grumbach]'s French child produce, executive produce, and write",
    "questionPatternModEntities": "What did M1 's French child produce , executive produce , and write",
    "questionTemplate": "What did [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] [VP_SIMPLE] , [VP_SIMPLE] , and [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.executive_produced_by ?x1 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x0 ns:film.film.written_by ?x1 .\n?x1 ns:people.person.nationality ns:m.0f8l9c .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ns:m.0swhv4z\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x0 P2 ?x1 .\n?x1 P3 M0 .\n?x1 P4 M1\n}",
    "expectedResponse": "The Silence of the Sea",
    "recursionDepth": 34
  },
  {
    "questionIdx": 5014,
    "questionWithBrackets": "Did [D. W. Griffith] found [The Bat Whispers]'s producer and distributor and found a production company",
    "questionPatternModEntities": "Did M2 found M0 's producer and distributor and found a production company",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] 's [ROLE_SIMPLE] and [ROLE_SIMPLE] and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.film_distributor.films_distributed/ns:film.film_film_distributor_relationship.film ns:m.04crf3k .\n?x0 ns:film.producer.film|ns:film.production_company.films ns:m.04crf3k .\n?x1 a ns:film.production_company .\nns:m.026ck ns:organization.organization_founder.organizations_founded ?x0 .\nns:m.026ck ns:organization.organization_founder.organizations_founded ?x1\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 M0 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P2 ?x1\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 15377,
    "questionWithBrackets": "Did [My Favorite Spy] star [Chester Conklin] and star a film producer's male actor",
    "questionPatternModEntities": "Did M2 star M3 and star a film producer 's male actor",
    "questionTemplate": "Did [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] a [NP_SIMPLE] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:film.actor.film/ns:film.performance.character ?x1 .\n?x0 ns:people.person.gender ns:m.05zppz .\n?x1 a ns:film.producer .\nns:m.02wwdml ns:film.film.starring/ns:film.performance.actor ?x0 .\nns:m.02wwdml ns:film.film.starring/ns:film.performance.actor ns:m.07__pr\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x1 a M1 .\nM2 P2 ?x0 .\nM2 P2 M3\n}",
    "expectedResponse": "Yes",
    "recursionDepth": 34
  },
  {
    "questionIdx": 236454,
    "questionWithBrackets": "Who was influenced by [Johnny Carson] and influenced by a film director's child and parent",
    "questionPatternModEntities": "Who was influenced by M1 and influenced by a film director 's child and parent",
    "questionTemplate": "Who was [VP_SIMPLE] by [entity] and [VP_SIMPLE] by a [NP_SIMPLE] 's [ROLE_SIMPLE] and [ROLE_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:influence.influence_node.influenced_by ?x1 .\n?x0 ns:influence.influence_node.influenced_by ns:m.0ph2w .\n?x1 ns:people.person.children|ns:fictional_universe.fictional_character.children|ns:organization.organization.child/ns:organization.organization_relationship.child ?x2 .\n?x1 ns:people.person.parents|ns:fictional_universe.fictional_character.parents|ns:organization.organization.parent/ns:organization.organization_relationship.parent ?x2 .\n?x2 a ns:film.director\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 ?x2 .\n?x1 P2 ?x2 .\n?x2 a M2\n}",
    "expectedResponse": "Meena Dimian",
    "recursionDepth": 34
  },
  {
    "questionIdx": 157984,
    "questionWithBrackets": "What film producer was a Mexican person whose sibling wrote [S\u00edstole Di\u00e1stole] and [Love in the Time of Hysteria]",
    "questionPatternModEntities": "What film producer was a Mexican person whose sibling wrote M3 and M4",
    "questionTemplate": "What [NP_SIMPLE] was a [ADJECTIVE_SIMPLE] [NP_SIMPLE] whose [ROLE_SIMPLE] [VP_SIMPLE] [entity] and [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:film.producer .\n?x0 a ns:people.person .\n?x0 ns:people.person.nationality ns:m.0b90_r .\n?x0 ns:people.person.sibling_s/ns:people.sibling_relationship.sibling|ns:fictional_universe.fictional_character.siblings/ns:fictional_universe.sibling_relationship_of_fictional_characters.siblings ?x1 .\n?x1 ns:film.writer.film ns:m.092c5s .\n?x1 ns:film.writer.film ns:m.0rhnsyg .\nFILTER ( ?x0 != ?x1 )\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M2 .\n?x0 a M0 .\n?x0 a M1 .\n?x1 P2 M3 .\n?x1 P2 M4 .\nFILTER ( ?x0 != ?x1 )\n}",
    "expectedResponse": "Alfonso Cuar\u00f3n; Carlos Cuar\u00f3n",
    "recursionDepth": 34
  },
  {
    "questionIdx": 145736,
    "questionWithBrackets": "What did [Patsy van Ettinger] executive produce, a costume designer produce, and [T. Scott Layman] edit",
    "questionPatternModEntities": "What did M0 executive produce , a costume designer produce , and M1 edit",
    "questionTemplate": "What did [entity] [VP_SIMPLE] , a [NP_SIMPLE] [VP_SIMPLE] , and [entity] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.edited_by ns:m.0nhnxvl .\n?x0 ns:film.film.executive_produced_by ns:m.0gbx5b9 .\n?x0 ns:film.film.produced_by|ns:film.film.production_companies ?x1 .\n?x1 a ns:film.film_costumer_designer\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x0 P2 M1 .\n?x1 a M2\n}",
    "expectedResponse": "Julie & Jack",
    "recursionDepth": 34
  },
  {
    "questionIdx": 144374,
    "questionWithBrackets": "What did [John Houseman] write and [Chimes at Midnight]'s director, star, and costume designer direct",
    "questionPatternModEntities": "What did M0 write and M1 's director , star , and costume designer direct",
    "questionTemplate": "What did [entity] [VP_SIMPLE] and [entity] 's [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] [VP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.written_by ns:m.01vsps .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.07jpg0 .\n?x1 ns:film.director.film ns:m.07jpg0 .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.07jpg0\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M0 .\n?x0 P1 ?x1 .\n?x1 P2 M1 .\n?x1 P3 M1 .\n?x1 P4 M1\n}",
    "expectedResponse": "Citizen Kane",
    "recursionDepth": 34
  },
  {
    "questionIdx": 42738,
    "questionWithBrackets": "Did an employer of a star of [Recount] acquire [Gridware] and acquire [Titan Aerospace]",
    "questionPatternModEntities": "Did a employer of a star of M2 acquire M0 and acquire M1",
    "questionTemplate": "Did a [ROLE_SIMPLE] of a [ROLE_SIMPLE] of [entity] [VP_SIMPLE] [entity] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.0128rwdj .\n?x0 ns:organization.organization.companies_acquired/ns:business.acquisition.company_acquired ns:m.05m0ylk .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.043mk4y\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P1 M0 .\n?x0 P1 M1 .\n?x1 P2 M2\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 171107,
    "questionWithBrackets": "What was directed by and edited by a star, costume designer, and cinematographer of [The Brown Bunny]",
    "questionPatternModEntities": "What was directed by and edited by a star , costume designer , and cinematographer of M0",
    "questionTemplate": "What was [VP_SIMPLE] by and [VP_SIMPLE] by a [ROLE_SIMPLE] , [ROLE_SIMPLE] , and [ROLE_SIMPLE] of [entity]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 ns:film.film.directed_by ?x1 .\n?x0 ns:film.film.edited_by ?x1 .\n?x1 ns:film.actor.film/ns:film.performance.film ns:m.01n9cy .\n?x1 ns:film.cinematographer.film ns:m.01n9cy .\n?x1 ns:film.film_costumer_designer.costume_design_for_film ns:m.01n9cy\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 ?x1 .\n?x0 P1 ?x1 .\n?x1 P2 M0 .\n?x1 P3 M0 .\n?x1 P4 M0\n}",
    "expectedResponse": "The Brown Bunny; Promises Written in Water",
    "recursionDepth": 34
  },
  {
    "questionIdx": 33507,
    "questionWithBrackets": "Did a film distributor employ [The Secret World Of Foley]'s British writer and employ [Abdoulaye Yerodia Ndombasi]",
    "questionPatternModEntities": "Did a film distributor employ M2 's British writer and employ M1",
    "questionTemplate": "Did a [NP_SIMPLE] [VP_SIMPLE] [entity] 's [ADJECTIVE_SIMPLE] [ROLE_SIMPLE] and [VP_SIMPLE] [entity]",
    "sparql": "SELECT count(*) WHERE {\n?x0 a ns:film.film_distributor .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ?x1 .\n?x0 ns:business.employer.employees/ns:business.employment_tenure.person ns:m.03r9n3 .\n?x1 ns:film.writer.film ns:m.0110n4_9 .\n?x1 ns:people.person.nationality ns:m.07ssc\n}",
    "sparqlPattern": "SELECT count(*) WHERE {\n?x0 P0 ?x1 .\n?x0 P0 M1 .\n?x0 a M0 .\n?x1 P1 M2 .\n?x1 P2 M3\n}",
    "expectedResponse": "No",
    "recursionDepth": 34
  },
  {
    "questionIdx": 216658,
    "questionWithBrackets": "Who directed [A Bucket of Blood], executive produced [Cover Girl Models], and produced a film",
    "questionPatternModEntities": "Who directed M2 , executive produced M1 , and produced a film",
    "questionTemplate": "Who [VP_SIMPLE] [entity] , [VP_SIMPLE] [entity] , and [VP_SIMPLE] a [NP_SIMPLE]",
    "sparql": "SELECT DISTINCT ?x0 WHERE {\n?x0 a ns:people.person .\n?x0 ns:film.director.film ns:m.0bxnsk .\n?x0 ns:film.producer.films_executive_produced ns:m.0gkrpw7 .\n?x0 ns:film.producer.film|ns:film.production_company.films ?x1 .\n?x1 a ns:film.film\n}",
    "sparqlPattern": "SELECT DISTINCT ?x0 WHERE {\n?x0 P0 M1 .\n?x0 P1 ?x1 .\n?x0 P2 M2 .\n?x0 a M0 .\n?x1 a M3\n}",
    "expectedResponse": "Roger Corman",
    "recursionDepth": 34
  }
]